Rosetta_Stone_Translation.org
#+INCLUDE: theme/style.org 
#+TITLE: Rosetta Stone - English/Portuguese Technical Terminology 
#+DESCRIPTION: Dictionary about English/Portuguese technical terminology organized by topic. 
#+AUTHOR:      
#+STARTUP: content 

* Technical Terminology - English/Portuguese 
** English Punctuation

|-------------+-------------------------------+------------------------------------------------------------------------------|
| Punctuation | English                       | Portuguese                                                                   |
|-------------+-------------------------------+------------------------------------------------------------------------------|
| (.)         | dot                           | ponto                                                                        |
| (,)         | comma                         | vírgula                                                                      |
| (*)         | times, star or wildcard       | vezes                                                                        |
| (;)         | semicolon                     | ponto e vírgula                                                              |
| (:)         | colon                         | dois pontos                                                                  |
| (/)         | forward slash                 | barra inclinada para direita                                                 |
| (\)         | backward slash                | barra inclinada para esquerda                                                |
| (\vert)     | bar                           | barra                                                                        |
| (')         | single quote                  | aspas                                                                        |
| (")         | double quote                  | aspas duplas                                                                 |
| (~$)~         | dollar sign                   | cifrão                                                                       |
| (~#)~         | number sign; hash; pound-sign | hashtag, "jogo da velha", tralha, cerquilha, cardinal, cancela (programação) |
| (?)         | question mark                 | interrogação                                                                 |
| (!)         | exclamation mark              | exclamação                                                                   |
| (&)         | ampersand                     | 'e' comercial                                                                |
| (@)         | at, at sign                   | arrôba                                                                       |
| (_)         | underscore                    | sublinahdo                                                                   |
| (`)         | backticks                     | acento agudo                                                                 |
| (~)         | tilde                         | acento til                                                                   |
| (+)         | plus                          | mais, adição                                                                 |
| (-)         | minus                         | menos, subtração                                                             |
| (-)         | dash                          | traço                                                                        |
| (%)         | division sign, percent sign   | porcento ou divisão                                                          |
| (>)         | Greater than sign             | maior que                                                                    |
| (<)         | Less than sign                | menor que                                                                    |
| (¶)         | Pillcrow                      | Marcação de paragráfo                                                        |
| (§)         | Silcrow, section sign         | Marcação de section                                                          |
| (…)         | Ellipsis                      | -                                                                            |
| (®)         | Trademark symbol              | marca registrada                                                             |
| (™)         | Trademark symbol              | marca registrada                                                             |
| '(' and ')' | parenthesis, round brackets   | parenteses                                                                   |
| '[' and ']' | square brackets               | colchetes                                                                    |
| '{' and '}' | curly brackets                | chaves                                                                       |
|-------------+-------------------------------+------------------------------------------------------------------------------|
