Rosetta_Stone_Translation.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-05-26 Thu 20:17 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Rosetta Stone - English/Portuguese Technical Terminology</title>
<meta name="generator" content="Org mode" />
<meta name="description" content="Dictionary about English/Portuguese technical terminology organized by topic."
 />
<meta name="viewport" content="width=device-width, minimum-scale=1.0, maximum-scale=1.0" />
<link href="theme/org-nav-theme.css" rel="stylesheet">
<link rel="icon" href="favicon.ico" type="image/vnd.microsoft.icon" />
</head>
<body>
<div id="content">
<h1 class="title">Rosetta Stone - English/Portuguese Technical Terminology</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org89099d1">1. Technical Terminology - English/Portuguese</a>
<ul>
<li><a href="#org6a85c37">1.1. English Punctuation</a></li>
<li><a href="#org06639b5">1.2. Terminology Table</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org89099d1" class="outline-2">
<h2 id="org89099d1"><span class="section-number-2">1</span> Technical Terminology - English/Portuguese</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org6a85c37" class="outline-3">
<h3 id="org6a85c37"><span class="section-number-3">1.1</span> English Punctuation</h3>
<div class="outline-text-3" id="text-1-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Punctuation</th>
<th scope="col" class="org-left">English</th>
<th scope="col" class="org-left">Portuguese</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">(.)</td>
<td class="org-left">dot</td>
<td class="org-left">ponto</td>
</tr>

<tr>
<td class="org-left">(,)</td>
<td class="org-left">comma</td>
<td class="org-left">vírgula</td>
</tr>

<tr>
<td class="org-left">(*)</td>
<td class="org-left">times, star or wildcard</td>
<td class="org-left">vezes</td>
</tr>

<tr>
<td class="org-left">(;)</td>
<td class="org-left">semicolon</td>
<td class="org-left">ponto e vírgula</td>
</tr>

<tr>
<td class="org-left">(:)</td>
<td class="org-left">colon</td>
<td class="org-left">dois pontos</td>
</tr>

<tr>
<td class="org-left">(/)</td>
<td class="org-left">forward slash</td>
<td class="org-left">barra inclinada para direita</td>
</tr>

<tr>
<td class="org-left">(\)</td>
<td class="org-left">backward slash</td>
<td class="org-left">barra inclinada para esquerda</td>
</tr>

<tr>
<td class="org-left">(&vert;)</td>
<td class="org-left">bar</td>
<td class="org-left">barra</td>
</tr>

<tr>
<td class="org-left">(')</td>
<td class="org-left">single quote</td>
<td class="org-left">aspas</td>
</tr>

<tr>
<td class="org-left">(")</td>
<td class="org-left">double quote</td>
<td class="org-left">aspas duplas</td>
</tr>

<tr>
<td class="org-left">(<code>$)</code></td>
<td class="org-left">dollar sign</td>
<td class="org-left">cifrão</td>
</tr>

<tr>
<td class="org-left">(<code>#)</code></td>
<td class="org-left">number sign; hash; pound-sign</td>
<td class="org-left">hashtag, "jogo da velha", tralha, cerquilha, cardinal, cancela (programação)</td>
</tr>

<tr>
<td class="org-left">(?)</td>
<td class="org-left">question mark</td>
<td class="org-left">interrogação</td>
</tr>

<tr>
<td class="org-left">(!)</td>
<td class="org-left">exclamation mark</td>
<td class="org-left">exclamação</td>
</tr>

<tr>
<td class="org-left">(&amp;)</td>
<td class="org-left">ampersand</td>
<td class="org-left">'e' comercial</td>
</tr>

<tr>
<td class="org-left">(@)</td>
<td class="org-left">at, at sign</td>
<td class="org-left">arrôba</td>
</tr>

<tr>
<td class="org-left">(_)</td>
<td class="org-left">underscore</td>
<td class="org-left">sublinahdo</td>
</tr>

<tr>
<td class="org-left">(`)</td>
<td class="org-left">backticks</td>
<td class="org-left">acento agudo</td>
</tr>

<tr>
<td class="org-left">(~)</td>
<td class="org-left">tilde</td>
<td class="org-left">acento til</td>
</tr>

<tr>
<td class="org-left">(+)</td>
<td class="org-left">plus</td>
<td class="org-left">mais, adição</td>
</tr>

<tr>
<td class="org-left">(-)</td>
<td class="org-left">minus</td>
<td class="org-left">menos, subtração</td>
</tr>

<tr>
<td class="org-left">(-)</td>
<td class="org-left">dash</td>
<td class="org-left">traço</td>
</tr>

<tr>
<td class="org-left">(%)</td>
<td class="org-left">division sign, percent sign</td>
<td class="org-left">porcento ou divisão</td>
</tr>

<tr>
<td class="org-left">(&gt;)</td>
<td class="org-left">Greater than sign</td>
<td class="org-left">maior que</td>
</tr>

<tr>
<td class="org-left">(&lt;)</td>
<td class="org-left">Less than sign</td>
<td class="org-left">menor que</td>
</tr>

<tr>
<td class="org-left">(¶)</td>
<td class="org-left">Pillcrow</td>
<td class="org-left">Marcação de paragráfo</td>
</tr>

<tr>
<td class="org-left">(§)</td>
<td class="org-left">Silcrow, section sign</td>
<td class="org-left">Marcação de section</td>
</tr>

<tr>
<td class="org-left">(…)</td>
<td class="org-left">Ellipsis</td>
<td class="org-left">-</td>
</tr>

<tr>
<td class="org-left">(®)</td>
<td class="org-left">Trademark symbol</td>
<td class="org-left">marca registrada</td>
</tr>

<tr>
<td class="org-left">(™)</td>
<td class="org-left">Trademark symbol</td>
<td class="org-left">marca registrada</td>
</tr>

<tr>
<td class="org-left">'(' and ')'</td>
<td class="org-left">parenthesis, round brackets</td>
<td class="org-left">parenteses</td>
</tr>

<tr>
<td class="org-left">'[' and ']'</td>
<td class="org-left">square brackets</td>
<td class="org-left">colchetes</td>
</tr>

<tr>
<td class="org-left">'{' and '}'</td>
<td class="org-left">curly brackets</td>
<td class="org-left">chaves</td>
</tr>
</tbody>
</table>
</div>
</div>
