Rosetta_Stone_Translation.org
** Terminology Table

|-------------------------------------------------------------------+-------------------------------------------------------------------------------------------------------------------------------------------------------+---|
| English / Inglês                                                  | Portuguese / Português                                                                                                                                |   |
|-------------------------------------------------------------------+-------------------------------------------------------------------------------------------------------------------------------------------------------+---|
| kernel                                                            | núcleo ou núcleo de sistema operacional ou núcleo do sistema.                                                                                         |   |
| bootloader                                                        | carregador de inicialização. Software ou firmware que carrega um sistema operacional. Exemplo: grub, bios, U-boot.                                    |   |
| processor core                                                    | núcleo de processador                                                                                                                                 |   |
| process                                                           | processo - programa em execução                                                                                                                       |   |
| thread                                                            | linha de execução; ou fluxo de execução independente em um processo.                                                                                  |   |
| thread                                                            | linha de conversação (assunto) em foruns ou email.                                                                                                    |   |
| user-space thread                                                 | thread de espaço do usuário (greenthread)                                                                                                             |   |
| kernel thread;                                                    |                                                                                                                                                       |   |
| software library                                                  | biblioteca de software                                                                                                                                |   |
| runtime                                                           | pode significar: biblioteca de execução, motor de execução ou ambiente de execução                                                                    |   |
| runtime library                                                   | biblioteca de execução, tal como a GLIBC (GNU C LIbrary ou MUSL C library) do GNU/Linux                                                               |   |
| runtime enviroment                                                | ambiente de execução ou de tempo de execução                                                                                                          |   |
| runtime engine                                                    | motor de execução                                                                                                                                     |   |
| container runtime engine                                          | motor de execução de container, exemplos: Docker ou podman (RedHat)                                                                                   |   |
| standard library                                                  | biblioteca padrão                                                                                                                                     |   |
| programming language                                              | linguagem de programação                                                                                                                              |   |
| SW - sofware                                                      | programa de computador                                                                                                                                |   |
| HW - hardware                                                     | dispositivo físico                                                                                                                                    |   |
| Standardization committee                                         | Comitê de padronização                                                                                                                                |   |
| Standardization body                                              | Comitê de padronização, similar ao comitê ISO.                                                                                                        |   |
|                                                                   |                                                                                                                                                       |   |
|-------------------------------------------------------------------+-------------------------------------------------------------------------------------------------------------------------------------------------------+---|
| *Algorithms and Data Structures*                                    |                                                                                                                                                       |   |
|-------------------------------------------------------------------+-------------------------------------------------------------------------------------------------------------------------------------------------------+---|
| datum                                                             | dado  (singular)                                                                                                                                      |   |
| data                                                              | dados (plural)                                                                                                                                        |   |
| metadata                                                          | metadados => Dados sobre os dados, tal como hash ou nome de um arquivo.                                                                               |   |
| algorithm                                                         | algoritimo, sequências de passos para resolver um problema.                                                                                           |   |
| pseudocode                                                        | peseudo código (pronunciado como sudocode)                                                                                                            |   |
| array                                                             | cadeia de elementos ordenados continuamente na memória com acesso aleatório.                                                                          |   |
| string                                                            | cadeia de caracteres, tipo de dados que representa texto                                                                                              |   |
| stack                                                             | pilha                                                                                                                                                 |   |
| stack overflow                                                    | estouro de pilha - quando se empilha mais elementos que a capacidade da pilha ou em pode acontecer em recursão excessiva.                             |   |
| call stack                                                        | pilha de chamadas de funções em um processo.                                                                                                          |   |
| queue                                                             | fila                                                                                                                                                  |   |
| task queue                                                        | fila de tarefas                                                                                                                                       |   |
| message queue                                                     | fila de mensagens                                                                                                                                     |   |
| sets                                                              | conjuntos - estrutura de dados que modela algebra de conjuntos. Não pode haver elementos repetidos.                                                   |   |
| hash table                                                        | tabela hash, conhecido como dicionário                                                                                                                |   |
| dictionary                                                        | outro nome para tabela hash ou dicionário                                                                                                             |   |
| map (hash map)                                                    | outro nome para tabela hash ou dicionário                                                                                                             |   |
| job queue                                                         | fila de tarefas ou fila de trabalhos                                                                                                                  |   |
| linked list                                                       | lista encadeada                                                                                                                                       |   |
| priority queue                                                    | fila de prioridades                                                                                                                                   |   |
| tree                                                              | arvore                                                                                                                                                |   |
| binary tree                                                       | arvore binária                                                                                                                                        |   |
| graph                                                             | grafo                                                                                                                                                 |   |
| DAG - Directed Acyclic Graph                                      | Grafo dirigido acíclico                                                                                                                               |   |
| FIFO - First-In First-Out                                         | Primeiro entra, primeiro sai. (Fila ou queue)                                                                                                         |   |
| LIFO - Last-In First-Out                                          | Último entra, primeiro sai. (Pilha ou stack)                                                                                                          |   |
|                                                                   |                                                                                                                                                       |   |
| performance                                                       | desempenho                                                                                                                                            |   |
| performance bottleneck                                            | gargalo de performance                                                                                                                                |   |
| performance improvements                                          | melhorias de performance/desempenho                                                                                                                   |   |
| performance enhancements                                          | melhorias de performance/desempenho                                                                                                                   |   |
| time and space tradeoff                                           | balanço entre tempo e espaço                                                                                                                          |   |
| data structure memory laoyout                                     | formato da estrutura de dados em memória                                                                                                              |   |
| FSM - Finite State Machine                                        | Máquina de estados finitos                                                                                                                            |   |
|                                                                   |                                                                                                                                                       |   |
| algorithm                                                         | algoritimo - sequência finita de passos para resolver um problema                                                                                     |   |
| algorithm efficiency                                              | eficiência de algoritimo                                                                                                                              |   |
| pseudocode (pronounced as 'sudocode')                             | pseudo-código                                                                                                                                         |   |
| computational complexity theory                                   | teoria da complexidade computacional                                                                                                                  |   |
| sorting                                                           | ordenação                                                                                                                                             |   |
| sorting algorithm                                                 | algoritimo de ordenação                                                                                                                               |   |
| bubble sorting                                                    | algoritimo de ordenação da bolha                                                                                                                      |   |
| GCD - Greatest Common Divisor                                     | algoritimo do máximo divisor comun                                                                                                                    |   |
| computer graphics algorithm                                       | algoritimos de computação gráfica                                                                                                                     |   |
| numerical methodos                                                | métodos numéricos, algoritmos para resolver problemas matemáticos sem forma fechada (closed form solution)                                            |   |
| numerical computing algorithm                                     | algoritimo de computação numérica (métodos numéricos)                                                                                                 |   |
| root finding algorithm                                            | método numéricos para encontrar raízes de equações não lineares.                                                                                      |   |
| Newton-Raphson method (algorithm)                                 | método de Newton-Raphson, usado encontrar raiz de equações não lineares (root finding)                                                                |   |
|                                                                   |                                                                                                                                                       |   |
|-------------------------------------------------------------------+-------------------------------------------------------------------------------------------------------------------------------------------------------+---|
| *Miscellaneous*                                                     |                                                                                                                                                       |   |
|-------------------------------------------------------------------+-------------------------------------------------------------------------------------------------------------------------------------------------------+---|
| To debug                                                          | depurar                                                                                                                                               |   |
| Troubleshoot                                                      | Solução de problemas                                                                                                                                  |   |
| Troubleshooting                                                   | Solução/Investigação de problemas                                                                                                                     |   |
| Class  inheritance                                                | herança de classes                                                                                                                                    |   |
| Operator overloading                                              | sobrecarga de operadores                                                                                                                              |   |
| Method overriding                                                 | Sobreposição de método                                                                                                                                |   |
| Override a method                                                 | Sobrepor um método de uma classe                                                                                                                      |   |
| Exception handling                                                | tratamento de exceções                                                                                                                                |   |
| Exception handler                                                 | tratador de exceções, código que trata exceção                                                                                                        |   |
| Event handler                                                     | tratador de eventos                                                                                                                                   |   |
| Event handling                                                    | tratamento de eventos                                                                                                                                 |   |
| Error handling                                                    | tratamento de erros                                                                                                                                   |   |
| Error prone                                                       | propenso a erro                                                                                                                                       |   |
| Callback                                                          | função suprida pelo usuário que será chamada depois pelo framework.                                                                                   |   |
| hook                                                              | gancho, interceptação, ponto de interceptação ou o mesmo que callback.                                                                                |   |
|                                                                   |                                                                                                                                                       |   |
| _Semiconductor foundry_                                             | Fábrica de semicondutores ou de circuitos integrados                                                                                                  |   |
| Fabless semiconductor company                                     | Empresa de semicondur sem fábrica própria como AMD e Nvidia.                                                                                          |   |
| Chipmaker                                                         | Fabricante ou projetista de semicondutores.                                                                                                           |   |
| IC - Integrated Circuit                                           | CI - Circuito Integrado                                                                                                                               |   |
| _IP Core_ (Intelectual Property Core)                               | Núcleos/Blocos de CI de propriedade intelectual que podem ser licenciados a outras empreas como _ARM core_, _MIPS_ core e _PowerPC core_.                   |   |
| SoC - System-On-Chip                                              | Sistema no Chip (no CI - Circuito Integrado)                                                                                                          |   |
| ISA - Instruction Set Architecture                                | Conjunto de Instruções de Arquitetura                                                                                                                 |   |
| RISCV ISA                                                         | ISA (Instruction Set Architecture) open source e bloco de IC open source que pode ser usado por qualquer chipmaker.                                   |   |
| HSA - Heterogenous System Architecture                            | Sistema  de Arquitetura Heterogênea. Arquitetura de semicondutor que integra CPU, GPU e DSP e um mesmo chip. (cada vez mais comum)                    |   |
| HCA - Heterogenous Computing Architecture                         | O mesmo que HSA                                                                                                                                       |   |
| CPU - Central Processing Unit                                     | Unidade de Processamento Central                                                                                                                      |   |
| CPU Core                                                          | Núcleo de processador                                                                                                                                 |   |
| CPU Cache                                                         | Cache ou cacho de CPU - memória embutida na CPU, buffer entre CPU e RAM, quanto maior o CPU cache melhor.                                             |   |
| CPU socket                                                        | Local para conectar chip de CPU na placa mãe (motherboard, logic board)                                                                               |   |
| Multicore CPU                                                     | CPU de multiplos núcleos                                                                                                                              |   |
| MPU - Microprocessor Unit                                         | Unidade de micro processador                                                                                                                          |   |
| MCU - Microcontroller Unit                                        | Unidade de Microcontrolador                                                                                                                           |   |
| DSP - Digital Signal Processo                                     | Processador Digital de Sinais                                                                                                                         |   |
| FPU - Floating Point Unit                                         | Unidade de Ponto de Flutuante (co-processador matemático, hoje é embutido nas CPUs)                                                                   |   |
| GPU - Graphics Processing Unit                                    | Unidade de Processamento Gráfico                                                                                                                      |   |
| iGPU - Integrated GPU                                             | GPU embutida no mesmo chip da CPU (SoC - System-On-Chip)                                                                                              |   |
| eGPU - Dediccated GPU                                             | GPU não embutidad em CPU disponível em placa com conexão para barramento (bus) PCI.                                                                   |   |
| dGPU - External GPU                                               | GPU externa que pode ser conectada a laptops ou notebooks sem espaço para GPU dedicada.                                                               |   |
| TPU - Tensor Processing Unit                                      | Unidade de Processamento de Tensor (Introduzido por Google, ABC inc. para aceleração de  machine learning)                                            |   |
| PLD - Programmable Logic Device                                   | Dispositivo Lógico Programável                                                                                                                        |   |
| ASIC - Application Specific Integrated Circuit                    | Circuito Integrado de Aplicação Específica                                                                                                            |   |
| FPGA - Field Programmable Gate Array                              | CI programável usado para prototipar CPUs, GPUs, TPUs e criar ICs para aceleração de software em hardware.                                            |   |
| MMU - Memory Management Unit (Virtual Memory)                     | Unidade Gerenciamento de Memória - que provê memória virtual (virtual memory). Hoje todos processadores modernos tem MMU embutida.                    |   |
| RAM - Random Access Memory                                        | Memória de Acesso Aleatório, memório principal do computador                                                                                          |   |
| SRAM - Static RAM                                                 | RAM estática                                                                                                                                          |   |
| DRAM - Dynamic RAM                                                | RAM dinâmica                                                                                                                                          |   |
| NVRAM - Non Volatile RAM                                          | RAM não volátil                                                                                                                                       |   |
| Hardware acceleration                                             | Aceleração em hardware                                                                                                                                |   |
| TTY - Teletywriter, teletype printer                              | Impressora de telegrafos, primeiro terminal e dispositivo para uso interativo de computadores.                                                        |   |
| MEMS - Micro Electro-Mechanical Systems                           | Sensores mecânicos como acelerômetros e giroscópios (mede aceleração angular) construídos como circuito integrado (IC)                                |   |
|                                                                   |                                                                                                                                                       |   |
| MMIO - Memory Mapped IO (Input/Output) - (Embedded systems)       | Entrada/Saida mapeda em memória (sistemas embarcados / sistemas embutidos)                                                                            |   |
| PMIO - Port-Mapped IO  - (Embedded systems)                       | Entrada/Saída mapeda em porta   (sistemas embarcados / sistemas embutidos)                                                                            |   |
|                                                                   |                                                                                                                                                       |   |
| Abstraction Layer                                                 | Camada de abstração                                                                                                                                   |   |
| HAL - Hardware Abstraction Layer                                  | Camada de abstração de hardware                                                                                                                       |   |
| TLS - Transport Layer Security                                    | Camada de segurança de transporte                                                                                                                     |   |
| SSL - Secure Socket Layer                                         | Camada de segurança de socket                                                                                                                         |   |
| Network Layer   (network)                                         | Camada de rede                                                                                                                                        |   |
| Transport layer (network)                                         | Camada de transporte                                                                                                                                  |   |
| Storage layer                                                     | Camada de armazenamento                                                                                                                               |   |
|                                                                   |                                                                                                                                                       |   |
| Sign in                                                           | Logar, entrar com username e senha.                                                                                                                   |   |
| Sign up                                                           | Registrar-se pela primeira vez.                                                                                                                       |   |
| SSO - Single Sign On                                              | Autenticar única vez usando OIDC (Oauth2) ou SAML                                                                                                     |   |
| OIDC - Open ID Connect Protocol (Oauth2)                          | Protocolo para autenticação SSO construído em cima do Oauth2                                                                                          |   |
| SAML - Security Assertion Markup Language                         | Protocolo de autenticação SSO usando XML                                                                                                              |   |
| Hosting                                                           | Hospedagem                                                                                                                                            |   |
| Web Hosting                                                       | Hospedagem Web                                                                                                                                        |   |
| IAM - Identity and access management                              | Gerenciamento de identidade e acesso                                                                                                                  |   |
| ACL - Access Control List                                         | Lista de Acesso de Controle                                                                                                                           |   |
| private key                                                       | chave privada                                                                                                                                         |   |
| public key                                                        | chave pública                                                                                                                                         |   |
| drop-in-replacement library                                       | bibliteca de software que é substituta de outra com mesma interface e ABI (Application Binary Interface)                                              |   |
|                                                                   |                                                                                                                                                       |   |
| HPC - High Performance Computing                                  | Computação de Alta Performance                                                                                                                        |   |
| Numerical computing                                               | Computação numérica                                                                                                                                   |   |
| Scientific Computing                                              | Computação scientifica                                                                                                                                |   |
| PDE - Partial Differential Equation                               | Equação diferêncial parcial                                                                                                                           |   |
| ODE - Ordinary Differential Equation                              | Equação diferêncial ordinária                                                                                                                         |   |
| FEM - Finite Element Method                                       | Método de Elementos Finitos                                                                                                                           |   |
| Frequency domain                                                  | Domínio da frequência                                                                                                                                 |   |
| Control Theory                                                    | Teoria de controle ou Teoria de Controlo                                                                                                              |   |
| low pass filter                                                   | filtro passa baixas                                                                                                                                   |   |
| high pass filter                                                  | filtro passa altas                                                                                                                                    |   |
| CAD - Computer Aided Design                                       | Design/Projeto auxiliado por computador                                                                                                               |   |
| CAM - Computer Aided Manufacturing                                | Fabricação/Manufatur auxiliado por computador                                                                                                         |   |
| machining shop (or workshop)                                      | oficina de usinagem                                                                                                                                   |   |
| milling machine                                                   | fresadora                                                                                                                                             |   |
| drilling  machine                                                 | furadeira ou máquina de furar                                                                                                                         |   |
| lathe                                                             | torno (máquina ferramenta)                                                                                                                            |   |
| crane                                                             | guindaste                                                                                                                                             |   |
| conveyor belt                                                     | esteira                                                                                                                                               |   |
| pipeline                                                          | tubulação                                                                                                                                             |   |
| gas pipeline                                                      | tubulação de gás                                                                                                                                      |   |
| oil pipeline                                                      | tubulação de petróleo                                                                                                                                 |   |
| crude oil                                                         | petróleo bruto, não refinado                                                                                                                          |   |
| oil rig                                                           | plataforma de extração de petróleo                                                                                                                    |   |
| oil well                                                          | poço de petróleo                                                                                                                                      |   |
| oil derrick                                                       | torre de perfuração de petróleo                                                                                                                       |   |
| oil refinary                                                      | refinária de petróleo                                                                                                                                 |   |
| pressure vessel                                                   | vazo de pressão                                                                                                                                       |   |
| pressure gauge                                                    | medidor de pressão                                                                                                                                    |   |
| boiler                                                            | caldeira                                                                                                                                              |   |
| heat exchanger                                                    | trocador de calor                                                                                                                                     |   |
| strain gauge                                                      | extensômetro medidor de deformação                                                                                                                    |   |
| load cell                                                         | célula de carga - medidor de força por deformação de mola ou sensor piezoelétrico                                                                     |   |
| safety factor  (mechanical engineering)                           | fator de segurança                                                                                                                                    |   |
| safety margin  (mechanical engineering)                           | margem de segurança                                                                                                                                   |   |
| gearbox                                                           | caixa de transmissão ou caixa de marchas para trocar torque por velocidade e vice-versa.                                                              |   |
| _blueprint_                                                         | desenho técnico de engenharia                                                                                                                         |   |
| power grid                                                        | rede elétrica                                                                                                                                         |   |
| power plant                                                       | planta/industria de "produção" de energia.                                                                                                            |   |
| power supply                                                      | fonte de tensão                                                                                                                                       |   |
| switch mode power supply                                          | fonte de tensão chaveada                                                                                                                              |   |
| HVDC - High Voltage Direct Current                                | Alta voltagem/tensão com corrente contínua                                                                                                            |   |
| HVAC - High Voltage Alternate Current                             | Alta voltagem/tensão com corrente alternada                                                                                                           |   |
| HVAC - Heating, Ventilation, and Air Conditioning                 | Aquecimento, Ventilação, e Ar condicionado                                                                                                            |   |
|                                                                   |                                                                                                                                                       |   |
| ICS - Industrial Control System                                   | Sistemas de Controle Industrial (usados em automação industrial - OT - Operational Technology)                                                        |   |
| PLC - Programmable Logic Controller                               | Controlador Lógico Programável - computador industrial proprietário usado para automação industrial                                                   |   |
| RTU - Remote Terminal Unit                                        | Unidade de Terminal Remota                                                                                                                            |   |
| SCADA - Supervisory Control and Data Acquisition                  | Sistema de Controle Supervisório e de Aquisição de dados - usado em industria de processos como industria quimica                                     |   |
| DCS - Distributed Control System                                  | Sistema de Controle Distribuido                                                                                                                       |   |
| OPC - OLE for Process Control                                     | OLE (Object Linking and Embedding - Microsoft) para controle de processos - industry standard                                                         |   |
| Fieldbus                                                          | Barramento de controle industrial                                                                                                                     |   |
|                                                                   |                                                                                                                                                       |   |
| network card                                                      | placa de rede                                                                                                                                         |   |
| video card                                                        | placa de vídeo                                                                                                                                        |   |
| sound card                                                        | placa de som                                                                                                                                          |   |
| Manufacturing                                                     | Industria de transformção ou fabricantes                                                                                                              |   |
| Computational methods                                             | Métodos computacionais                                                                                                                                |   |
| Machine design                                                    | Projeto de máquinas                                                                                                                                   |   |
| Embedded Systems                                                  | Sistemas embarcados                                                                                                                                   |   |
| IOT  - Internet Of Things                                         | Internet das Coisas                                                                                                                                   |   |
| BOM - Bill Of Materials                                           | Lista de materiais                                                                                                                                    |   |
| Firmware                                                          | software de sistemas embarcados                                                                                                                       |   |
| RTOS - Real Time Operating System                                 | Sistema operacional de tempo real como VxWorks, RTMES ou FreeRTOS                                                                                     |   |
| BSP - Board Support Package (RTOS)                                | Pacote de suporte de placa. Device drivers de um RTOS para suporte a uma placa de desenvolvimento ou hardware.                                        |   |
| SOC - System-On-Chip                                              | sistema no chip                                                                                                                                       |   |
| RAM - Random Access Memory                                        | Memória de acesso aleatória                                                                                                                           |   |
| SRAM - Static Random Access Memory                                | Memória de acesso aleatória estática                                                                                                                  |   |
| DRAM - Dynamic Random Access Memory                               | Memória de acesso aleatória dinâmica                                                                                                                  |   |
| ROM - Read-Only Memory                                            | Memória de somente leitura                                                                                                                            |   |
| ECU - Engine Control Unit                                         | Unidade de Controle de Motor (computador usado em motores de carros)                                                                                  |   |
| Off-the-shelf components                                          | Componentes já prontos disponíveis no mercado                                                                                                         |   |
| COTS - Commercial-Off-the-shelf                                   | -                                                                                                                                                     |   |
| OEM - Original Equipment Manafacturer                             | Fabricante de equipamento original                                                                                                                    |   |
|                                                                   |                                                                                                                                                       |   |
| service life                                                      | vida útil de equipamento                                                                                                                              |   |
| device service life                                               | vida útil de dispositivo                                                                                                                              |   |
| equipment service life                                            | vida útil de equipamento                                                                                                                              |   |
| spare parts                                                       | Partes de reposiçao                                                                                                                                   |   |
| maintenance                                                       | manutenção                                                                                                                                            |   |
| afermarket                                                        | mercado de pós vendas, de partes de reposição e acessórios                                                                                            |   |
| repair                                                            | reparo                                                                                                                                                |   |
| MTTR - Mean Time to Repair                                        | Tempo Médio Para Reparo                                                                                                                               |   |
| MTBF - Mean Time Between Failures                                 | Tempo Médio Entre Falhas (métrica)                                                                                                                    |   |
| FMEA - Failure mode and effects analysis (Mechanical Engineering) | Análise de modo e efeitos de falha                                                                                                                    |   |
|                                                                   |                                                                                                                                                       |   |
| software bug                                                      | falha/defeito/bug em software (programa de computador)                                                                                                |   |
| software glitch                                                   | falha/defeito/bug em software                                                                                                                         |   |
| software design flaw                                              | falah/defeito/bug de design(projeto) de software                                                                                                      |   |
| race condition                                                    | condição de concorrência                                                                                                                              |   |
| race condition bug                                                | bug de condição de concorrência                                                                                                                       |   |
|                                                                   |                                                                                                                                                       |   |
| bus                                                               | barramento                                                                                                                                            |   |
| event bus                                                         | barramento de eventos                                                                                                                                 |   |
| distributed event bus                                             | barramento de eventos distribuídos                                                                                                                    |   |
| PCI bus (Peripheral Component Interconect)                        | barramento PCI (P)                                                                                                                                    |   |
| USB bus (Universal Serial Bus)                                    | barramento serial universal                                                                                                                           |   |
| CAN bus (Controller Area Network)                                 | barramento CAN usado em sistemas embarcados automotivos                                                                                               |   |
|                                                                   |                                                                                                                                                       |   |
| payload                                                           | carga útil                                                                                                                                            |   |
| WAN - Wide Area Network                                           | Rede de Área Ampla                                                                                                                                    |   |
| LAN - Local Area Network                                          | Rede de Área Local                                                                                                                                    |   |
| VLAN - Virtual Local Area Network                                 | Rede Virtual de Área Local                                                                                                                            |   |
| VPN - Virtual Private Network                                     | Rede Privada Virtual                                                                                                                                  |   |
| VPC  - Virtual Private Cloud                                      | Nuvem Privada Virtual                                                                                                                                 |   |
|                                                                   |                                                                                                                                                       |   |
|-------------------------------------------------------------------+-------------------------------------------------------------------------------------------------------------------------------------------------------+---|
| *Software Engineering* / *Programming-Related*                        |                                                                                                                                                       |   |
|-------------------------------------------------------------------+-------------------------------------------------------------------------------------------------------------------------------------------------------+---|
| IT - Information Technology                                       | Tecnologia da Informação                                                                                                                              |   |
| OT - Operational Technology                                       | Tecnologia Operacional (sistemas embarcados e sistemas industriais)                                                                                   |   |
|                                                                   |                                                                                                                                                       |   |
| Loading                                                           | Carregando                                                                                                                                            |   |
| Download                                                          | Baixar                                                                                                                                                |   |
| Upload                                                            | Subir                                                                                                                                                 |   |
|                                                                   |                                                                                                                                                       |   |
| STEM - Science-Technology-Engineering-Mathematic                  | Ciência-Tecnologia-Engenharia-Matemática                                                                                                              |   |
| Q&A - Questions and Answers                                       | Perguntas e repostas                                                                                                                                  |   |
| FAQ - Frequent Asked Questions                                    | Questões frequentemente perguntadas                                                                                                                   |   |
| boolean logic                                                     | lógica boleana                                                                                                                                        |   |
| fuzzy logic                                                       | lógica nebulosa                                                                                                                                       |   |
|                                                                   |                                                                                                                                                       |   |
| separation of concerns                                            | separação de reponsabilidades                                                                                                                         |   |
| cross-cutting concerns                                            | reponsabilidades crusadas, responsabilidades de multiplos domínios como logging.                                                                      |   |
|                                                                   |                                                                                                                                                       |   |
| development environment                                           | ambiente de desenvolvimento                                                                                                                           |   |
| IDE - Integrated Development Environment                          | ambiente de desenvolvimento integrado                                                                                                                 |   |
| devops == development + operations                                | cultura de desenvolvimento e operações compartilhada por um time ou equipe.                                                                           |   |
| SRE - Site Reliability Engineer                                   | Engenheiro de confiabilidade de site (Administrador de sistemas)                                                                                      |   |
| run a company                                                     | operar uma empresa                                                                                                                                    |   |
| run a business                                                    | operar um negócio                                                                                                                                     |   |
| run a website                                                     | operar um website ou sítio web                                                                                                                        |   |
| run a software, run an application                                | rodar um software, operar um software                                                                                                                 |   |
| website under construction                                        | website em construção                                                                                                                                 |   |
| software release                                                  | lançamento de software                                                                                                                                |   |
| software release cycle                                            | ciclo de lançamento de software                                                                                                                       |   |
| rolling release cycle                                             | ciclo de lançamento contínuo                                                                                                                          |   |
| LTS - Long Term Support                                           | Suporte de longo prazo                                                                                                                                |   |
| programming language                                              | linguagem de programação                                                                                                                              |   |
| low level programming language                                    | linguagem de programação de baixo nível                                                                                                               |   |
| high level programming language                                   | linguagem de programação de alto nível                                                                                                                |   |
| assembly programming language                                     | linguagem de programação de montagem (código de máquina)                                                                                              |   |
| scientific programming language                                   | linguagem de programação científica; como Fortran, Matlab, Octave, Julia, Scilab (Inria)                                                              |   |
| system programming language                                       | linguagem de programação de sistemas; como C, C++, Rust                                                                                               |   |
| visual programming language                                       | linguagem de programação de visual como ladder usada em PLCs (Programmable Logic Controllers)                                                         |   |
| markup programming language                                       | linguagem de programação de marcação ou formatação como XML, html, css e etc.                                                                         |   |
| DSL - domain specific language                                    | linguagem de programação de domínio específico; exemplo SQL, Regex, html, xml                                                                         |   |
| API - Application Programming Interface                           | Interface de Programaçao de Aplicação                                                                                                                 |   |
| ABI - Application Binary Interface                                | Interface de Binária de Aplicação                                                                                                                     |   |
| Type System                                                       | Sistema de Tipos (tipagem)                                                                                                                            |   |
| Static Type System                                                | Sistema de Tipos Estático (exemplo: C++, C, Java)                                                                                                     |   |
| Dynamic Type System                                               | Sistema de Tipos Dinâmicos                                                                                                                            |   |
| ISA  - Instruction Set Architecture                               | Conjuto de Instruções de Arquitetura                                                                                                                  |   |
| OTA  - Over the Air update (mobile and embedded systems)          | Atualização automática de sistema ou firmware pela rede sem intervenção de usuário                                                                    |   |
| control flow                                                      | fluxo de controle                                                                                                                                     |   |
| workflow                                                          | fluxo de trabalho, fluxo de funcionamento                                                                                                             |   |
| wrapper                                                           | encapsulamento                                                                                                                                        |   |
| FFI - Foreign Function Interface                                  | Interface de Função Extrangeira                                                                                                                       |   |
| memory allocation                                                 | alocação de memória                                                                                                                                   |   |
| memory leak                                                       | vazamento de memória                                                                                                                                  |   |
| memory fragmentation                                              | fragmentação de memória                                                                                                                               |   |
|                                                                   |                                                                                                                                                       |   |
| SSR app (Server-Side-Rendered)                                    | Página redenizada no servidor (tradicional)                                                                                                           |   |
| SPA app (Single Page Web Application)                             | Aplicação web de uma única página                                                                                                                     |   |
| static web page                                                   | Página web estática sem lado do servidor                                                                                                              |   |
| SEO - Search Engine Optimization                                  | Optimização de motor de busca.                                                                                                                        |   |
| REST (Representational State Transfer) API                        | API Rest                                                                                                                                              |   |
|                                                                   |                                                                                                                                                       |   |
| body of knowledge                                                 | corpo de conhecimento                                                                                                                                 |   |
| technical standard                                                | padrão técnico                                                                                                                                        |   |
| standardization body                                              | comitê de padronização                                                                                                                                |   |
| standardization comitee                                           | comitê de padronização                                                                                                                                |   |
| reference implementation                                          | implementação de referência (primeira implementação de um padrão técnico - OpenSSL)                                                                   |   |
|                                                                   |                                                                                                                                                       |   |
| legacy systems                                                    | sistemas legados (software antigo)                                                                                                                    |   |
| legacy software                                                   | software legado (antigo)                                                                                                                              |   |
| greenfield software                                               | software ou programa a ser desenvolvidos sem restrições de tecnologias legadas (antigas).                                                             |   |
| greenfield project                                                | projetos com tecnologias não legadas.                                                                                                                 |   |
| in-house software                                                 | software desenvolvido internamente                                                                                                                    |   |
| home grown software                                               | software desenvolvido internamente                                                                                                                    |   |
| software development                                              | desenvolvimento de software                                                                                                                           |   |
| software testing                                                  | teste de software                                                                                                                                     |   |
| proprietary software                                              | programa proprietário                                                                                                                                 |   |
| closed source software                                            | programa(s) de código fechado                                                                                                                         |   |
| OSS - Open Source Software                                        | programa(s) de código aberto                                                                                                                          |   |
| FOSS - Free and Open Source Software                              | programa livre e de código aberto                                                                                                                     |   |
| network interface                                                 | interface de rede                                                                                                                                     |   |
| No warranty                                                       | sem garantias                                                                                                                                         |   |
| SDK - Software Development Kit                                    | Kit de desenvolvimento de software                                                                                                                    |   |
| database                                                          | banco de dados                                                                                                                                        |   |
| document database                                                 | banco de dados de documento (exemplo: MongoDB)                                                                                                        |   |
| in-memory database                                                | banco de dados em memória (exemplo: Redis)                                                                                                            |   |
| relational database                                               | banco de dados relacional (examplo: Postgres, MySQL, Microsoft SQL Server)                                                                            |   |
| SQL - Structured Query Language                                   | Linguagem de Consulta Estruturada (usada para consultar banco de dados)                                                                               |   |
| to query a database                                               | consultar um banco de dados                                                                                                                           |   |
| RDBMS - Relational Database Management System                     | Sistema de gerenciamento de banco de dados relacional                                                                                                 |   |
| DMBS - Database Management System                                 | Sistema de gerenciamento de banco de dados                                                                                                            |   |
| Database column                                                   | Coluna de banco de dados                                                                                                                              |   |
| Database table                                                    | Tabela de banco de dados                                                                                                                              |   |
| Database record                                                   | registro ou entrada de banco de dados (row ou linha)                                                                                                  |   |
|                                                                   |                                                                                                                                                       |   |
| http protocol methods                                             | método do protocolo http                                                                                                                              |   |
| http protocol headers                                             | cabeçalhos do protocolo http                                                                                                                          |   |
| http protocol request                                             | requisição do protocolo http                                                                                                                          |   |
| http protocol response                                            | resposta do protocolo http                                                                                                                            |   |
| http protocol authentication                                      | autenticação no protocolo http                                                                                                                        |   |
| http protocol authorization                                       | autorização no protocolo http                                                                                                                         |   |
|                                                                   |                                                                                                                                                       |   |
| uppercase text                                                    | texto maiúsculo                                                                                                                                       |   |
| lowercase text                                                    | texto minúsculo                                                                                                                                       |   |
| source code                                                       | código fonte                                                                                                                                          |   |
| object code                                                       | código objeto (código de máquina, compilado)                                                                                                          |   |
| header files                                                      | arquivos de cabeçalho (arquivos *.h ou *.hpp em C ou C++)                                                                                             |   |
| building system                                                   | sistema de compilação ou sistema de automação de compilação                                                                                           |   |
| breaking change                                                   | mudança disruptiva                                                                                                                                    |   |
| backward compatibility                                            | compatibilidade reversa                                                                                                                               |   |
| forward compatibility                                             | compatibilidade futura                                                                                                                                |   |
| future-proof                                                      | a prova futura - sistema projeto para acomador novos casos sem mudanças disruptivas.                                                                  |   |
| loose coupling                                                    | acoplamento frouxo                                                                                                                                    |   |
| tight coupling                                                    | acoplamento apertado                                                                                                                                  |   |
|                                                                   |                                                                                                                                                       |   |
| DIY - Do It Yourself                                              | Faça Você Mesmo                                                                                                                                       |   |
| DRY - Don't Repeat Yourself                                       | Não repita a si mesmo                                                                                                                                 |   |
| convention over configuration                                     | Convenção sobre configuração - padrão de design usado por Ruby-On-Rails e Django web frameworks.                                                      |   |
| KISS - Keep It Simple                                             | Mantenha isso simples                                                                                                                                 |   |
| eat your own dog food - _dogfooding_ (Microsoft)                    | ditado: coma sua própria ração de cachorro (use o produto que criou da própria empresa)                                                               |   |
| Explicit is better than implicit (Python moto)                    | Explicito é melhor que implicito.                                                                                                                     |   |
| NIH - Not Inveted Here syndrome                                   | Sindrome: Não inventado aqui. (reiventar a roda somente porque não foi criado localmente)                                                             |   |
| YAGNI - You Ain't Gonna Need It                                   | ditado: Você não vai precisar disto (NO OVERENGINEERING)                                                                                              |   |
| Do not reivent the wheel                                          | Não reivente a roda                                                                                                                                   |   |
| think out of the box                                              | pensar fora da caixa, de modo não convencional.                                                                                                       |   |
| Get things done                                                   | Fazer as coísas, entregar resultados                                                                                                                  |   |
| walled garden                                                     | Jardim murado - ecosistema fechado, totalmente controlado pela empresa, como Apple app store.                                                         |   |
| Just works (apple slogan)                                         | "Apenas funciona" (frase popularizada pela Apple)                                                                                                     |   |
| move fast and break things (Facebook slogan)                      | Mova rápido e quebre as coisas =>> significa disrupção, disruption.                                                                                   |   |
| If it ain't broke, don't fix it.                                  | Se está quebrado, não conserte. =>> Não modifique o que funciona.                                                                                     |   |
| Software is eating the world                                      | O software está comendo/engolindo o mundo                                                                                                             |   |
| It is a feature, not a bug                                        | Isso é um recurso/funcionalidade, não um defeito.                                                                                                     |   |
| Do not rely on implementation details                             | Não se baseie em detalhes de implementação                                                                                                            |   |
| It is a privilege, not a right                                    | Isto é um privilégio, não um direito                                                                                                                  |   |
|                                                                   |                                                                                                                                                       |   |
| Search Engine                                                     | Motor de busca                                                                                                                                        |   |
| SEO - Search Engine Optimization                                  | Optimização de motor de busca                                                                                                                         |   |
|                                                                   |                                                                                                                                                       |   |
| features                                                          | caracteristicas ou recursos                                                                                                                           |   |
| easy-of-use                                                       | facilidade de uso                                                                                                                                     |   |
| DX - Developer Experience                                         | Experiência de desenvolvedor com API ou SDK                                                                                                           |   |
| UX - User Experience                                              | Experiência de usuário (relacionado a interface gráfica, frontend)                                                                                    |   |
| UI - User Interface                                               | Interface de usuário                                                                                                                                  |   |
| CLI - Command Line Interface                                      | Interface de Linha de Comando                                                                                                                         |   |
| TUI - Terminal User Interface                                     | Interface de Usuário em Terminal. Exemplos: vim, emacs                                                                                                |   |
| GUI - Graphical User Interface                                    | Interface Gráfica de Usuário                                                                                                                          |   |
|                                                                   |                                                                                                                                                       |   |
| Keyboard Driven Interface                                         | Interface dirigida por teclado                                                                                                                        |   |
| HMI - Human Machine Interface                                     | Interface Homem Máquina                                                                                                                               |   |
| REPL - Read-Print-Eval-Loop                                       | Ler-Imprime-Avaliar-Laço(Loop) - exemplo: Python, Ruby, Matlab REPL                                                                                   |   |
| UAV - Unmmaned Aerial Vehicle (drone)                             | VANT - Veículo Aéreo Não Tripulado                                                                                                                    |   |
| VTOL - Vertical Take Off & Landing                                | Decolagem vertical e pouso vertical                                                                                                                   |   |
| ROV - Remotely Operated Vehicle                                   | VOR - Veículo Operado Remotamente                                                                                                                     |   |
| INS - Innertial Navigation System                                 | Sistema de Navegação Inercial                                                                                                                         |   |
| IMU - Innertial Measurement Unit                                  | Unidade de Medição Inercial                                                                                                                           |   |
| Innertial Platform                                                | Plataform Inercial                                                                                                                                    |   |
| Control surface                                                   | superfície de controle                                                                                                                                |   |
| Space probe                                                       | sonda espacial                                                                                                                                        |   |
|                                                                   |                                                                                                                                                       |   |
| keyboard                                                          | teclado                                                                                                                                               |   |
| keyboard shortcuts                                                | atalhos de teclado                                                                                                                                    |   |
| keybind                                                           | combinação de teclas                                                                                                                                  |   |
| keystroke                                                         | digitar uma tecla                                                                                                                                     |   |
| keyboard layout                                                   | layout/formato de teclado                                                                                                                             |   |
| query keyboard layout                                             | teclado com layout query                                                                                                                              |   |
| devorak keyboard layout                                           | teclado com layout devorak                                                                                                                            |   |
| colemake keyboard layout                                          | teclado com layout colemake                                                                                                                           |   |
|                                                                   |                                                                                                                                                       |   |
| uptime                                                            | tempo que o serviço ou máquina está operando                                                                                                          |   |
| downtime                                                          | tempo que o serviço ou máquina está parado devido a falha, manutenção ou bug.                                                                         |   |
| compliance                                                        | conformidade                                                                                                                                          |   |
| regulatory compliance                                             | conformidade a regulamentação                                                                                                                         |   |
| industry regulations                                              | regulamentação de setor                                                                                                                               |   |
| industry standard                                                 | padrão do setor (Nota: industria em EN é manufacturing)                                                                                               |   |
| industry standard tooling                                         | ferramentas padrão do setor                                                                                                                           |   |
| redundancy                                                        | redundância                                                                                                                                           |   |
| reliability                                                       | confiabilidade                                                                                                                                        |   |
| _availability_                                                      | disponibilidade                                                                                                                                       |   |
| high availability                                                 | alta disponibilidade                                                                                                                                  |   |
| _fault tolerance_                                                   | tolerância a falhas                                                                                                                                   |   |
| fault tolerant                                                    | tolerante a falhas                                                                                                                                    |   |
| single point of failure                                           | único ponto de falha                                                                                                                                  |   |
| distributed systems                                               | sistemas distribuidos                                                                                                                                 |   |
|                                                                   |                                                                                                                                                       |   |
| capacity planning                                                 | planejamento de capacidade de sistema de backend                                                                                                      |   |
| scalability                                                       | escalabilidade - aumentar capacidade do sistema para suportar maior tráfego de rede.                                                                  |   |
| vertical scaling    (escalamento vertical)                        | aumentar capaciade de CPU, disco, memória de um servidor para suportar maior tráfego e carga.                                                         |   |
| horizontal scaling  (escalamento horizontal)                      | rodar multiplas réplicas de um mesmo servidor para tolerância a falhas e suportar maitor tráfego de rede.                                             |   |
| microservices                                                     | microserviços                                                                                                                                         |   |
|                                                                   |                                                                                                                                                       |   |
| memory                                                            | memória                                                                                                                                               |   |
| storage                                                           | armazenamento                                                                                                                                         |   |
| cpu time                                                          | tempo de uso de CPU                                                                                                                                   |   |
| cpu cores                                                         | número de núcleos de CPU                                                                                                                              |   |
| bandwidth                                                         | quantidade de dados transferido                                                                                                                       |   |
| bandwidth                                                         | largura de banda (em engenharia eletrônica)                                                                                                           |   |
|                                                                   |                                                                                                                                                       |   |
| dedicated server                                                  | servidor físico (não VPS ou virtualizado como AWS EC2) na cloud ou em data center próprio                                                             |   |
| server colocation                                                 | hardware servidor próprio hospedado em espaço alugado de data center                                                                                  |   |
| VPS - Virtual Private Server hosting                              | Servidor Privado Virtual (máquina, computador virtual hospedado na nuvem)                                                                             |   |
| web server                                                        | servidor web                                                                                                                                          |   |
| web hosting                                                       | hospedagem web                                                                                                                                        |   |
| shared hosting                                                    | hospedagem compartilhada                                                                                                                              |   |
| server load                                                       | carga no servidor                                                                                                                                     |   |
| IOPS - IO per second                                              | Entrada/Saída por segundo                                                                                                                             |   |
| load balancer                                                     | balanceador de carga                                                                                                                                  |   |
| workload                                                          | carga de trabalho                                                                                                                                     |   |
| network traffic                                                   | tráfego de rede                                                                                                                                       |   |
| network infrastructure                                            | infraestrutura de rede                                                                                                                                |   |
| inbound network traffic                                           | tráfego de rede vindouro (que entra)                                                                                                                  |   |
| outbound network traffic                                          | tráfego de rede sumidouro (que sai)                                                                                                                   |   |
| ISP - Internet Service Provider                                   | provedor de serviço de internet                                                                                                                       |   |
|                                                                   |                                                                                                                                                       |   |
| http - Hyper Text Transfer protocol                               | protocolo de transferência de hiper texto                                                                                                             |   |
| ftp (file transfer protocol)                                      | servidor ftp (protocolo de transferência de arquivo)                                                                                                  |   |
|                                                                   |                                                                                                                                                       |   |
| CI - Continuous Integration (devops)                              | Integração Contínua                                                                                                                                   |   |
| CD - Continuous Delivery    (devops)                              | Entrega contínua                                                                                                                                      |   |
|                                                                   |                                                                                                                                                       |   |
| cloud computing                                                   | computação na nuvem                                                                                                                                   |   |
| cloud providers                                                   | provedores de serviços de computação na nuvem                                                                                                         |   |
| CDN - Content Delivery Network                                    | Rede de entrega/distribuíção de conteúdo                                                                                                              |   |
| SLA - Service Level Agreement                                     | Contrato de Nível de Serviço                                                                                                                          |   |
| QoS - Quality of Service                                          | Qualidade de Serviço                                                                                                                                  |   |
| QA - Quality Assurance                                            | Garantia de Qualidade                                                                                                                                 |   |
| _managed service_                                                   | serviço gerenciado disponível como uma API como banco de dados (database)                                                                             |   |
| object storage service                                            | serviço gerenciado (managed service) de armazenamento de objetos (dados não estruturados) como AWS-S3                                                 |   |
| self hosting                                                      | auto hospedagem                                                                                                                                       |   |
| on premises hosting                                               | hospedagem na infraestrutura ou data center da própria empresa (não na cloud - nuvem como AWS ou GCP e etc.)                                          |   |
| colocation hosting                                                | hospedagem com hardware proprio em espaço alugado (rented) de data center (centro de dados)                                                           |   |
| .... AS A SERVICE                                                 | ... como serviço                                                                                                                                      |   |
| SAAS - Software As A Service                                      | Software Como Serviço                                                                                                                                 |   |
| BAAS - Backend As A Service                                       | Backend Como Serviço                                                                                                                                  |   |
| PAAS - Platform As A Service                                      | Plataforma Como Serviço                                                                                                                               |   |
| FAAS - Function As A Service                                      | Função como Serviço                                                                                                                                   |   |
| IAAS - Infrastructure As A Service                                | Infrastrutura Como Serviço                                                                                                                            |   |
| KAAS - Kubernetes A A Service                                     | Kubernetes como serviço, kubernetes managed service - (Exemplo: GKE - Google Kubernetes Engine)                                                       |   |
| IAC - Infrastruture As Code                                       | Infrastrutura Como Código (Exemplo: Docker, docker swarm, kubernetes, terraform)                                                                      |   |
|                                                                   |                                                                                                                                                       |   |
| automated testing                                                 | teste automático                                                                                                                                      |   |
| manual testing                                                    | teste manual                                                                                                                                          |   |
| software testing                                                  | teste de software                                                                                                                                     |   |
| unit testing                                                      | teste unitário                                                                                                                                        |   |
| regression testing                                                | teste de regressão                                                                                                                                    |   |
| acceptance testing                                                | teste de aceitação                                                                                                                                    |   |
| integration testing                                               | teste de integração                                                                                                                                   |   |
| A/B testing                                                       | teste A/B com variantes aleatórias de interface gráfica, sites e etc.                                                                                 |   |
| hardware-in-the-loop (HIL) testing                                | teste de hardware no loop (laço) para sistemas embarcados.                                                                                            |   |
|                                                                   |                                                                                                                                                       |   |
| LEMP stack                                                        | Linux-Nginx-MySQL-PHP                                                                                                                                 |   |
| LAMP stack                                                        | Linux-Apache-MySQL-PHP                                                                                                                                |   |
| WAMP stack                                                        | Windows-Apache-MySQL-PHP                                                                                                                              |   |
| WIMP stack                                                        | Windows-IIS web server-MySQL-PHP                                                                                                                      |   |
| MEAN stack                                                        | MongoDB + ExpressJS + Angular + NodeJS                                                                                                                |   |
| MEVN stack                                                        | MongoDB + ExpressJS + ReactJS + NodeJS                                                                                                                |   |
| MERN stack                                                        | MongoDB + ExpressJS + ReactJS + Nodejs                                                                                                                |   |
|                                                                   |                                                                                                                                                       |   |
| Python shop                                                       | empresa que usa Python - Nota: shop também pode ser abreviação de workshop (oficina)                                                                  |   |
| C++ shop                                                          | empresa que usa C++  (C++ workshop)                                                                                                                   |   |
| Java shop or Java workshop.                                       | empresa que usa Java (Java workshop)                                                                                                                  |   |
| PEP - Python Enhancement Proposal                                 | Proposta de Melhoria do Python                                                                                                                        |   |
| JEP - Java Enhancement Proposal                                   | Proposta de Melhoria do Java                                                                                                                          |   |
|                                                                   |                                                                                                                                                       |   |
| gui builder                                                       | construtor de interfaces gráficas                                                                                                                     |   |
| drag-and-drop                                                     | arrastar e soltar                                                                                                                                     |   |
| pick-and-place                                                    | pegar e colocar/posicionar                                                                                                                            |   |
| low code                                                          | baixo código => ferramentas que permitem criar aplicações graficamente com drag-drop ou pick-and-place. (no programming)                              |   |
| turnkey solution                                                  | solução/tecnologia imediatamente pronta para uso                                                                                                      |   |
|                                                                   |                                                                                                                                                       |   |
| CSV - Comma Separated Value file                                  | Formato de arquivos CSV (Valores separados por virgula)                                                                                               |   |
| JSON - Javascript Object Notation file                            | Notação de objeto de Javascript                                                                                                                       |   |
| Text file                                                         | arquivo de texto                                                                                                                                      |   |
| Binary file                                                       | arquivo binário                                                                                                                                       |   |
|                                                                   |                                                                                                                                                       |   |
| dependency hell                                                   | inferno das dependências                                                                                                                              |   |
| fragmentation hell                                                | inferno da fragmentação. Exemplos: gerenciamento de pacotes do Linux, multiplas versões do Android.                                                   |   |
| DLL hell                                                          | inferno das DLLs (dependency hell no windows)                                                                                                         |   |
| Jar hell                                                          | infernos dos Jars (dependency hell no Java)                                                                                                           |   |
|                                                                   |                                                                                                                                                       |   |
| opt-in (not enabled by default)                                   | Não habilitado (ativado) por padrão, o usuário que tem de habilitar manualamente.                                                                     |   |
| out-out (enabled by default)                                      | Habilitado (ativado) por padrão, o usuário que tem de desabilitar manualmente.                                                                        |   |
| opt-in telemetry                                                  | Telemetria não habilitada por padrão, mas pode ser habilidata manualmente.                                                                            |   |
| opt-out telemetry                                                 | Telemetria habiltada por padrão, mas pode ser desabilitada manualmente. (Maioria dos casos)                                                           |   |
| free trial                                                        | experimente/teste grátis                                                                                                                              |   |
|                                                                   |                                                                                                                                                       |   |
| CRUD(S) - Create-Read-Update-Delete + Search (database)           | Cria (Create)-Ler (Read)-Atualizar(Update)-Deletar (Delete) + Pesquisar (Search)                                                                      |   |
| ACID - Atomicity + Consitency + Isolation + Durability (database) | Atomicidade + Consitência + Isolação + Durabilidade                                                                                                   |   |
| onboarding                                                        | integrar um novo funcionário a empresa                                                                                                                |   |
| playbook                                                          | manual contendo políticas da empresa, fluxos de trabalho (workflows) e procedimentos (procedures).                                                    |   |
| handbook                                                          | manual                                                                                                                                                |   |
| runbook                                                           | livro de rotinas e procedimentos seguida por operadores do sistema ou administradores de sistema.                                                     |   |
| logbook                                                           | livro de registro de eventos (exigido legalmente)                                                                                                     |   |
|                                                                   |                                                                                                                                                       |   |
| outdated                                                          | defasado, ultrapassado(a) / obsoleto(a)                                                                                                               |   |
| deprecated                                                        | descontinuado                                                                                                                                         |   |
| descontinued                                                      | descontinuado                                                                                                                                         |   |
| legacy technology                                                 | tecnologia legada (ultrapassada, antiga)                                                                                                              |   |
|                                                                   |                                                                                                                                                       |   |
| _CRM_ - Customer Relationship Management system                     | Sistema de gerenciamento de relacionamento com o cliente                                                                                              |   |
| _CMS_ - Content Management System                                   | Sistema de gerenciamento de conteúdo - exemplo: Wordpress, Wikis.                                                                                     |   |
| _ERP_ - Enterprise Resource Planning                                | Sistema de gerenciamento de empresa/negócio                                                                                                           |   |
| _LOB_ - Line of business software                                   | Software/Programa de gerenciamento de empresa/negócio                                                                                                 |   |
|                                                                   |                                                                                                                                                       |   |
|-------------------------------------------------------------------+-------------------------------------------------------------------------------------------------------------------------------------------------------+---|
| *Education*                                                         |                                                                                                                                                       |   |
|-------------------------------------------------------------------+-------------------------------------------------------------------------------------------------------------------------------------------------------+---|
| ESL - English as a Second Language                                | Inglês como segunda língua                                                                                                                            |   |
| ELF - English as a (international) lingua-franca                  | Inglês como lingua-franca internacional                                                                                                               |   |
| MTI - Mother Tongue Influence                                     | Influência da língua materna                                                                                                                          |   |
| Overcome language barriers                                        | Superar barreiras linguísticas                                                                                                                        |   |
| Study abroad                                                      | Estudar no exterior                                                                                                                                   |   |
| Learn English                                                     | Aprender Inglês                                                                                                                                       |   |
| Learn a foreign language                                          | Aprender uma língua extrangeira                                                                                                                       |   |
| English as language of Instruction                                | Inglês como língua de instrução, língua/idioma de ensino                                                                                              |   |
| English as language of international education                    | Inglês como língua a educação internacional                                                                                                           |   |
| English as a langauge of business and finance                     | Inglês como linguagem dos negócios e finanças                                                                                                         |   |
| English as the lingua franca of the international trade           | Inglês como língua franca do comércio internacional                                                                                                   |   |
| English as a language of international tourism                    | Inglês como linguagem do turismo internacional                                                                                                        |   |
| English as a language of international communication              | Inglês como língua de comunicação internacional                                                                                                       |   |
| English as language of diplomacy                                  | Inglês como língua da diplomacia                                                                                                                      |   |
| English as the language of science and technology                 | Inglês como língua da ciência e tecnológia                                                                                                            |   |
| English as the lingua franca of air traffic control               | Inglês como língua franca do controle de trafego aéreo                                                                                                |   |
| English has one of the highest information density                | Inglês tem uma das maiores densidades de informação                                                                                                   |   |
| Native English speaker                                            | Falante de inglês nativo                                                                                                                              |   |
| Native Spanish speaker                                            | Falante de espanhol nativo                                                                                                                            |   |
| Spanish as second language                                        | Espanhol como segunda língua                                                                                                                          |   |
| Spanish as third language                                         | Espanhol como terceira língua                                                                                                                         |   |
| Spanish as LATAM lingua franca                                    | Espanhol como língua franca da America Latina                                                                                                         |   |
| Native foreign language speaker                                   | Falante nativo de lingua estrangeira                                                                                                                  |   |
| Foreign Language                                                  | Língua ou idioma estrangeiro                                                                                                                          |   |
| Foreign Language Skills                                           | Habiliade de língua ou idioma estrangeiro                                                                                                             |   |
| Learn a foreign language                                          | Aprender uma língua estrangeira                                                                                                                       |   |
| Anglophones                                                       | Falantes de inglês                                                                                                                                    |   |
| Francophones                                                      | Falantes de francês                                                                                                                                   |   |
| Hispanophones                                                     | Falantes de espanhol                                                                                                                                  |   |
| Lusophones                                                        | Falantes de português                                                                                                                                 |   |
|                                                                   |                                                                                                                                                       |   |
| vocational education                                              | ensino técnico ou profissionalizante (technial school, vocational school, community college)                                                          |   |
| higher education                                                  | ensino superior, ensino universitário                                                                                                                 |   |
| university                                                        | universidade                                                                                                                                          |   |
| international university                                          | universidade que usam inglês como língua de instrução mas são de lugares sem o inglês como idioma nativo.                                             |   |
| college (USA)                                                     | universidade                                                                                                                                          |   |
| college enrollment                                                | matricula em universidade                                                                                                                             |   |
| college student (USA)                                             | estudante universitário                                                                                                                               |   |
| university student (USA)                                          | estudante universitário                                                                                                                               |   |
| college application                                               | se inscrever em processo seletivo de universidade ou se candidatar a universidade                                                                     |   |
| apply to college                                                  | se inscrever em processo seletivo ou se candidatar a universidade                                                                                     |   |
| college degree                                                    | grau universitário, ter curso superior                                                                                                                |   |
| university degree                                                 | grau unviersitário                                                                                                                                    |   |
| submit application                                                | enviar inscrição                                                                                                                                      |   |
| undergraduate student                                             | estudante com ensino superior incompleto. (cursando ensino superior)                                                                                  |   |
| Foreign student                                                   | estudante estrangeiro                                                                                                                                 |   |
| international student                                             | estudante internacional                                                                                                                               |   |
| graduate student                                                  | estudante de pós graduação - estudando mestrado, doutorado ou pós-doutorado -PHD                                                                      |   |
| self taught student                                               | estudante autodidata                                                                                                                                  |   |
| Freshman student (First-Year College Student)                     | Estudante universitário do primeiro ano (undergraduate)                                                                                               |   |
| Sophomore student (Second-Year College Student)                   | Estudante universitário de segundo ano (undergraduate)                                                                                                |   |
| Junior student   (Third-Year College Student)                     | Estudante universitário de terceiro ano (undergraduate)                                                                                               |   |
| Senior student   (Foirth-Year College Student)                    | Estudante universitário a partir do quarto ano.                                                                                                       |   |
| dean                                                              | reitor ou reitora                                                                                                                                     |   |
| professor                                                         | professor títular de universidade (que tem cátedra, não confundir com "teacher", professor de ensino médio)                                           |   |
| role model                                                        | exemplo (ser exemplo) - pessoa seguida por outras como exemplo ou inspiração                                                                          |   |
| researcher                                                        | pesquisador(a)                                                                                                                                        |   |
| classmates                                                        | colegas de classe                                                                                                                                     |   |
| classroom                                                         | sala de aula                                                                                                                                          |   |
| MBA - Master of Business Administration                           | Mestrado em administração de negócios                                                                                                                 |   |
| MSC - Master of Science                                           | Mestrado em área científica                                                                                                                           |   |
| Minor (USA)                                                       | Área de sub-especialização de curso de graduação, como computer science.                                                                              |   |
| Major (USA)                                                       | Área de especilização do curso de graduação escolhida pelo aluno, como fisíca. No Brasil não existe Minor e Major, somente nos EUA e Filipinas.       |   |
| Double Major (USA)                                                | Se formar com duas áreas especialização, equivalente a dois cursos superiores simultâneos.                                                            |   |
| Human Capital                                                     | Capital Humano                                                                                                                                        |   |
| _STEM_ - Science, Technology, Engineering, Math                     | Ciência, Tecnologia, Engenharia, Matemática                                                                                                           |   |
| Bachelor of Science in Electrical Engineering                     | Graduação em engenharia elétrica/eletrotecnica ou eletrônica                                                                                          |   |
| Bachelor of Science in Mechanical Engineering                     | Graduação em engenharia mecânica                                                                                                                      |   |
| Bachelor of Science in Chemical Engineering                       | Graduação em engenharia química                                                                                                                       |   |
| Bachelor of Science in Physics                                    | Graduação em física                                                                                                                                   |   |
| Computer Science                                                  | Ciência da computação                                                                                                                                 |   |
| Network engineer                                                  | Técnico de/em redes => Nota: "engineer" em inglês pode significar 'técnico', não necessariamente significa ter curso superior.                        |   |
| Software engineer                                                 | Técnico/programador/desenvolvedor de software                                                                                                         |   |
| Database engineer                                                 | Técnico/programador/desenvolvedor de banco de dados.                                                                                                  |   |
|                                                                   |                                                                                                                                                       |   |
| liberal arts (terminology comes from Medieval universities)       | artes liberais => Ciências humanas e humanidades, incluindo, econômia, contabilidade, direito (law school) ...                                        |   |
| humanities                                                        | cursos de humanidades - inclui literatura, filosofia, direito e etc.                                                                                  |   |
| trivium (from seven liberal arts - medieval universities)         | grammar (gramática), logics (lógica) and rethorics (retórica) - 3 das 7 artes liberais - vem de universidades medievais                               |   |
| Law school                                                        | univerisdade de direito                                                                                                                               |   |
| Business School                                                   | universidade de negócios/administração de empresas (escola de administração)                                                                          |   |
| lecture / classes                                                 | aula/palestra                                                                                                                                         |   |
| keynote                                                           | apresentação/palestra                                                                                                                                 |   |
| workshop                                                          | oficina/curso ou palestras                                                                                                                            |   |
| tuition fee                                                       | taxa de instrução que se paga no fim do ano em universidades da America do Norte                                                                      |   |
| scholarship                                                       | Bolsa de estudos                                                                                                                                      |   |
| internship                                                        | Estágio                                                                                                                                               |   |
| intern at COMPANY                                                 | estágio em empresa                                                                                                                                    |   |
| mentorship                                                        | mentoria, orientação                                                                                                                                  |   |
| studente exchange program                                         | programa de intercâmbio                                                                                                                               |   |
| alumni                                                            | associação de alunos                                                                                                                                  |   |
| mindset                                                           | mentalidade                                                                                                                                           |   |
| skill                                                             | habilidades                                                                                                                                           |   |
| leadership skill                                                  | habilidade de liderança                                                                                                                               |   |
| hard skills                                                       | habilidades técnicas adquiridas por educação formal e estudo                                                                                          |   |
| soft skills (people skills)                                       | habilidades sociais e interpessoais                                                                                                                   |   |
| research skills                                                   | habilidades de pesquisa                                                                                                                               |   |
| skillset                                                          | conjunto habilidades                                                                                                                                  |   |
| transferable skills                                               | habilidades transferíveis                                                                                                                             |   |
| team work                                                         | trabalho em equipe                                                                                                                                    |   |
| research                                                          | pesquisa                                                                                                                                              |   |
| research field                                                    | campo de pesquisa                                                                                                                                     |   |
| basic research, pure research                                     | pesquisa básica, desinteressada de ganhos imediatos.                                                                                                  |   |
| academic freedom                                                  | liberdade acadêmica                                                                                                                                   |   |
| critical thinking                                                 | pensamento crítico                                                                                                                                    |   |
| curiosity                                                         | curiosidade                                                                                                                                           |   |
| free exchange of ideas                                            | livre troca de ideias                                                                                                                                 |   |
| confront of ideas                                                 | confronto de ideias                                                                                                                                   |   |
| exchange of knowledge                                             | troca de conhecimento                                                                                                                                 |   |
| think out of the box                                              | pensar fora da caixa, pensar de modo não convencional.                                                                                                |   |
|                                                                   |                                                                                                                                                       |   |
| GPA - Grade Point Average                                         | Nota média                                                                                                                                            |   |
| Test score                                                        | Nota em teste/prova/exame                                                                                                                             |   |
| Real world problems                                               | Problemas do mundo real                                                                                                                               |   |
| _TOEFL_ test (English assesment test)                               | Teste de proficiência em inglês exigido por universidades Americanas. (American English)                                                              |   |
| _IELTS_ test (English assesment test)                               | Teste de proficiência em inglês exigido por universidades Inglesas, Canadenses e Australianas.                                                        |   |
| _TestDaF_ test - German assesment test (Goethe Institut)            | Teste de proficiência em Alemão para estudar em Alemanha, Austria ou Suíça.                                                                           |   |
| DILF test - French (Diplôme Initial de Langue Française)          | Teste de proficiência em Francês exigido na França (similar ao TOEFL)                                                                                 |   |
| DELF test - Frech (Diplôme d’Etudes en Langue Française)          | (Francês) - Similar ao DELF                                                                                                                           |   |
| DALF test - French (Diplôme Approfondi de Langue Française)       | (Francês) - Similar ao DELF                                                                                                                           |   |
| TFI test - French ( Test de Français International)               | (Francês) - Similar ao DELF, usado em Quebec                                                                                                          |   |
| _SIELE_ test - Spanish proficiency test (Cervantes Instute)         | Teste de proficiência em Espanhol (similar ao TOEFL)                                                                                                  |   |
| _DELE_ test - Spanish proficiecy test (Spain)                       | Teste de proficiência em Espanhol (similar ao SIELE)                                                                                                  |   |
|                                                                   | Nota: Muitas universidades no mundo, Europa e Asia (excluindo Reino Unido ou Irlanda) usam inglês como língua de instrução e exigem IELTS ou TOEFL.   |   |
| _CEFR_                                                              | _Common European Framework of Reference for Language_                                                                                                   |   |
| GMAT - Graduate Management Admission Test                         | Teste exigido por programas de pós graduação e MBA                                                                                                    |   |
| GRE - Graduate Record Examination                                 | Similar ao GMAT                                                                                                                                       |   |
| American Spelling                                                 | ortografía Americana                                                                                                                                  |   |
| British Spelling                                                  | ortografía Británica                                                                                                                                  |   |
|                                                                   |                                                                                                                                                       |   |
| knowledge                                                         | conhecimento                                                                                                                                          |   |
| wisdom                                                            | sabedoria                                                                                                                                             |   |
| domain knowledge                                                  | conhecimento de domínio                                                                                                                               |   |
| domain expert                                                     | especialista de domínio                                                                                                                               |   |
| learn by doing                                                    | aprender fazendo                                                                                                                                      |   |
| learn from mistakes                                               | aprender com os erros                                                                                                                                 |   |
| learn from other people mistakes                                  | aprender com os erros de outras pessoas                                                                                                               |   |
| _school of thought_                                                 | escola de pensamento (comum em ciências humanas - liberal arts como economia)                                                                         |   |
| ceteris paribus (latin) => [EN: with all else being equal]        | Termo usado em economia - signifca: com todas outras variáveis assumidas como constantes.                                                             |   |
| Keynesian school of economics                                     | escola de pensamento de economia Keynesiana                                                                                                           |   |
| Chicago school of economics                                       | escola de pensamento de economia de Chicago                                                                                                           |   |
| _think tank_                                                        | instituo de pesquisa que auxilia e advoca em áreas de estudos sociais, política e economia. Exemplo: FGV - Fundação Getulio Vargas                    |   |
| _policy institute_                                                  | institito de política, o mesmo que um think-tank como a FGV.                                                                                          |   |
| mainstream                                                        | corrent principal, convencional                                                                                                                       |   |
| consultancy                                                       | consultoria                                                                                                                                           |   |
|                                                                   |                                                                                                                                                       |   |
| _peer review_                                                       | _revisão de pares_                                                                                                                                      |   |
| peer reviewed cryptography                                        | criptografia _revista por pares_ (expecialistas do campo)                                                                                               |   |
| peer reviewed article                                             | artigo com revisão de pares                                                                                                                           |   |
| _scientific method_                                                 | método científico                                                                                                                                     |   |
| experimental method                                               | método experimental                                                                                                                                   |   |
| thought experiment                                                | experimento de pensamento/mental tal como o byzantine fault relacionado a sistemas distribuídos.                                                      |   |
| control group                                                     | gropo de controle                                                                                                                                     |   |
| clinical trial                                                    | experimentos/ensaios clínicos                                                                                                                         |   |
| _reproducility_                                                     | reproducibilidade                                                                                                                                     |   |
| reproducible experiments                                          | experimentos reproduzíveis                                                                                                                            |   |
| reproducible calculations                                         | cálculos reproduzíveis                                                                                                                                |   |
| reproducible results                                              | resultados reproduzíveis                                                                                                                              |   |
| reproducible random numbers                                       | números aleatórios reproduzíveis                                                                                                                      |   |
| statistical significance                                          | significância estatística                                                                                                                             |   |
| hypothesis testing                                                | teste de hipótese                                                                                                                                     |   |
| linear correlation                                                | correlação linear                                                                                                                                     |   |
| correlation is not casuality                                      | correlação não é casualidade                                                                                                                          |   |
| standard deviation                                                | desvio padrão                                                                                                                                         |   |
| average                                                           | média                                                                                                                                                 |   |
| mean                                                              | média                                                                                                                                                 |   |
| R&D - Research and Development                                    | P&D - Pesquisa e Desenvolvimento                                                                                                                      |   |
| _state of art_                                                      | estado da arte, o que tem de mais avançado no campo de estudo                                                                                         |   |
| _prior art_                                                         | arte anterior =>> artigos científicos e teses anteriores                                                                                              |   |
| cutting edge of technology                                        | tecnologia mais avançada                                                                                                                              |   |
| Innovation                                                        | Inovação                                                                                                                                              |   |
| novelty                                                           | novidade                                                                                                                                              |   |
| research grant                                                    | verba de pesquisa                                                                                                                                     |   |
|                                                                   |                                                                                                                                                       |   |
| op-ed (opinion piece)                                             | editorial ou artigo de opinião                                                                                                                        |   |
| essay                                                             | redação/ensaio                                                                                                                                        |   |
| article                                                           | artigo                                                                                                                                                |   |
| _paper_                                                             | artigo científico                                                                                                                                     |   |
| _white paper_                                                       | artigo científico não publicado em journal                                                                                                            |   |
| paper contributions                                               | contribuições do artigo científico.                                                                                                                   |   |
| report                                                            | relatório                                                                                                                                             |   |
| technical report                                                  | relatório técnico                                                                                                                                     |   |
| technical standards (embodies the past wisdom)                    | padrões técnicos como ISO, ABNT, JIS, DIN                                                                                                             |   |
| technical specification                                           | especificação técnica                                                                                                                                 |   |
| thesis                                                            | tese                                                                                                                                                  |   |
| undergraduate thesis                                              | tese de graduação                                                                                                                                     |   |
| master thesis                                                     | tese de mestrado                                                                                                                                      |   |
| doctorate thesis                                                  | tese de doutorado                                                                                                                                     |   |
| phd thesis                                                        | tese de PHD                                                                                                                                           |   |
| _journal_                                                           | publicação científica com revisão de pares                                                                                                            |   |
| _scientific journal_                                                | publicação científica com revisão de pares                                                                                                            |   |
| newspaper                                                         | jornal de notiticias                                                                                                                                  |   |
| magazine                                                          | revista                                                                                                                                               |   |
| novel                                                             | romance - gênero literário - não confudir com "novela"                                                                                                |   |
| _paperwork_                                                         | documentação, comprovantes e etc.                                                                                                                     |   |
|                                                                   |                                                                                                                                                       |   |
| logic                                                             | lógica                                                                                                                                                |   |
| logical reasoning                                                 | raciocínio lógico                                                                                                                                     |   |
| rethorics                                                         | retórica                                                                                                                                              |   |
| arguments                                                         | argumentos                                                                                                                                            |   |
| aesthetics                                                        | estética                                                                                                                                              |   |
|                                                                   |                                                                                                                                                       |   |
| to ask questions                                                  | fazer perguntas                                                                                                                                       |   |
| attendance                                                        | presença em curso ou aula                                                                                                                             |   |
| _syllabus_                                                          | programa do curso contendo, descrição, conteúdo programático, datas de provas e etc.                                                                  |   |
| _textbook_                                                          | livro texto de um curso                                                                                                                               |   |
| _reference books_                                                   | livros de referência                                                                                                                                  |   |
| fundamentals                                                      | fundamentos                                                                                                                                           |   |
| theory                                                            | teoria                                                                                                                                                |   |
| terminology                                                       | terminologia                                                                                                                                          |   |
| vocabulary                                                        | vocabulário                                                                                                                                           |   |
| _jargon_                                                            | jargão - vocabulário específico de grupo profissional, geralmente não entedido por pessoas fora deste grupo.                                          |   |
| theoretical                                                       | teórica                                                                                                                                               |   |
| rationale                                                         | justificativa                                                                                                                                         |   |
| contributions                                                     | contribuições                                                                                                                                         |   |
| problem statement                                                 | declaração do problema                                                                                                                                |   |
| abstract                                                          | sumário de paper                                                                                                                                      |   |
| approach                                                          | abordagem                                                                                                                                             |   |
| assumptions                                                       | hipotéses, premissas                                                                                                                                  |   |
| methodology                                                       | metodologia                                                                                                                                           |   |
| brief                                                             | sumário                                                                                                                                               |   |
| subject                                                           | assunto                                                                                                                                               |   |
| summary                                                           | sumário                                                                                                                                               |   |
| overview                                                          | visão geral                                                                                                                                           |   |
| rebbutal                                                          | refutação                                                                                                                                             |   |
| acknowledgement                                                   | reconhecimento                                                                                                                                        |   |
| autorship                                                         | autoria                                                                                                                                               |   |
| authoring tools                                                   | ferramentas de autoria como Latex, Lyx, Markdown, Emacs's org-mode ...                                                                                |   |
|                                                                   |                                                                                                                                                       |   |
| outlier                                                           | ponto fora da curva                                                                                                                                   |   |
| datum                                                             | dado (singular)                                                                                                                                       |   |
| data                                                              | dados (plural)                                                                                                                                        |   |
| campus                                                            | campus, área de universidade (singular)                                                                                                               |   |
| campi                                                             | campus no plural                                                                                                                                      |   |
| chart                                                             | gráfico                                                                                                                                               |   |
| scatter plot                                                      | gráfico de disperção                                                                                                                                  |   |
| homework                                                          | tarefa / tarefa de casa                                                                                                                               |   |
| assignment                                                        | exercício de curso                                                                                                                                    |   |
| deadline                                                          | prazo                                                                                                                                                 |   |
| submission deadline                                               | prazo para entrega                                                                                                                                    |   |
| submission guidelines                                             | regras de submissão ou regras para envio                                                                                                              |   |
| lecture notes                                                     | notas de aula impressas ou em PDF                                                                                                                     |   |
| handouts                                                          | o mesmo que lecture notes                                                                                                                             |   |
| workload                                                          | carga horária                                                                                                                                         |   |
| cause-effect relationship                                         | relação de causa e efeito                                                                                                                             |   |
| input-output relationship                                         | relação de entrada e saida                                                                                                                            |   |
| spin off company                                                  | Empresa de base tecnológica vinda de grupos de pesquisa de universidades. Exemplo: ARM holdings.                                                      |   |
|                                                                   |                                                                                                                                                       |   |
| research                                                          | pesquisa                                                                                                                                              |   |
| investigation                                                     | investigação                                                                                                                                          |   |
| science                                                           | ciência                                                                                                                                               |   |
| pseudoscience                                                     | pseudociência                                                                                                                                         |   |
| scientific findings                                               | achados científicos                                                                                                                                   |   |
| skepticism                                                        | ceticismo                                                                                                                                             |   |
| rationality                                                       | racionalidade                                                                                                                                         |   |
| rational                                                          | racional                                                                                                                                              |   |
| confirmation bias                                                 | viéis de confirmação   - tendência a buscar informações e fontes que justifiquem suas crenças e valores.                                              |   |
| survivor bias                                                     | viéis de sobrevivente  - tendência a tirar conclusões somente nos sobreviventes, omitindo os não sobreviventes.                                       |   |
| survivorship bias                                                 | viéis de sobrevivente                                                                                                                                 |   |
| logical fallacy                                                   | falácia lógica                                                                                                                                        |   |
| cherry picking                                                    | metáfora: "apahar cerejas" - apresentar somente evidências que justifiquem a posição defendida, excluindo as contraditórias.                          |   |
| cognitive load                                                    | carga cognitiva                                                                                                                                       |   |
| heuristic                                                         | heurística                                                                                                                                            |   |
| mental model                                                      | modelo mental                                                                                                                                         |   |
| nondeterministic model                                            | modelo não determinístico                                                                                                                             |   |
| deterministic model                                               | modelo determinístico                                                                                                                                 |   |
| mathematical notation                                             | notação matemática                                                                                                                                    |   |
| formal definition                                                 | definição formal                                                                                                                                      |   |
| _proof-of-cocept_                                                   | prova de conceito                                                                                                                                     |   |
| _reference implementation_                                          | implementação de referência - implementação de algoritimo ou _technical standard_ que serve de referência a todas outras implementações como OpenSSL.   |   |
| implementation details                                            | detalhes da implementação                                                                                                                             |   |
| due dilligence                                                    | devida diligência                                                                                                                                     |   |
| notation as tool of thought                                       | notação como ferramenta de pensamento                                                                                                                 |   |
| draw your own conclusions                                         | tire suas proprias conclusões                                                                                                                         |   |
|                                                                   |                                                                                                                                                       |   |
| weak evidence                                                     | fraca evidência                                                                                                                                       |   |
| strong evidence                                                   | forte evidência                                                                                                                                       |   |
| lack of evidence                                                  | falta de evidência                                                                                                                                    |   |
| principle of least suprise                                        | princípio da menor surpresa                                                                                                                           |   |
| principle of least astonishment                                   | princípio da menor privilégio (related to computer security)                                                                                          |   |
| principle of least privilege                                      |                                                                                                                                                       |   |
|                                                                   |                                                                                                                                                       |   |
| sources                                                           | fontes                                                                                                                                                |   |
| authoritative sources                                             | fontes autoritativas                                                                                                                                  |   |
| reputable sources                                                 | fontes reputáveis                                                                                                                                     |   |
| bibliography                                                      | bibliografia                                                                                                                                          |   |
| citation                                                          | citação                                                                                                                                               |   |
| cross references                                                  | referências cruzadas                                                                                                                                  |   |
|                                                                   |                                                                                                                                                       |   |
| ISBN - International Standard Book Number                         | Número Padrão Internacional de Livro =>> Número ou ID (Identifier) único para livros.                                                                 |   |
| ISSN - International Standard Serial Number                       | Número Serial Padrão Internacional ==>> Número ou ID (Identifier/identificador) único para medias como revistas ou livros.                            |   |
| DOI - Digital Object Identifer                                    | Identificador de Objeto Digital =>> Indentificador único que designa artigos científicos ou livros.                                                   |   |
|                                                                   |                                                                                                                                                       |   |
| ACM                                                               | Association for Computing Machinery                                                                                                                   |   |
| IEEE                                                              | Institute of Electrical and Electronics Engineers                                                                                                     |   |
| SAE                                                               | Society of Automotive Engineers                                                                                                                       |   |
| IEC                                                               | International Electrotechnical Commission                                                                                                             |   |
| ISO                                                               | International Organization for Standardization                                                                                                        |   |
| ANSI (USA)                                                        | American National Standards Institute                                                                                                                 |   |
| BS                                                                | British Standards                                                                                                                                     |   |
| DIN  (Deutsches Institut für Normung)                             | German Institute for Standardization                                                                                                                  |   |
| JIS                                                               | Japanese Standards Association                                                                                                                        |   |
| ABNT (Brazilian National Standards Organization)                  | Associação Brasileira de Normas Técnicas                                                                                                              |   |
|                                                                   |                                                                                                                                                       |   |
|-------------------------------------------------------------------+-------------------------------------------------------------------------------------------------------------------------------------------------------+---|
| *Finance, Business and Economics Related*                           |                                                                                                                                                       |   |
|-------------------------------------------------------------------+-------------------------------------------------------------------------------------------------------------------------------------------------------+---|
| _spreadsheet_                                                       | planilha (como Microsoft Excel ou Libreoffice Calc)                                                                                                   |   |
| entrepreneur                                                      | empreendedor(a)                                                                                                                                       |   |
| entrepreneurship                                                  | empreendedorismo                                                                                                                                      |   |
| businessperson                                                    | pessoa de negócios (empresário ou empresária)                                                                                                         |   |
| businessman                                                       | empresário ou homem de negócios                                                                                                                       |   |
| businesswoman                                                     | empresária ou mulher de negócios                                                                                                                      |   |
| salesperson                                                       | vendedor ou vendedora                                                                                                                                 |   |
| salesman                                                          | vendedor                                                                                                                                              |   |
| saleswoman                                                        | vendedora                                                                                                                                             |   |
| sales pitch                                                       | apresentação de venda de produto ou serviço a um potencial cliente (customer) com documentos, diagramas, slides e etc.                                |   |
| elevator pitch                                                    | (fala de elevador) - curta descrição pesuasiva de serviço ou produto de modo que qualquer ouvinte (listener) possa endeter em curto periódo de tempo. |   |
|                                                                   |                                                                                                                                                       |   |
| business model                                                    | modelo de negócios                                                                                                                                    |   |
| headquarter                                                       | sede da empresa                                                                                                                                       |   |
| subsidiary                                                        | subsidiaria, sucursal                                                                                                                                 |   |
| middle income trap  (emerging markets)                            | armadilha da renda média (mercados emergentes)                                                                                                        |   |
|                                                                   |                                                                                                                                                       |   |
| accountability                                                    | responsabilidade ou responsabilidade legal                                                                                                            |   |
| to hold someone accountable                                       | responsabilizar alguém legalmente                                                                                                                     |   |
| to make a deal                                                    | fazer acordo ou fechar negócio                                                                                                                        |   |
| to strike a deal                                                  | fazer acordo ou fechar negócio                                                                                                                        |   |
|                                                                   |                                                                                                                                                       |   |
| currency                                                          | moeda                                                                                                                                                 |   |
| currency pegging                                                  | vinculação ou indexação de taxa de câmbio (câmbio fixo) como por exemplo 10 unidades da moeda XYZ por Euro.                                           |   |
| best performing currency                                          | moeda com melhor desempenho (performance) que mais se apreciou em relação a outras moedas.                                                            |   |
| worst performing currency                                         | moeda com pior desempenho (performance)                                                                                                               |   |
| reserve currency                                                  | moeda de reserva (lastro) usada por bancos centrais para lastrear a moeda - exemplo: Dólar.                                                           |   |
| legal tender                                                      | moeda de curso forçado (moeda oficial) - a qual um governo obriga aceitar.                                                                            |   |
| fiat currency                                                     | dinheiro ou moeda fiduciário(a) - não lastreada em nenhum lastro como ouro.                                                                           |   |
| fiat currency is backed by nothing                                | dinheiro fiduciário não é lastreado por nada.                                                                                                         |   |
| wire transfer                                                     | pagamento por meio eletrônico                                                                                                                         |   |
| ATM - Automatic Teller Machine                                    | Caixa Eletrônico                                                                                                                                      |   |
|                                                                   |                                                                                                                                                       |   |
| underrated                                                        | desvalorizado(a)                                                                                                                                      |   |
| overrated                                                         | super valorizado(a)                                                                                                                                   |   |
|                                                                   |                                                                                                                                                       |   |
| budget                                                            | orçamento                                                                                                                                             |   |
| budget cuts                                                       | cortes de orçamento                                                                                                                                   |   |
| budget limit                                                      | limite de orçamento                                                                                                                                   |   |
| budget surplus                                                    | superavit de orçamento, receita maior que despesa                                                                                                     |   |
| budget deficit                                                    | deficit de orçamento, receita menor que despea                                                                                                        |   |
| debt ceiling                                                      | teto de gastos (debito) - para evitar hiperinflação                                                                                                   |   |
| debt cap                                                          | teto de gastos (debito) - o mesmo que 'debt ceiling'                                                                                                  |   |
|                                                                   |                                                                                                                                                       |   |
| cost overrun                                                      | estouro de custos                                                                                                                                     |   |
| trade deal                                                        | acordo comercial                                                                                                                                      |   |
| free trade                                                        | livre comércio                                                                                                                                        |   |
| free trade deal                                                   | acordo de livre comércio                                                                                                                              |   |
| international trade                                               | comércio internacional                                                                                                                                |   |
| supply and demand                                                 | oferta e demanda                                                                                                                                      |   |
| bid price (buyers)                                                | preço de demanda - máximo preço que compradores (buyers) estão dispostos a pagar.                                                                     |   |
| ask price (sellers)                                               | preço de oferta - mínimo preço que vendedores (sellers) estão dispostos a aceitar.                                                                    |   |
| ask-bid price spread                                              | diferença entre o bid-price and ask-price                                                                                                             |   |
| call option contract                                              | contrato derivativo de opção de compra                                                                                                                |   |
| put option contract                                               | contrato derivativo de opção de venda                                                                                                                 |   |
| position                                                          | posição => quantidade de ativos financeiros que um investidor tem.                                                                                    |   |
| long position  (derivatives)                                      | posição de compra ou posição comprada                                                                                                                 |   |
| short position (derivatives)                                      | posição de venda  ou posição vendida                                                                                                                  |   |
| short position                                                    | posição de venda a descoberto (short selling)                                                                                                         |   |
| to short a stock                                                  | fazer venda a descoberto de uma ação (short selling)                                                                                                  |   |
| short squeeze                                                     | liquidação de posição de short sellers com compra do ativo para limitar perda devido aumentos inesperados de preço da ação ou ativo.                  |   |
| buy and hold strategy                                             | estratégia: comprar e manter um ativo financeiro  até o momento da venda com maior preço.                                                             |   |
| short selling                                                     | venda a descoberto - venda de ação ou ativo finaceiro apostando na baixa ou queda do ativo.                                                           |   |
| short selling may have unlimited losses                           | venda a descoberto pode ter perdas ilimitadas                                                                                                         |   |
| emerging markets                                                  | mercados emergentes                                                                                                                                   |   |
| energy markets                                                    | mercados de energia                                                                                                                                   |   |
| foreign exchange market                                           | mercado de moeda extrangeira                                                                                                                          |   |
| financial market                                                  | mercado financeiro                                                                                                                                    |   |
| primary market                                                    | mercado primário                                                                                                                                      |   |
| secondary market                                                  | mercado secundário                                                                                                                                    |   |
| OTC market / over-the-counter market                              | mercado de balcão não organizado em bolsa de valores, geralmente intermediado por corretoras ou bancos                                                |   |
| future markets (future contracts)                                 | mercado de contratos derivativos futuros                                                                                                              |   |
| bond market                                                       | mercado de títulos de renda fixa                                                                                                                      |   |
| treasury bond market                                              | mercado de títulos do tesouro                                                                                                                         |   |
| spot market                                                       | mercado a vista - em constraste com mercado de contratos derivativos futuros                                                                          |   |
| single market                                                     | mercado único - mercado homogêneo, com leis e linguas comuns. Examplos: USA, Brasil, América Latina (quase), Mercosur                                 |   |
| customs union                                                     | União Aduaneira - bloco comercial como Mercosur (Mercosul), União Europeia                                                                            |   |
|                                                                   |                                                                                                                                                       |   |
| expenditure                                                       | despesas                                                                                                                                              |   |
| CAPEX - Capital Expenditure                                       | Despesa de capital, investimento em máquina, software ou equipamento.                                                                                 |   |
| OPEX - Operational Expenditure                                    | Despesa operacional                                                                                                                                   |   |
| Cost Center                                                       | Centro de custo                                                                                                                                       |   |
| Profit Center                                                     | Centro de lucro                                                                                                                                       |   |
|                                                                   |                                                                                                                                                       |   |
| Asset Management                                                  | Gerenciamento de ativos                                                                                                                               |   |
| Wealth Management                                                 | Gerenciamento de riqueza/patrimônio                                                                                                                   |   |
| Retail                                                            | Varejo                                                                                                                                                |   |
| Wholesale                                                         | Atacado                                                                                                                                               |   |
| Retail bank                                                       | Banco de varejo                                                                                                                                       |   |
| Investment bank                                                   | Banco de investimento                                                                                                                                 |   |
| investment portfolio                                              | Portfolio, carteira de investimentos                                                                                                                  |   |
|                                                                   |                                                                                                                                                       |   |
| fixed income assets                                               | ativos de renda fixa                                                                                                                                  |   |
| fixed income instruments                                          | instrumentos/ativos de renda fixa                                                                                                                     |   |
| fixed income securities                                           | ativos finaceiros de renda fixa                                                                                                                       |   |
| debt securities                                                   | ativos finaceitos baseados em debito                                                                                                                  |   |
| bonds                                                             | títulos de renda fixa                                                                                                                                 |   |
| bond yield                                                        | rendimento ou taxa de retorno de título de renda fixa                                                                                                 |   |
| inflation-indexed bonds or inflation-linked bonds                 | títulos de renda fixa com rendimento atrelado a inflação, usados para hedging contra infação - exemplo: títulos NTN-B ou NTN-C do tesouro do Brasil.  |   |
| high yield bonds                                                  | títulos de renda fixa com alto rendimento (altos juros), contudo muitas vezes com mais risco                                                          |   |
| junk bond                                                         | títulos de renda fixa de grau especulativo (alto risco), contudo muitas vezes com altos juros e alto prêmio de risco                                  |   |
| treasury bonds                                                    | títúlos do fixa do tesouro, emitidos por governos                                                                                                     |   |
| corporate bonds                                                   | títulos de renda fixa emitidos por empresas privadas ou corporações                                                                                   |   |
| credit rating                                                     | nota de crédito - dada por agências como Moody                                                                                                        |   |
| rating agency                                                     | agência de classificação de risco que dão notas de crédito como: _Moody's_, _S&P - Standards & Poort's_ e _Fitch_                                           |   |
|                                                                   |                                                                                                                                                       |   |
| M&A - Merging & Acquisition                                       | Fusões e Aquisições                                                                                                                                   |   |
| R&D - Research & Development                                      | Pesquisa e desenvolvimento                                                                                                                            |   |
| QA - Quality Assurance                                            | Garantia de qualidade                                                                                                                                 |   |
| B2B - Business-To-Business                                        | Empresa para Empresa => Empresa que presta serviço a outras empresas                                                                                  |   |
| B2C - Business-To-Consumer                                        | Empresa para consumidor                                                                                                                               |   |
| B2G - Business-To-Government                                      | Empresa para governo                                                                                                                                  |   |
| P2P - Person-To-Person (Sharing Economy)                          | Pessoa para Pessoa, intermediado por alguma plataforma como Airbnb (sharing economy - economia compartilhada)                                         |   |
| bull market (bullish)                                             | mercado touro / mercado com tendência de alta                                                                                                         |   |
| bear market (bearish)                                             | mercado urso / mercado com tendência de baixa                                                                                                         |   |
| bullish investors                                                 | investidores com expectativas positivas sobre o mercado ou sobre um ativo                                                                             |   |
| bearish investors                                                 | investidores com expectativas negativas sobre o mercado ou sobre um ativo                                                                             |   |
| economic forecast                                                 | previsão econômica                                                                                                                                    |   |
| exchange rate forecast                                            | previsão para taxa de câmbio                                                                                                                          |   |
| black swan                                                        | metafora: cisne negro, evento raro e inesperado para o qual não se estava preparado.                                                                  |   |
| educated guess                                                    | estimativa educada                                                                                                                                    |   |
| foreign direct investment                                         | investimento extrangeiro direto                                                                                                                       |   |
| board of directors                                                | Conselho diretor de empresa                                                                                                                           |   |
| contractor                                                        | profissional autônomo, profissional liberal ou empresa terceirizada                                                                                   |   |
| government  contractor                                            | empresa terceirizada que presta serviços ao governo                                                                                                   |   |
| limited liability                                                 | responsabilidade limitada (credores só podem tomar no máximo o que foi investido)                                                                     |   |
| limited liability company                                         | empresa de responsabilidade limitada                                                                                                                  |   |
| publicly traded company                                           | sociedade anônima - empresa de capital aberto negociada em bolsa                                                                                      |   |
| IPO - Initial Public Offering                                     | Oferta Pública Inicial => Abertura de capital com oferta incial de acões de uma empreas no mercado primário.                                          |   |
| monetary policy                                                   | política monetária                                                                                                                                    |   |
| fiscal policy                                                     | política fiscal                                                                                                                                       |   |
| industrial policy                                                 | política industrial                                                                                                                                   |   |
| interest                                                          | juros                                                                                                                                                 |   |
| interest payment                                                  | pagamento de juros                                                                                                                                    |   |
| interest rate                                                     | taxa de juros                                                                                                                                         |   |
| interest rate spread                                              | diferença entre taxas de juros, as vezes medidas em basis-points (pontos base)                                                                        |   |
| interest rate hike                                                | aumento de taxa de juros                                                                                                                              |   |
| negative interest rate                                            | taxa de juros negativa                                                                                                                                |   |
| compound interest rate                                            | taxa de juros composta                                                                                                                                |   |
| continous compound interest rate                                  | taxa de juros composta continuamente (usada em cálculos de derivativos)                                                                               |   |
| exchange rate                                                     | taxa de câmbio                                                                                                                                        |   |
| floating exchange rate system                                     | regime de câmbio flutuante                                                                                                                            |   |
| fixed exchange rate system                                        | regime de câmbio fixo                                                                                                                                 |   |
| CPI - Consumer Price Index                                        | Índice de Preços ao Consumidor (indicador de inflação)                                                                                                |   |
| inflation rate                                                    | taxa de inflação                                                                                                                                      |   |
| inflation target                                                  | meta de inflação (regime de metas de inflação adotado no Brasil e outros paises)                                                                      |   |
| inflation hedging                                                 | estratégia de proteção de ativos contra inflação                                                                                                      |   |
| Shrinkflation                                                     | processo de reduzir quantidade de produto em embalagem quando há inflação para manter o mesmo preço                                                   |   |
| growth rate                                                       | taxa de crescimento                                                                                                                                   |   |
| mark-to-market                                                    | marcação a mercado - precificação de ativo ou posição continuamente                                                                                   |   |
| RoR - rate of return                                              | taxa de retorno                                                                                                                                       |   |
| _TVM (Time-Value-Of-Money)_ Calculations                            | Cálculos do valor do dinheiro no tempo (Valor presente, valor futuro, e etc.)                                                                         |   |
| _IRR_ - Internal Rate Of Return                                     | taxa de interna de retorno (TIR)                                                                                                                      |   |
| _NPV_ - Net Present Value                                           | valor presente líquido                                                                                                                                |   |
| _NFV_ - Net Future Value                                            | valor futuro líquido                                                                                                                                  |   |
| payback (time)                                                    | tempo para recupera valor total do investimento.                                                                                                      |   |
| _yield curve_                                                       | curva de juros                                                                                                                                        |   |
| quantitative easing                                               | afrouxamento monetário (ação de banco central)                                                                                                        |   |
| clearing house                                                    | casa de liquidação e custódia                                                                                                                         |   |
| stock exchange                                                    | bolsa de valores, similar a Bovespa                                                                                                                   |   |
|                                                                   |                                                                                                                                                       |   |
| financial records                                                 | registros financeiros                                                                                                                                 |   |
| transaction records                                               | registros de trasação                                                                                                                                 |   |
| balance sheet                                                     | demonstrativo financeiro: balancete ou balanço patrimonial                                                                                            |   |
| cash flow statement                                               | demonstrativo de fluxo de caixa                                                                                                                       |   |
| net worth                                                         | patrimônio líquido                                                                                                                                    |   |
| saving account                                                    | conta poupança                                                                                                                                        |   |
| checking account                                                  | conta corrente                                                                                                                                        |   |
| savings                                                           | poupança                                                                                                                                              |   |
| savings rate                                                      | taxa de pupança                                                                                                                                       |   |
| assets                                                            | ativos em contabilidade                                                                                                                               |   |
| liquid assets                                                     | ativos liquidos (com grande liquidez)                                                                                                                 |   |
| illiquid assets                                                   | ativos não liquidos (com baixa liquidez)                                                                                                              |   |
| real estate assets                                                | ativos imobiliários                                                                                                                                   |   |
| physical assets                                                   | ativos físicos (baixa liquidez)                                                                                                                       |   |
| inventory                                                         | estoque de produtos (ativos físicos)                                                                                                                  |   |
| COG - Cost of Goods Sold                                          | Custo de mercadorias vendidas                                                                                                                         |   |
| financial assets                                                  | ativos financeiros                                                                                                                                    |   |
| asset pricing                                                     | precificação de ativos                                                                                                                                |   |
| asset pricing model                                               | modelo de precificação de ativos                                                                                                                      |   |
| overvalued asset                                                  | ativo super valorizado                                                                                                                                |   |
| undervaluated asset                                               | ativo desvalorizado                                                                                                                                   |   |
| securities                                                        | ativos finaceiros negociados em bolsa                                                                                                                 |   |
| liabilities                                                       | passivos ou obrigações em contabilidade                                                                                                               |   |
| equity                                                            | patrimônio líquido, capital próprio ou ação de uma empresa.                                                                                           |   |
| liquidity                                                         | liquidez - facilidade de conversão de ativo em dinheiro e vice versa                                                                                  |   |
| liquidity                                                         | liquidez - pode ser quantificada como o volume de negociação de um ativo (asset)                                                                      |   |
| low liquidity assets                                              | ativos de baixa liquidez                                                                                                                              |   |
| high liquidity assets                                             | ativos de alta liquidez                                                                                                                               |   |
| shareholders                                                      | acionistas de uma empresa de capital aberto                                                                                                           |   |
| stockholders                                                      | acionistas de uma empresa de capital aberto                                                                                                           |   |
| stakeholders                                                      | partes interessadas de uma empresa (credores, funcionarios, sociedade e etc.)                                                                         |   |
| customers                                                         | clientes de uma empresa                                                                                                                               |   |
| creditors                                                         | credores                                                                                                                                              |   |
| partners                                                          | parceiros                                                                                                                                             |   |
| partnership                                                       | parceria                                                                                                                                              |   |
| strategic partnership                                             | parceria estratégica                                                                                                                                  |   |
| leverage (also known as - gearing)                                | alavancagem ou uso de endividamento para aumentar retorno no investmento.                                                                             |   |
| ROI - Return On Investment                                        | Retorno no investmento (métrica)                                                                                                                      |   |
| ROA - Return On Assets                                            | Returno nos ativos (métrica)                                                                                                                          |   |
| EPS - Earning Per Share                                           | Ganhos por ação                                                                                                                                       |   |
| earnings report                                                   | Relatos/relatório de ganhos                                                                                                                           |   |
| market sell-off                                                   | Massiva venda do ativo ou ação em um curto periodo de tempo que causa considerável queda de seu valor.                                                |   |
| global annual turnover                                            | receita total anual global (aplicado a multi nacionais)                                                                                               |   |
| revenue                                                           | receita ou faturamento                                                                                                                                |   |
| revenue stream                                                    | fluxo de receitas                                                                                                                                     |   |
| net revenue                                                       | receita liquida (lucro)                                                                                                                               |   |
| profit                                                            | lucro                                                                                                                                                 |   |
| profit margin                                                     | margem de lucro                                                                                                                                       |   |
| dividends                                                         | dividendos - lucro distribuido a acionistas (shareholders)                                                                                            |   |
| stocks                                                            | ações - fatia de capital social de empresa de capital aberto negociada em bolsa                                                                       |   |
| shares                                                            | ações - o mesmo que stocks                                                                                                                            |   |
| preferred stock                                                   | ação preferencias - tem prioridade dividendos, mas sem direito a voto.                                                                                |   |
| common stock                                                      | ação ordinária - tem direito a votos                                                                                                                  |   |
| stocks buybacks (USA)                                             | recompra de ações para aumentr o preço da ação e distribuir lucro feita por empresas Americanas devido a dividendos nos EUA serem taxados.            |   |
| shares buybacks (USA)                                             | recompra de ações, o mesmo que "stocks buybacks". Não existe no Brasil.                                                                               |   |
| operating margin                                                  | margem operacional                                                                                                                                    |   |
| loss                                                              | perda/prejuízo                                                                                                                                        |   |
| _working capital_                                                   | capital de giro                                                                                                                                       |   |
| non realized earnings                                             | ganhos/receitas não realizados(as). Exemplo: imóvel que aumentou de valor, mas não foi vendido.                                                       |   |
| non reliazed gains                                                | ganhos/receitas não realizados                                                                                                                        |   |
| market capitalization (market cap)                                | capitalização da empresa (total valor de mercado)                                                                                                     |   |
| market share                                                      | fatia de mercado ou participação de mercado de uma empresa.                                                                                           |   |
| MRR - Monthly Recurring Revenue                                   | Receita recorrente mensal (métrica usada por startups)                                                                                                |   |
| flagship product                                                  | produto mais importante                                                                                                                               |   |
| MVP - Minimum Viable Product                                      | Produto Minimamente Viavel (startup company)                                                                                                          |   |
| POC - Proof-Of-Concept                                            | Prova de conceito (startup company)                                                                                                                   |   |
| Retention rate                                                    | Taxa de retenção (startup company)                                                                                                                    |   |
| User Engagement                                                   | Engajamento de usuário (startup)                                                                                                                      |   |
| Marginal Cost                                                     | Custo marginal (startup)                                                                                                                              |   |
| Zero Marginal Cost                                                | Zero Custo marginal (startup)                                                                                                                         |   |
| CAGR - Compound Annual Growth Rate                                | Taxa de crescimento média anual composta                                                                                                              |   |
| SME - Small and mid-size enterprises                              | pequenas e médias empresas                                                                                                                            |   |
| SMB - Small and mid-size business                                 | pequenas e médias empresas                                                                                                                            |   |
| bankruptcy                                                        | falência                                                                                                                                              |   |
| insolvency                                                        | insolvência                                                                                                                                           |   |
| bailout                                                           | resgate financeiro                                                                                                                                    |   |
| mortgage                                                          | hipoteca (uso de ativos imobiliários como garantia)                                                                                                   |   |
| mortgage backed securities                                        | ativos financeiros lastreados em hipotecas                                                                                                            |   |
|                                                                   |                                                                                                                                                       |   |
| stake                                                             | Participação em negócio (ter fatia de capitla de empresa) ou interesse                                                                                |   |
| controlling stake                                                 | Participação controladora em capital de empresa (acionista controlador)                                                                               |   |
| majority stake                                                    | Participação majoritaria em capital (acionista controlador)                                                                                           |   |
| business stake                                                    | Participação em negócio                                                                                                                               |   |
| business interest                                                 | Participação em negócio                                                                                                                               |   |
|                                                                   |                                                                                                                                                       |   |
| Private Equity Fund                                               | Fundo de Participações Privadas - o qual compra participação em capital (stake) de empresas privadas.                                                 |   |
| ETF Fund - Exchange Traded Fund (Passive Fund)                    | Fundo de índice (Fundo passivo) ou fundo negociado em bolsa que segue algum índice como S&P-500 ou Ibovespa                                           |   |
| Index Fund (Passive Fund)                                         | O mesmo que ETF                                                                                                                                       |   |
| Trust fund                                                        | Fundo fiduciário                                                                                                                                      |   |
| Hedge fund                                                        | Fundo de hedge (fundo de cobertura)                                                                                                                   |   |
| Mutual fund                                                       | Fundo mútuo                                                                                                                                           |   |
| Pensions fund                                                     | Fundo de pensão                                                                                                                                       |   |
| REIT - Real Estate Investment Trust                               | Fundo de investimento imobiliário (EUA)                                                                                                               |   |
| Sovereign Wealth Fund                                             | Fundo de riqueza soberano                                                                                                                             |   |
| Venture Capital Fund                                              | Fundos de capital de risco, compram participação (stake) em capital de startups e empresas em early stage (estágio inicial)                           |   |
| Actively Managed Fund                                             | Fundo gerenciado ativamente - em constraste com ETFs                                                                                                  |   |
|                                                                   |                                                                                                                                                       |   |
| economic externality                                              | externalidade economica                                                                                                                               |   |
| network effect           (externality)                            | efeito de rede                                                                                                                                        |   |
| information asymetry     (externality)                            | asimetria da informação (externalidade - economia)                                                                                                    |   |
| risk                                                              | risco                                                                                                                                                 |   |
| risk aversion                                                     | aversão ao risco                                                                                                                                      |   |
| risk, return and liquidity tradeoff                               | balanço entre risco, retorno e liquidez                                                                                                               |   |
| market risks                                                      | riscos de mercado                                                                                                                                     |   |
| foreign exchange risks                                            | riscos câmbiais                                                                                                                                       |   |
| default risk                                                      | risco de inadimplência, risco de default                                                                                                              |   |
| sovereign debt default risk                                       | risco de default de debito soberano (divida de pais com credores internacionais)                                                                      |   |
| risk exposure                                                     | exposição ao risco                                                                                                                                    |   |
| emerging market risks                                             | risco de mercados emergentes                                                                                                                          |   |
| emerging market risk exposure                                     | exposição a risco de mercados emergentes                                                                                                              |   |
| risk premium                                                      | prêmio de risco - exigido por investidores para tomarem maior risco.                                                                                  |   |
| opportunity cost                                                  | custo de oportunidade                                                                                                                                 |   |
|                                                                   |                                                                                                                                                       |   |
| foreign exchange reserverves                                      | reservas em moeda extrangeira                                                                                                                         |   |
| Trade deficit                                                     | Deficit na balança comercial, importa mais que exporta                                                                                                |   |
| Trade surplus                                                     | Superavit na balança comercial, exporta mais que importa                                                                                              |   |
| GDP - Grosss Domestic Product                                     | Produto Interno Bruto                                                                                                                                 |   |
| GDP growth                                                        | Crescimento do GDP                                                                                                                                    |   |
| GDP per capita                                                    | GDP per capita (por pessoa)                                                                                                                           |   |
| Income per capita                                                 | Renda per capita (por pessoa)                                                                                                                         |   |
| Disposable income per capita                                      | Renda disponível (liquida) por pessoa                                                                                                                 |   |
| Well being                                                        | Bem-estar                                                                                                                                             |   |
| Standard of living                                                | Padrão de vida                                                                                                                                        |   |
| Cost of living                                                    | Custo de vida                                                                                                                                         |   |
|                                                                   |                                                                                                                                                       |   |
| down payment                                                      | entrada, pagamento a vista                                                                                                                            |   |
| upfront cost                                                      | custo inicial ou custo a vista                                                                                                                        |   |
| upfront payment                                                   | pagamento a vista                                                                                                                                     |   |
| installment payment                                               | pagamento em parcela                                                                                                                                  |   |
| installments                                                      | parcelas                                                                                                                                              |   |
|                                                                   |                                                                                                                                                       |   |
| place an order                                                    | fazer um pedido, fazer uma compra                                                                                                                     |   |
| fulfill an order                                                  | completar um pedido                                                                                                                                   |   |
| supply chain                                                      | cadeia logistica                                                                                                                                      |   |
| shipment                                                          | carregamento                                                                                                                                          |   |
| shipping time                                                     | tempo de frete                                                                                                                                        |   |
| shipping cost or freight cost                                     | custo de frete                                                                                                                                        |   |
| shipping industry                                                 | industria/setor de frete/transporte/transportadora                                                                                                    |   |
| supply chain company                                              | empresa de cadeia logistica                                                                                                                           |   |
| FOB - Free On Board or Freight on Board                           | Designa que a responsabilidade (liability) é passada do vendedor (buyer) para o vendedor (seller)                                                     |   |
| third parties                                                     | terceiros                                                                                                                                             |   |
| one-stop-shop                                                     | loja de uma única parada, loja que tem tudo como a AWS ou GCP na cloud.                                                                               |   |
| online marketplace                                                | mercado online como Mercado Libre                                                                                                                     |   |
| dealership                                                        | concessionária (revendedor de carros ou veículos)                                                                                                     |   |
|                                                                   |                                                                                                                                                       |   |
| accounting                                                        | contabilidade                                                                                                                                         |   |
| GAPP - Generally Accepted Accouting Principles (USA)              | Padrão de contabilidade usado nos EUA                                                                                                                 |   |
| IFRS - International Finacial Reporting Standards (IFRS)          | Padrão de contabilidade usado na maioria das jurisdições do mundo por empresas de capital aberto.                                                     |   |
| income tax                                                        | imposto de renda                                                                                                                                      |   |
| income tax return                                                 | declaração de imposto de renda                                                                                                                        |   |
| tax breaks                                                        | incentivos fiscais                                                                                                                                    |   |
| tariff                                                            | imposto de importação; tarifa de importação                                                                                                           |   |
| fee                                                               | taxa                                                                                                                                                  |   |
| fine (fines)                                                      | multa - punição financeira                                                                                                                            |   |
| dividend tax                                                      | imposto sobre dividendos                                                                                                                              |   |
| property tax                                                      | imposto sobre imóvel, exemplo: IPTU do Brasil                                                                                                         |   |
| payroll taxes                                                     | impostos e encargos sobre folha salarial                                                                                                              |   |
| corporate taxes                                                   | impostos corporativos                                                                                                                                 |   |
| witheld tax                                                       | imposto retido na fonte                                                                                                                               |   |
| VAT (Value Added Tax) tax, also known as sales tax                | imposto de valor adicionado como ICMS e IPI do Brasil                                                                                                 |   |
| tax reform                                                        | reforma tributária                                                                                                                                    |   |
| progressive tax system                                            | sistema tributário progressivo                                                                                                                        |   |
| regressive tax system                                             | sistema tributário regressivo (Brasil - a maior parte das receitas de impostos incidem sobre o consumo - quanto menos tem, mais paga!)                |   |
| depreciation                                                      | depreciação                                                                                                                                           |   |
| red tape (bureaucracy)                                            | burocracia                                                                                                                                            |   |
|                                                                   |                                                                                                                                                       |   |
| insurance                                                         | seguro                                                                                                                                                |   |
| insurane policy                                                   | política/regras do seguro                                                                                                                             |   |
| insurance coverage                                                | cobertura de seguro / apolice                                                                                                                         |   |
| insurance premium                                                 | prêmio de seguro / pagamento mensal ao seguro                                                                                                         |   |
| insurance agent                                                   | vendedor de seguros                                                                                                                                   |   |
|                                                                   |                                                                                                                                                       |   |
|-------------------------------------------------------------------+-------------------------------------------------------------------------------------------------------------------------------------------------------+---|
