Rosetta_Stone_Translation.html
<div id="outline-container-org06639b5" class="outline-3">
<h3 id="org06639b5"><span class="section-number-3">1.2</span> Terminology Table</h3>
<div class="outline-text-3" id="text-1-2">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">English / Inglês</th>
<th scope="col" class="org-left">Portuguese / Português</th>
<th scope="col" class="org-left">&#xa0;</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">kernel</td>
<td class="org-left">núcleo ou núcleo de sistema operacional ou núcleo do sistema.</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">bootloader</td>
<td class="org-left">carregador de inicialização. Software ou firmware que carrega um sistema operacional. Exemplo: grub, bios, U-boot.</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">processor core</td>
<td class="org-left">núcleo de processador</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">process</td>
<td class="org-left">processo - programa em execução</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">thread</td>
<td class="org-left">linha de execução; ou fluxo de execução independente em um processo.</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">thread</td>
<td class="org-left">linha de conversação (assunto) em foruns ou email.</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">user-space thread</td>
<td class="org-left">thread de espaço do usuário (greenthread)</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">kernel thread;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">software library</td>
<td class="org-left">biblioteca de software</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">runtime</td>
<td class="org-left">pode significar: biblioteca de execução, motor de execução ou ambiente de execução</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">runtime library</td>
<td class="org-left">biblioteca de execução, tal como a GLIBC (GNU C LIbrary ou MUSL C library) do GNU/Linux</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">runtime enviroment</td>
<td class="org-left">ambiente de execução ou de tempo de execução</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">runtime engine</td>
<td class="org-left">motor de execução</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">container runtime engine</td>
<td class="org-left">motor de execução de container, exemplos: Docker ou podman (RedHat)</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">standard library</td>
<td class="org-left">biblioteca padrão</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">programming language</td>
<td class="org-left">linguagem de programação</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">SW - sofware</td>
<td class="org-left">programa de computador</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">HW - hardware</td>
<td class="org-left">dispositivo físico</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Standardization committee</td>
<td class="org-left">Comitê de padronização</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Standardization body</td>
<td class="org-left">Comitê de padronização, similar ao comitê ISO.</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left"><b>Algorithms and Data Structures</b></td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">datum</td>
<td class="org-left">dado  (singular)</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">data</td>
<td class="org-left">dados (plural)</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">metadata</td>
<td class="org-left">metadados =&gt; Dados sobre os dados, tal como hash ou nome de um arquivo.</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">algorithm</td>
<td class="org-left">algoritimo, sequências de passos para resolver um problema.</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">pseudocode</td>
<td class="org-left">peseudo código (pronunciado como sudocode)</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">array</td>
<td class="org-left">cadeia de elementos ordenados continuamente na memória com acesso aleatório.</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">string</td>
<td class="org-left">cadeia de caracteres, tipo de dados que representa texto</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">stack</td>
<td class="org-left">pilha</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">stack overflow</td>
<td class="org-left">estouro de pilha - quando se empilha mais elementos que a capacidade da pilha ou em pode acontecer em recursão excessiva.</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">call stack</td>
<td class="org-left">pilha de chamadas de funções em um processo.</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">queue</td>
<td class="org-left">fila</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">task queue</td>
<td class="org-left">fila de tarefas</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">message queue</td>
<td class="org-left">fila de mensagens</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">sets</td>
<td class="org-left">conjuntos - estrutura de dados que modela algebra de conjuntos. Não pode haver elementos repetidos.</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">hash table</td>
<td class="org-left">tabela hash, conhecido como dicionário</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">dictionary</td>
<td class="org-left">outro nome para tabela hash ou dicionário</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">map (hash map)</td>
<td class="org-left">outro nome para tabela hash ou dicionário</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">job queue</td>
<td class="org-left">fila de tarefas ou fila de trabalhos</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">linked list</td>
<td class="org-left">lista encadeada</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">priority queue</td>
<td class="org-left">fila de prioridades</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">tree</td>
<td class="org-left">arvore</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">binary tree</td>
<td class="org-left">arvore binária</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">graph</td>
<td class="org-left">grafo</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">DAG - Directed Acyclic Graph</td>
<td class="org-left">Grafo dirigido acíclico</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">FIFO - First-In First-Out</td>
<td class="org-left">Primeiro entra, primeiro sai. (Fila ou queue)</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">LIFO - Last-In First-Out</td>
<td class="org-left">Último entra, primeiro sai. (Pilha ou stack)</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">performance</td>
<td class="org-left">desempenho</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">performance bottleneck</td>
<td class="org-left">gargalo de performance</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">performance improvements</td>
<td class="org-left">melhorias de performance/desempenho</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">performance enhancements</td>
<td class="org-left">melhorias de performance/desempenho</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">time and space tradeoff</td>
<td class="org-left">balanço entre tempo e espaço</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">data structure memory laoyout</td>
<td class="org-left">formato da estrutura de dados em memória</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">FSM - Finite State Machine</td>
<td class="org-left">Máquina de estados finitos</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">algorithm</td>
<td class="org-left">algoritimo - sequência finita de passos para resolver um problema</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">algorithm efficiency</td>
<td class="org-left">eficiência de algoritimo</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">pseudocode (pronounced as 'sudocode')</td>
<td class="org-left">pseudo-código</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">computational complexity theory</td>
<td class="org-left">teoria da complexidade computacional</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">sorting</td>
<td class="org-left">ordenação</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">sorting algorithm</td>
<td class="org-left">algoritimo de ordenação</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">bubble sorting</td>
<td class="org-left">algoritimo de ordenação da bolha</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">GCD - Greatest Common Divisor</td>
<td class="org-left">algoritimo do máximo divisor comun</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">computer graphics algorithm</td>
<td class="org-left">algoritimos de computação gráfica</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">numerical methodos</td>
<td class="org-left">métodos numéricos, algoritmos para resolver problemas matemáticos sem forma fechada (closed form solution)</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">numerical computing algorithm</td>
<td class="org-left">algoritimo de computação numérica (métodos numéricos)</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">root finding algorithm</td>
<td class="org-left">método numéricos para encontrar raízes de equações não lineares.</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Newton-Raphson method (algorithm)</td>
<td class="org-left">método de Newton-Raphson, usado encontrar raiz de equações não lineares (root finding)</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left"><b>Miscellaneous</b></td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">To debug</td>
<td class="org-left">depurar</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Troubleshoot</td>
<td class="org-left">Solução de problemas</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Troubleshooting</td>
<td class="org-left">Solução/Investigação de problemas</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Class  inheritance</td>
<td class="org-left">herança de classes</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Operator overloading</td>
<td class="org-left">sobrecarga de operadores</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Method overriding</td>
<td class="org-left">Sobreposição de método</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Override a method</td>
<td class="org-left">Sobrepor um método de uma classe</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Exception handling</td>
<td class="org-left">tratamento de exceções</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Exception handler</td>
<td class="org-left">tratador de exceções, código que trata exceção</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Event handler</td>
<td class="org-left">tratador de eventos</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Event handling</td>
<td class="org-left">tratamento de eventos</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Error handling</td>
<td class="org-left">tratamento de erros</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Error prone</td>
<td class="org-left">propenso a erro</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Callback</td>
<td class="org-left">função suprida pelo usuário que será chamada depois pelo framework.</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">hook</td>
<td class="org-left">gancho, interceptação, ponto de interceptação ou o mesmo que callback.</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><span class="underline">Semiconductor foundry</span></td>
<td class="org-left">Fábrica de semicondutores ou de circuitos integrados</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Fabless semiconductor company</td>
<td class="org-left">Empresa de semicondur sem fábrica própria como AMD e Nvidia.</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Chipmaker</td>
<td class="org-left">Fabricante ou projetista de semicondutores.</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">IC - Integrated Circuit</td>
<td class="org-left">CI - Circuito Integrado</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><span class="underline">IP Core</span> (Intelectual Property Core)</td>
<td class="org-left">Núcleos/Blocos de CI de propriedade intelectual que podem ser licenciados a outras empreas como <span class="underline">ARM core</span>, <span class="underline">MIPS</span> core e <span class="underline">PowerPC core</span>.</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">SoC - System-On-Chip</td>
<td class="org-left">Sistema no Chip (no CI - Circuito Integrado)</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">ISA - Instruction Set Architecture</td>
<td class="org-left">Conjunto de Instruções de Arquitetura</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">RISCV ISA</td>
<td class="org-left">ISA (Instruction Set Architecture) open source e bloco de IC open source que pode ser usado por qualquer chipmaker.</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">HSA - Heterogenous System Architecture</td>
<td class="org-left">Sistema  de Arquitetura Heterogênea. Arquitetura de semicondutor que integra CPU, GPU e DSP e um mesmo chip. (cada vez mais comum)</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">HCA - Heterogenous Computing Architecture</td>
<td class="org-left">O mesmo que HSA</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">CPU - Central Processing Unit</td>
<td class="org-left">Unidade de Processamento Central</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">CPU Core</td>
<td class="org-left">Núcleo de processador</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">CPU Cache</td>
<td class="org-left">Cache ou cacho de CPU - memória embutida na CPU, buffer entre CPU e RAM, quanto maior o CPU cache melhor.</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">CPU socket</td>
<td class="org-left">Local para conectar chip de CPU na placa mãe (motherboard, logic board)</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Multicore CPU</td>
<td class="org-left">CPU de multiplos núcleos</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">MPU - Microprocessor Unit</td>
<td class="org-left">Unidade de micro processador</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">MCU - Microcontroller Unit</td>
<td class="org-left">Unidade de Microcontrolador</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">DSP - Digital Signal Processo</td>
<td class="org-left">Processador Digital de Sinais</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">FPU - Floating Point Unit</td>
<td class="org-left">Unidade de Ponto de Flutuante (co-processador matemático, hoje é embutido nas CPUs)</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">GPU - Graphics Processing Unit</td>
<td class="org-left">Unidade de Processamento Gráfico</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">iGPU - Integrated GPU</td>
<td class="org-left">GPU embutida no mesmo chip da CPU (SoC - System-On-Chip)</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">eGPU - Dediccated GPU</td>
<td class="org-left">GPU não embutidad em CPU disponível em placa com conexão para barramento (bus) PCI.</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">dGPU - External GPU</td>
<td class="org-left">GPU externa que pode ser conectada a laptops ou notebooks sem espaço para GPU dedicada.</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">TPU - Tensor Processing Unit</td>
<td class="org-left">Unidade de Processamento de Tensor (Introduzido por Google, ABC inc. para aceleração de  machine learning)</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">PLD - Programmable Logic Device</td>
<td class="org-left">Dispositivo Lógico Programável</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">ASIC - Application Specific Integrated Circuit</td>
<td class="org-left">Circuito Integrado de Aplicação Específica</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">FPGA - Field Programmable Gate Array</td>
<td class="org-left">CI programável usado para prototipar CPUs, GPUs, TPUs e criar ICs para aceleração de software em hardware.</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">MMU - Memory Management Unit (Virtual Memory)</td>
<td class="org-left">Unidade Gerenciamento de Memória - que provê memória virtual (virtual memory). Hoje todos processadores modernos tem MMU embutida.</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">RAM - Random Access Memory</td>
<td class="org-left">Memória de Acesso Aleatório, memório principal do computador</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">SRAM - Static RAM</td>
<td class="org-left">RAM estática</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">DRAM - Dynamic RAM</td>
<td class="org-left">RAM dinâmica</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">NVRAM - Non Volatile RAM</td>
<td class="org-left">RAM não volátil</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Hardware acceleration</td>
<td class="org-left">Aceleração em hardware</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">TTY - Teletywriter, teletype printer</td>
<td class="org-left">Impressora de telegrafos, primeiro terminal e dispositivo para uso interativo de computadores.</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">MEMS - Micro Electro-Mechanical Systems</td>
<td class="org-left">Sensores mecânicos como acelerômetros e giroscópios (mede aceleração angular) construídos como circuito integrado (IC)</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">MMIO - Memory Mapped IO (Input/Output) - (Embedded systems)</td>
<td class="org-left">Entrada/Saida mapeda em memória (sistemas embarcados / sistemas embutidos)</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">PMIO - Port-Mapped IO  - (Embedded systems)</td>
<td class="org-left">Entrada/Saída mapeda em porta   (sistemas embarcados / sistemas embutidos)</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Abstraction Layer</td>
<td class="org-left">Camada de abstração</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">HAL - Hardware Abstraction Layer</td>
<td class="org-left">Camada de abstração de hardware</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">TLS - Transport Layer Security</td>
<td class="org-left">Camada de segurança de transporte</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">SSL - Secure Socket Layer</td>
<td class="org-left">Camada de segurança de socket</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Network Layer   (network)</td>
<td class="org-left">Camada de rede</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Transport layer (network)</td>
<td class="org-left">Camada de transporte</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Storage layer</td>
<td class="org-left">Camada de armazenamento</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Sign in</td>
<td class="org-left">Logar, entrar com username e senha.</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Sign up</td>
<td class="org-left">Registrar-se pela primeira vez.</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">SSO - Single Sign On</td>
<td class="org-left">Autenticar única vez usando OIDC (Oauth2) ou SAML</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">OIDC - Open ID Connect Protocol (Oauth2)</td>
<td class="org-left">Protocolo para autenticação SSO construído em cima do Oauth2</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">SAML - Security Assertion Markup Language</td>
<td class="org-left">Protocolo de autenticação SSO usando XML</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Hosting</td>
<td class="org-left">Hospedagem</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Web Hosting</td>
<td class="org-left">Hospedagem Web</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">IAM - Identity and access management</td>
<td class="org-left">Gerenciamento de identidade e acesso</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">ACL - Access Control List</td>
<td class="org-left">Lista de Acesso de Controle</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">private key</td>
<td class="org-left">chave privada</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">public key</td>
<td class="org-left">chave pública</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">drop-in-replacement library</td>
<td class="org-left">bibliteca de software que é substituta de outra com mesma interface e ABI (Application Binary Interface)</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">HPC - High Performance Computing</td>
<td class="org-left">Computação de Alta Performance</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Numerical computing</td>
<td class="org-left">Computação numérica</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Scientific Computing</td>
<td class="org-left">Computação scientifica</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">PDE - Partial Differential Equation</td>
<td class="org-left">Equação diferêncial parcial</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">ODE - Ordinary Differential Equation</td>
<td class="org-left">Equação diferêncial ordinária</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">FEM - Finite Element Method</td>
<td class="org-left">Método de Elementos Finitos</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Frequency domain</td>
<td class="org-left">Domínio da frequência</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Control Theory</td>
<td class="org-left">Teoria de controle ou Teoria de Controlo</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">low pass filter</td>
<td class="org-left">filtro passa baixas</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">high pass filter</td>
<td class="org-left">filtro passa altas</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">CAD - Computer Aided Design</td>
<td class="org-left">Design/Projeto auxiliado por computador</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">CAM - Computer Aided Manufacturing</td>
<td class="org-left">Fabricação/Manufatur auxiliado por computador</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">machining shop (or workshop)</td>
<td class="org-left">oficina de usinagem</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">milling machine</td>
<td class="org-left">fresadora</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">drilling  machine</td>
<td class="org-left">furadeira ou máquina de furar</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">lathe</td>
<td class="org-left">torno (máquina ferramenta)</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">crane</td>
<td class="org-left">guindaste</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">conveyor belt</td>
<td class="org-left">esteira</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">pipeline</td>
<td class="org-left">tubulação</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">gas pipeline</td>
<td class="org-left">tubulação de gás</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">oil pipeline</td>
<td class="org-left">tubulação de petróleo</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">crude oil</td>
<td class="org-left">petróleo bruto, não refinado</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">oil rig</td>
<td class="org-left">plataforma de extração de petróleo</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">oil well</td>
<td class="org-left">poço de petróleo</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">oil derrick</td>
<td class="org-left">torre de perfuração de petróleo</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">oil refinary</td>
<td class="org-left">refinária de petróleo</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">pressure vessel</td>
<td class="org-left">vazo de pressão</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">pressure gauge</td>
<td class="org-left">medidor de pressão</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">boiler</td>
<td class="org-left">caldeira</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">heat exchanger</td>
<td class="org-left">trocador de calor</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">strain gauge</td>
<td class="org-left">extensômetro medidor de deformação</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">load cell</td>
<td class="org-left">célula de carga - medidor de força por deformação de mola ou sensor piezoelétrico</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">safety factor  (mechanical engineering)</td>
<td class="org-left">fator de segurança</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">safety margin  (mechanical engineering)</td>
<td class="org-left">margem de segurança</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">gearbox</td>
<td class="org-left">caixa de transmissão ou caixa de marchas para trocar torque por velocidade e vice-versa.</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><span class="underline">blueprint</span></td>
<td class="org-left">desenho técnico de engenharia</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">power grid</td>
<td class="org-left">rede elétrica</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">power plant</td>
<td class="org-left">planta/industria de "produção" de energia.</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">power supply</td>
<td class="org-left">fonte de tensão</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">switch mode power supply</td>
<td class="org-left">fonte de tensão chaveada</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">HVDC - High Voltage Direct Current</td>
<td class="org-left">Alta voltagem/tensão com corrente contínua</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">HVAC - High Voltage Alternate Current</td>
<td class="org-left">Alta voltagem/tensão com corrente alternada</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">HVAC - Heating, Ventilation, and Air Conditioning</td>
<td class="org-left">Aquecimento, Ventilação, e Ar condicionado</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">ICS - Industrial Control System</td>
<td class="org-left">Sistemas de Controle Industrial (usados em automação industrial - OT - Operational Technology)</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">PLC - Programmable Logic Controller</td>
<td class="org-left">Controlador Lógico Programável - computador industrial proprietário usado para automação industrial</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">RTU - Remote Terminal Unit</td>
<td class="org-left">Unidade de Terminal Remota</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">SCADA - Supervisory Control and Data Acquisition</td>
<td class="org-left">Sistema de Controle Supervisório e de Aquisição de dados - usado em industria de processos como industria quimica</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">DCS - Distributed Control System</td>
<td class="org-left">Sistema de Controle Distribuido</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">OPC - OLE for Process Control</td>
<td class="org-left">OLE (Object Linking and Embedding - Microsoft) para controle de processos - industry standard</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Fieldbus</td>
<td class="org-left">Barramento de controle industrial</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">network card</td>
<td class="org-left">placa de rede</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">video card</td>
<td class="org-left">placa de vídeo</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">sound card</td>
<td class="org-left">placa de som</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Manufacturing</td>
<td class="org-left">Industria de transformção ou fabricantes</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Computational methods</td>
<td class="org-left">Métodos computacionais</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Machine design</td>
<td class="org-left">Projeto de máquinas</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Embedded Systems</td>
<td class="org-left">Sistemas embarcados</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">IOT  - Internet Of Things</td>
<td class="org-left">Internet das Coisas</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">BOM - Bill Of Materials</td>
<td class="org-left">Lista de materiais</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Firmware</td>
<td class="org-left">software de sistemas embarcados</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">RTOS - Real Time Operating System</td>
<td class="org-left">Sistema operacional de tempo real como VxWorks, RTMES ou FreeRTOS</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">BSP - Board Support Package (RTOS)</td>
<td class="org-left">Pacote de suporte de placa. Device drivers de um RTOS para suporte a uma placa de desenvolvimento ou hardware.</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">SOC - System-On-Chip</td>
<td class="org-left">sistema no chip</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">RAM - Random Access Memory</td>
<td class="org-left">Memória de acesso aleatória</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">SRAM - Static Random Access Memory</td>
<td class="org-left">Memória de acesso aleatória estática</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">DRAM - Dynamic Random Access Memory</td>
<td class="org-left">Memória de acesso aleatória dinâmica</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">ROM - Read-Only Memory</td>
<td class="org-left">Memória de somente leitura</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">ECU - Engine Control Unit</td>
<td class="org-left">Unidade de Controle de Motor (computador usado em motores de carros)</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Off-the-shelf components</td>
<td class="org-left">Componentes já prontos disponíveis no mercado</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">COTS - Commercial-Off-the-shelf</td>
<td class="org-left">-</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">OEM - Original Equipment Manafacturer</td>
<td class="org-left">Fabricante de equipamento original</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">service life</td>
<td class="org-left">vida útil de equipamento</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">device service life</td>
<td class="org-left">vida útil de dispositivo</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">equipment service life</td>
<td class="org-left">vida útil de equipamento</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">spare parts</td>
<td class="org-left">Partes de reposiçao</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">maintenance</td>
<td class="org-left">manutenção</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">afermarket</td>
<td class="org-left">mercado de pós vendas, de partes de reposição e acessórios</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">repair</td>
<td class="org-left">reparo</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">MTTR - Mean Time to Repair</td>
<td class="org-left">Tempo Médio Para Reparo</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">MTBF - Mean Time Between Failures</td>
<td class="org-left">Tempo Médio Entre Falhas (métrica)</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">FMEA - Failure mode and effects analysis (Mechanical Engineering)</td>
<td class="org-left">Análise de modo e efeitos de falha</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">software bug</td>
<td class="org-left">falha/defeito/bug em software (programa de computador)</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">software glitch</td>
<td class="org-left">falha/defeito/bug em software</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">software design flaw</td>
<td class="org-left">falah/defeito/bug de design(projeto) de software</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">race condition</td>
<td class="org-left">condição de concorrência</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">race condition bug</td>
<td class="org-left">bug de condição de concorrência</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">bus</td>
<td class="org-left">barramento</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">event bus</td>
<td class="org-left">barramento de eventos</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">distributed event bus</td>
<td class="org-left">barramento de eventos distribuídos</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">PCI bus (Peripheral Component Interconect)</td>
<td class="org-left">barramento PCI (P)</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">USB bus (Universal Serial Bus)</td>
<td class="org-left">barramento serial universal</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">CAN bus (Controller Area Network)</td>
<td class="org-left">barramento CAN usado em sistemas embarcados automotivos</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">payload</td>
<td class="org-left">carga útil</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">WAN - Wide Area Network</td>
<td class="org-left">Rede de Área Ampla</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">LAN - Local Area Network</td>
<td class="org-left">Rede de Área Local</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">VLAN - Virtual Local Area Network</td>
<td class="org-left">Rede Virtual de Área Local</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">VPN - Virtual Private Network</td>
<td class="org-left">Rede Privada Virtual</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">VPC  - Virtual Private Cloud</td>
<td class="org-left">Nuvem Privada Virtual</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left"><b>Software Engineering</b> / <b>Programming-Related</b></td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">IT - Information Technology</td>
<td class="org-left">Tecnologia da Informação</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">OT - Operational Technology</td>
<td class="org-left">Tecnologia Operacional (sistemas embarcados e sistemas industriais)</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Loading</td>
<td class="org-left">Carregando</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Download</td>
<td class="org-left">Baixar</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Upload</td>
<td class="org-left">Subir</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">STEM - Science-Technology-Engineering-Mathematic</td>
<td class="org-left">Ciência-Tecnologia-Engenharia-Matemática</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Q&amp;A - Questions and Answers</td>
<td class="org-left">Perguntas e repostas</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">FAQ - Frequent Asked Questions</td>
<td class="org-left">Questões frequentemente perguntadas</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">boolean logic</td>
<td class="org-left">lógica boleana</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">fuzzy logic</td>
<td class="org-left">lógica nebulosa</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">separation of concerns</td>
<td class="org-left">separação de reponsabilidades</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">cross-cutting concerns</td>
<td class="org-left">reponsabilidades crusadas, responsabilidades de multiplos domínios como logging.</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">development environment</td>
<td class="org-left">ambiente de desenvolvimento</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">IDE - Integrated Development Environment</td>
<td class="org-left">ambiente de desenvolvimento integrado</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">devops == development + operations</td>
<td class="org-left">cultura de desenvolvimento e operações compartilhada por um time ou equipe.</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">SRE - Site Reliability Engineer</td>
<td class="org-left">Engenheiro de confiabilidade de site (Administrador de sistemas)</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">run a company</td>
<td class="org-left">operar uma empresa</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">run a business</td>
<td class="org-left">operar um negócio</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">run a website</td>
<td class="org-left">operar um website ou sítio web</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">run a software, run an application</td>
<td class="org-left">rodar um software, operar um software</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">website under construction</td>
<td class="org-left">website em construção</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">software release</td>
<td class="org-left">lançamento de software</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">software release cycle</td>
<td class="org-left">ciclo de lançamento de software</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">rolling release cycle</td>
<td class="org-left">ciclo de lançamento contínuo</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">LTS - Long Term Support</td>
<td class="org-left">Suporte de longo prazo</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">programming language</td>
<td class="org-left">linguagem de programação</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">low level programming language</td>
<td class="org-left">linguagem de programação de baixo nível</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">high level programming language</td>
<td class="org-left">linguagem de programação de alto nível</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">assembly programming language</td>
<td class="org-left">linguagem de programação de montagem (código de máquina)</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">scientific programming language</td>
<td class="org-left">linguagem de programação científica; como Fortran, Matlab, Octave, Julia, Scilab (Inria)</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">system programming language</td>
<td class="org-left">linguagem de programação de sistemas; como C, C++, Rust</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">visual programming language</td>
<td class="org-left">linguagem de programação de visual como ladder usada em PLCs (Programmable Logic Controllers)</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">markup programming language</td>
<td class="org-left">linguagem de programação de marcação ou formatação como XML, html, css e etc.</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">DSL - domain specific language</td>
<td class="org-left">linguagem de programação de domínio específico; exemplo SQL, Regex, html, xml</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">API - Application Programming Interface</td>
<td class="org-left">Interface de Programaçao de Aplicação</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">ABI - Application Binary Interface</td>
<td class="org-left">Interface de Binária de Aplicação</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Type System</td>
<td class="org-left">Sistema de Tipos (tipagem)</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Static Type System</td>
<td class="org-left">Sistema de Tipos Estático (exemplo: C++, C, Java)</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Dynamic Type System</td>
<td class="org-left">Sistema de Tipos Dinâmicos</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">ISA  - Instruction Set Architecture</td>
<td class="org-left">Conjuto de Instruções de Arquitetura</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">OTA  - Over the Air update (mobile and embedded systems)</td>
<td class="org-left">Atualização automática de sistema ou firmware pela rede sem intervenção de usuário</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">control flow</td>
<td class="org-left">fluxo de controle</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">workflow</td>
<td class="org-left">fluxo de trabalho, fluxo de funcionamento</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">wrapper</td>
<td class="org-left">encapsulamento</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">FFI - Foreign Function Interface</td>
<td class="org-left">Interface de Função Extrangeira</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">memory allocation</td>
<td class="org-left">alocação de memória</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">memory leak</td>
<td class="org-left">vazamento de memória</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">memory fragmentation</td>
<td class="org-left">fragmentação de memória</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">SSR app (Server-Side-Rendered)</td>
<td class="org-left">Página redenizada no servidor (tradicional)</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">SPA app (Single Page Web Application)</td>
<td class="org-left">Aplicação web de uma única página</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">static web page</td>
<td class="org-left">Página web estática sem lado do servidor</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">SEO - Search Engine Optimization</td>
<td class="org-left">Optimização de motor de busca.</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">REST (Representational State Transfer) API</td>
<td class="org-left">API Rest</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">body of knowledge</td>
<td class="org-left">corpo de conhecimento</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">technical standard</td>
<td class="org-left">padrão técnico</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">standardization body</td>
<td class="org-left">comitê de padronização</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">standardization comitee</td>
<td class="org-left">comitê de padronização</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">reference implementation</td>
<td class="org-left">implementação de referência (primeira implementação de um padrão técnico - OpenSSL)</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">legacy systems</td>
<td class="org-left">sistemas legados (software antigo)</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">legacy software</td>
<td class="org-left">software legado (antigo)</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">greenfield software</td>
<td class="org-left">software ou programa a ser desenvolvidos sem restrições de tecnologias legadas (antigas).</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">greenfield project</td>
<td class="org-left">projetos com tecnologias não legadas.</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">in-house software</td>
<td class="org-left">software desenvolvido internamente</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">home grown software</td>
<td class="org-left">software desenvolvido internamente</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">software development</td>
<td class="org-left">desenvolvimento de software</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">software testing</td>
<td class="org-left">teste de software</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">proprietary software</td>
<td class="org-left">programa proprietário</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">closed source software</td>
<td class="org-left">programa(s) de código fechado</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">OSS - Open Source Software</td>
<td class="org-left">programa(s) de código aberto</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">FOSS - Free and Open Source Software</td>
<td class="org-left">programa livre e de código aberto</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">network interface</td>
<td class="org-left">interface de rede</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">No warranty</td>
<td class="org-left">sem garantias</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">SDK - Software Development Kit</td>
<td class="org-left">Kit de desenvolvimento de software</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">database</td>
<td class="org-left">banco de dados</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">document database</td>
<td class="org-left">banco de dados de documento (exemplo: MongoDB)</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">in-memory database</td>
<td class="org-left">banco de dados em memória (exemplo: Redis)</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">relational database</td>
<td class="org-left">banco de dados relacional (examplo: Postgres, MySQL, Microsoft SQL Server)</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">SQL - Structured Query Language</td>
<td class="org-left">Linguagem de Consulta Estruturada (usada para consultar banco de dados)</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">to query a database</td>
<td class="org-left">consultar um banco de dados</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">RDBMS - Relational Database Management System</td>
<td class="org-left">Sistema de gerenciamento de banco de dados relacional</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">DMBS - Database Management System</td>
<td class="org-left">Sistema de gerenciamento de banco de dados</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Database column</td>
<td class="org-left">Coluna de banco de dados</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Database table</td>
<td class="org-left">Tabela de banco de dados</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Database record</td>
<td class="org-left">registro ou entrada de banco de dados (row ou linha)</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">http protocol methods</td>
<td class="org-left">método do protocolo http</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">http protocol headers</td>
<td class="org-left">cabeçalhos do protocolo http</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">http protocol request</td>
<td class="org-left">requisição do protocolo http</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">http protocol response</td>
<td class="org-left">resposta do protocolo http</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">http protocol authentication</td>
<td class="org-left">autenticação no protocolo http</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">http protocol authorization</td>
<td class="org-left">autorização no protocolo http</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">uppercase text</td>
<td class="org-left">texto maiúsculo</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">lowercase text</td>
<td class="org-left">texto minúsculo</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">source code</td>
<td class="org-left">código fonte</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">object code</td>
<td class="org-left">código objeto (código de máquina, compilado)</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">header files</td>
<td class="org-left">arquivos de cabeçalho (arquivos *.h ou *.hpp em C ou C++)</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">building system</td>
<td class="org-left">sistema de compilação ou sistema de automação de compilação</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">breaking change</td>
<td class="org-left">mudança disruptiva</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">backward compatibility</td>
<td class="org-left">compatibilidade reversa</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">forward compatibility</td>
<td class="org-left">compatibilidade futura</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">future-proof</td>
<td class="org-left">a prova futura - sistema projeto para acomador novos casos sem mudanças disruptivas.</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">loose coupling</td>
<td class="org-left">acoplamento frouxo</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">tight coupling</td>
<td class="org-left">acoplamento apertado</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">DIY - Do It Yourself</td>
<td class="org-left">Faça Você Mesmo</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">DRY - Don't Repeat Yourself</td>
<td class="org-left">Não repita a si mesmo</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">convention over configuration</td>
<td class="org-left">Convenção sobre configuração - padrão de design usado por Ruby-On-Rails e Django web frameworks.</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">KISS - Keep It Simple</td>
<td class="org-left">Mantenha isso simples</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">eat your own dog food - <span class="underline">dogfooding</span> (Microsoft)</td>
<td class="org-left">ditado: coma sua própria ração de cachorro (use o produto que criou da própria empresa)</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Explicit is better than implicit (Python moto)</td>
<td class="org-left">Explicito é melhor que implicito.</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">NIH - Not Inveted Here syndrome</td>
<td class="org-left">Sindrome: Não inventado aqui. (reiventar a roda somente porque não foi criado localmente)</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">YAGNI - You Ain't Gonna Need It</td>
<td class="org-left">ditado: Você não vai precisar disto (NO OVERENGINEERING)</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Do not reivent the wheel</td>
<td class="org-left">Não reivente a roda</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">think out of the box</td>
<td class="org-left">pensar fora da caixa, de modo não convencional.</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Get things done</td>
<td class="org-left">Fazer as coísas, entregar resultados</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">walled garden</td>
<td class="org-left">Jardim murado - ecosistema fechado, totalmente controlado pela empresa, como Apple app store.</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Just works (apple slogan)</td>
<td class="org-left">"Apenas funciona" (frase popularizada pela Apple)</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">move fast and break things (Facebook slogan)</td>
<td class="org-left">Mova rápido e quebre as coisas =&gt;&gt; significa disrupção, disruption.</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">If it ain't broke, don't fix it.</td>
<td class="org-left">Se está quebrado, não conserte. =&gt;&gt; Não modifique o que funciona.</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Software is eating the world</td>
<td class="org-left">O software está comendo/engolindo o mundo</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">It is a feature, not a bug</td>
<td class="org-left">Isso é um recurso/funcionalidade, não um defeito.</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Do not rely on implementation details</td>
<td class="org-left">Não se baseie em detalhes de implementação</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">It is a privilege, not a right</td>
<td class="org-left">Isto é um privilégio, não um direito</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Search Engine</td>
<td class="org-left">Motor de busca</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">SEO - Search Engine Optimization</td>
<td class="org-left">Optimização de motor de busca</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">features</td>
<td class="org-left">caracteristicas ou recursos</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">easy-of-use</td>
<td class="org-left">facilidade de uso</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">DX - Developer Experience</td>
<td class="org-left">Experiência de desenvolvedor com API ou SDK</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">UX - User Experience</td>
<td class="org-left">Experiência de usuário (relacionado a interface gráfica, frontend)</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">UI - User Interface</td>
<td class="org-left">Interface de usuário</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">CLI - Command Line Interface</td>
<td class="org-left">Interface de Linha de Comando</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">TUI - Terminal User Interface</td>
<td class="org-left">Interface de Usuário em Terminal. Exemplos: vim, emacs</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">GUI - Graphical User Interface</td>
<td class="org-left">Interface Gráfica de Usuário</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Keyboard Driven Interface</td>
<td class="org-left">Interface dirigida por teclado</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">HMI - Human Machine Interface</td>
<td class="org-left">Interface Homem Máquina</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">REPL - Read-Print-Eval-Loop</td>
<td class="org-left">Ler-Imprime-Avaliar-Laço(Loop) - exemplo: Python, Ruby, Matlab REPL</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">UAV - Unmmaned Aerial Vehicle (drone)</td>
<td class="org-left">VANT - Veículo Aéreo Não Tripulado</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">VTOL - Vertical Take Off &amp; Landing</td>
<td class="org-left">Decolagem vertical e pouso vertical</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">ROV - Remotely Operated Vehicle</td>
<td class="org-left">VOR - Veículo Operado Remotamente</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">INS - Innertial Navigation System</td>
<td class="org-left">Sistema de Navegação Inercial</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">IMU - Innertial Measurement Unit</td>
<td class="org-left">Unidade de Medição Inercial</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Innertial Platform</td>
<td class="org-left">Plataform Inercial</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Control surface</td>
<td class="org-left">superfície de controle</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Space probe</td>
<td class="org-left">sonda espacial</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">keyboard</td>
<td class="org-left">teclado</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">keyboard shortcuts</td>
<td class="org-left">atalhos de teclado</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">keybind</td>
<td class="org-left">combinação de teclas</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">keystroke</td>
<td class="org-left">digitar uma tecla</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">keyboard layout</td>
<td class="org-left">layout/formato de teclado</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">query keyboard layout</td>
<td class="org-left">teclado com layout query</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">devorak keyboard layout</td>
<td class="org-left">teclado com layout devorak</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">colemake keyboard layout</td>
<td class="org-left">teclado com layout colemake</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">uptime</td>
<td class="org-left">tempo que o serviço ou máquina está operando</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">downtime</td>
<td class="org-left">tempo que o serviço ou máquina está parado devido a falha, manutenção ou bug.</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">compliance</td>
<td class="org-left">conformidade</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">regulatory compliance</td>
<td class="org-left">conformidade a regulamentação</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">industry regulations</td>
<td class="org-left">regulamentação de setor</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">industry standard</td>
<td class="org-left">padrão do setor (Nota: industria em EN é manufacturing)</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">industry standard tooling</td>
<td class="org-left">ferramentas padrão do setor</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">redundancy</td>
<td class="org-left">redundância</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">reliability</td>
<td class="org-left">confiabilidade</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><span class="underline">availability</span></td>
<td class="org-left">disponibilidade</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">high availability</td>
<td class="org-left">alta disponibilidade</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><span class="underline">fault tolerance</span></td>
<td class="org-left">tolerância a falhas</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">fault tolerant</td>
<td class="org-left">tolerante a falhas</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">single point of failure</td>
<td class="org-left">único ponto de falha</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">distributed systems</td>
<td class="org-left">sistemas distribuidos</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">capacity planning</td>
<td class="org-left">planejamento de capacidade de sistema de backend</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">scalability</td>
<td class="org-left">escalabilidade - aumentar capacidade do sistema para suportar maior tráfego de rede.</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">vertical scaling    (escalamento vertical)</td>
<td class="org-left">aumentar capaciade de CPU, disco, memória de um servidor para suportar maior tráfego e carga.</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">horizontal scaling  (escalamento horizontal)</td>
<td class="org-left">rodar multiplas réplicas de um mesmo servidor para tolerância a falhas e suportar maitor tráfego de rede.</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">microservices</td>
<td class="org-left">microserviços</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">memory</td>
<td class="org-left">memória</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">storage</td>
<td class="org-left">armazenamento</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">cpu time</td>
<td class="org-left">tempo de uso de CPU</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">cpu cores</td>
<td class="org-left">número de núcleos de CPU</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">bandwidth</td>
<td class="org-left">quantidade de dados transferido</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">bandwidth</td>
<td class="org-left">largura de banda (em engenharia eletrônica)</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">dedicated server</td>
<td class="org-left">servidor físico (não VPS ou virtualizado como AWS EC2) na cloud ou em data center próprio</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">server colocation</td>
<td class="org-left">hardware servidor próprio hospedado em espaço alugado de data center</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">VPS - Virtual Private Server hosting</td>
<td class="org-left">Servidor Privado Virtual (máquina, computador virtual hospedado na nuvem)</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">web server</td>
<td class="org-left">servidor web</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">web hosting</td>
<td class="org-left">hospedagem web</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">shared hosting</td>
<td class="org-left">hospedagem compartilhada</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">server load</td>
<td class="org-left">carga no servidor</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">IOPS - IO per second</td>
<td class="org-left">Entrada/Saída por segundo</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">load balancer</td>
<td class="org-left">balanceador de carga</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">workload</td>
<td class="org-left">carga de trabalho</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">network traffic</td>
<td class="org-left">tráfego de rede</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">network infrastructure</td>
<td class="org-left">infraestrutura de rede</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">inbound network traffic</td>
<td class="org-left">tráfego de rede vindouro (que entra)</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">outbound network traffic</td>
<td class="org-left">tráfego de rede sumidouro (que sai)</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">ISP - Internet Service Provider</td>
<td class="org-left">provedor de serviço de internet</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">http - Hyper Text Transfer protocol</td>
<td class="org-left">protocolo de transferência de hiper texto</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">ftp (file transfer protocol)</td>
<td class="org-left">servidor ftp (protocolo de transferência de arquivo)</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">CI - Continuous Integration (devops)</td>
<td class="org-left">Integração Contínua</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">CD - Continuous Delivery    (devops)</td>
<td class="org-left">Entrega contínua</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">cloud computing</td>
<td class="org-left">computação na nuvem</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">cloud providers</td>
<td class="org-left">provedores de serviços de computação na nuvem</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">CDN - Content Delivery Network</td>
<td class="org-left">Rede de entrega/distribuíção de conteúdo</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">SLA - Service Level Agreement</td>
<td class="org-left">Contrato de Nível de Serviço</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">QoS - Quality of Service</td>
<td class="org-left">Qualidade de Serviço</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">QA - Quality Assurance</td>
<td class="org-left">Garantia de Qualidade</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><span class="underline">managed service</span></td>
<td class="org-left">serviço gerenciado disponível como uma API como banco de dados (database)</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">object storage service</td>
<td class="org-left">serviço gerenciado (managed service) de armazenamento de objetos (dados não estruturados) como AWS-S3</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">self hosting</td>
<td class="org-left">auto hospedagem</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">on premises hosting</td>
<td class="org-left">hospedagem na infraestrutura ou data center da própria empresa (não na cloud - nuvem como AWS ou GCP e etc.)</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">colocation hosting</td>
<td class="org-left">hospedagem com hardware proprio em espaço alugado (rented) de data center (centro de dados)</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#x2026;. AS A SERVICE</td>
<td class="org-left">&#x2026; como serviço</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">SAAS - Software As A Service</td>
<td class="org-left">Software Como Serviço</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">BAAS - Backend As A Service</td>
<td class="org-left">Backend Como Serviço</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">PAAS - Platform As A Service</td>
<td class="org-left">Plataforma Como Serviço</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">FAAS - Function As A Service</td>
<td class="org-left">Função como Serviço</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">IAAS - Infrastructure As A Service</td>
<td class="org-left">Infrastrutura Como Serviço</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">KAAS - Kubernetes A A Service</td>
<td class="org-left">Kubernetes como serviço, kubernetes managed service - (Exemplo: GKE - Google Kubernetes Engine)</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">IAC - Infrastruture As Code</td>
<td class="org-left">Infrastrutura Como Código (Exemplo: Docker, docker swarm, kubernetes, terraform)</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">automated testing</td>
<td class="org-left">teste automático</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">manual testing</td>
<td class="org-left">teste manual</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">software testing</td>
<td class="org-left">teste de software</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">unit testing</td>
<td class="org-left">teste unitário</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">regression testing</td>
<td class="org-left">teste de regressão</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">acceptance testing</td>
<td class="org-left">teste de aceitação</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">integration testing</td>
<td class="org-left">teste de integração</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">A/B testing</td>
<td class="org-left">teste A/B com variantes aleatórias de interface gráfica, sites e etc.</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">hardware-in-the-loop (HIL) testing</td>
<td class="org-left">teste de hardware no loop (laço) para sistemas embarcados.</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">LEMP stack</td>
<td class="org-left">Linux-Nginx-MySQL-PHP</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">LAMP stack</td>
<td class="org-left">Linux-Apache-MySQL-PHP</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">WAMP stack</td>
<td class="org-left">Windows-Apache-MySQL-PHP</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">WIMP stack</td>
<td class="org-left">Windows-IIS web server-MySQL-PHP</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">MEAN stack</td>
<td class="org-left">MongoDB + ExpressJS + Angular + NodeJS</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">MEVN stack</td>
<td class="org-left">MongoDB + ExpressJS + ReactJS + NodeJS</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">MERN stack</td>
<td class="org-left">MongoDB + ExpressJS + ReactJS + Nodejs</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Python shop</td>
<td class="org-left">empresa que usa Python - Nota: shop também pode ser abreviação de workshop (oficina)</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">C++ shop</td>
<td class="org-left">empresa que usa C++  (C++ workshop)</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Java shop or Java workshop.</td>
<td class="org-left">empresa que usa Java (Java workshop)</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">PEP - Python Enhancement Proposal</td>
<td class="org-left">Proposta de Melhoria do Python</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">JEP - Java Enhancement Proposal</td>
<td class="org-left">Proposta de Melhoria do Java</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">gui builder</td>
<td class="org-left">construtor de interfaces gráficas</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">drag-and-drop</td>
<td class="org-left">arrastar e soltar</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">pick-and-place</td>
<td class="org-left">pegar e colocar/posicionar</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">low code</td>
<td class="org-left">baixo código =&gt; ferramentas que permitem criar aplicações graficamente com drag-drop ou pick-and-place. (no programming)</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">turnkey solution</td>
<td class="org-left">solução/tecnologia imediatamente pronta para uso</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">CSV - Comma Separated Value file</td>
<td class="org-left">Formato de arquivos CSV (Valores separados por virgula)</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">JSON - Javascript Object Notation file</td>
<td class="org-left">Notação de objeto de Javascript</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Text file</td>
<td class="org-left">arquivo de texto</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Binary file</td>
<td class="org-left">arquivo binário</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">dependency hell</td>
<td class="org-left">inferno das dependências</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">fragmentation hell</td>
<td class="org-left">inferno da fragmentação. Exemplos: gerenciamento de pacotes do Linux, multiplas versões do Android.</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">DLL hell</td>
<td class="org-left">inferno das DLLs (dependency hell no windows)</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Jar hell</td>
<td class="org-left">infernos dos Jars (dependency hell no Java)</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">opt-in (not enabled by default)</td>
<td class="org-left">Não habilitado (ativado) por padrão, o usuário que tem de habilitar manualamente.</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">out-out (enabled by default)</td>
<td class="org-left">Habilitado (ativado) por padrão, o usuário que tem de desabilitar manualmente.</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">opt-in telemetry</td>
<td class="org-left">Telemetria não habilitada por padrão, mas pode ser habilidata manualmente.</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">opt-out telemetry</td>
<td class="org-left">Telemetria habiltada por padrão, mas pode ser desabilitada manualmente. (Maioria dos casos)</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">free trial</td>
<td class="org-left">experimente/teste grátis</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">CRUD(S) - Create-Read-Update-Delete + Search (database)</td>
<td class="org-left">Cria (Create)-Ler (Read)-Atualizar(Update)-Deletar (Delete) + Pesquisar (Search)</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">ACID - Atomicity + Consitency + Isolation + Durability (database)</td>
<td class="org-left">Atomicidade + Consitência + Isolação + Durabilidade</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">onboarding</td>
<td class="org-left">integrar um novo funcionário a empresa</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">playbook</td>
<td class="org-left">manual contendo políticas da empresa, fluxos de trabalho (workflows) e procedimentos (procedures).</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">handbook</td>
<td class="org-left">manual</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">runbook</td>
<td class="org-left">livro de rotinas e procedimentos seguida por operadores do sistema ou administradores de sistema.</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">logbook</td>
<td class="org-left">livro de registro de eventos (exigido legalmente)</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">outdated</td>
<td class="org-left">defasado, ultrapassado(a) / obsoleto(a)</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">deprecated</td>
<td class="org-left">descontinuado</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">descontinued</td>
<td class="org-left">descontinuado</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">legacy technology</td>
<td class="org-left">tecnologia legada (ultrapassada, antiga)</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><span class="underline">CRM</span> - Customer Relationship Management system</td>
<td class="org-left">Sistema de gerenciamento de relacionamento com o cliente</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><span class="underline">CMS</span> - Content Management System</td>
<td class="org-left">Sistema de gerenciamento de conteúdo - exemplo: Wordpress, Wikis.</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><span class="underline">ERP</span> - Enterprise Resource Planning</td>
<td class="org-left">Sistema de gerenciamento de empresa/negócio</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><span class="underline">LOB</span> - Line of business software</td>
<td class="org-left">Software/Programa de gerenciamento de empresa/negócio</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left"><b>Education</b></td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">ESL - English as a Second Language</td>
<td class="org-left">Inglês como segunda língua</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">ELF - English as a (international) lingua-franca</td>
<td class="org-left">Inglês como lingua-franca internacional</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">MTI - Mother Tongue Influence</td>
<td class="org-left">Influência da língua materna</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Overcome language barriers</td>
<td class="org-left">Superar barreiras linguísticas</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Study abroad</td>
<td class="org-left">Estudar no exterior</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Learn English</td>
<td class="org-left">Aprender Inglês</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Learn a foreign language</td>
<td class="org-left">Aprender uma língua extrangeira</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">English as language of Instruction</td>
<td class="org-left">Inglês como língua de instrução, língua/idioma de ensino</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">English as language of international education</td>
<td class="org-left">Inglês como língua a educação internacional</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">English as a langauge of business and finance</td>
<td class="org-left">Inglês como linguagem dos negócios e finanças</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">English as the lingua franca of the international trade</td>
<td class="org-left">Inglês como língua franca do comércio internacional</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">English as a language of international tourism</td>
<td class="org-left">Inglês como linguagem do turismo internacional</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">English as a language of international communication</td>
<td class="org-left">Inglês como língua de comunicação internacional</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">English as language of diplomacy</td>
<td class="org-left">Inglês como língua da diplomacia</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">English as the language of science and technology</td>
<td class="org-left">Inglês como língua da ciência e tecnológia</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">English as the lingua franca of air traffic control</td>
<td class="org-left">Inglês como língua franca do controle de trafego aéreo</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">English has one of the highest information density</td>
<td class="org-left">Inglês tem uma das maiores densidades de informação</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Native English speaker</td>
<td class="org-left">Falante de inglês nativo</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Native Spanish speaker</td>
<td class="org-left">Falante de espanhol nativo</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Spanish as second language</td>
<td class="org-left">Espanhol como segunda língua</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Spanish as third language</td>
<td class="org-left">Espanhol como terceira língua</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Spanish as LATAM lingua franca</td>
<td class="org-left">Espanhol como língua franca da America Latina</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Native foreign language speaker</td>
<td class="org-left">Falante nativo de lingua estrangeira</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Foreign Language</td>
<td class="org-left">Língua ou idioma estrangeiro</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Foreign Language Skills</td>
<td class="org-left">Habiliade de língua ou idioma estrangeiro</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Learn a foreign language</td>
<td class="org-left">Aprender uma língua estrangeira</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Anglophones</td>
<td class="org-left">Falantes de inglês</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Francophones</td>
<td class="org-left">Falantes de francês</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Hispanophones</td>
<td class="org-left">Falantes de espanhol</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Lusophones</td>
<td class="org-left">Falantes de português</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">vocational education</td>
<td class="org-left">ensino técnico ou profissionalizante (technial school, vocational school, community college)</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">higher education</td>
<td class="org-left">ensino superior, ensino universitário</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">university</td>
<td class="org-left">universidade</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">international university</td>
<td class="org-left">universidade que usam inglês como língua de instrução mas são de lugares sem o inglês como idioma nativo.</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">college (USA)</td>
<td class="org-left">universidade</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">college enrollment</td>
<td class="org-left">matricula em universidade</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">college student (USA)</td>
<td class="org-left">estudante universitário</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">university student (USA)</td>
<td class="org-left">estudante universitário</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">college application</td>
<td class="org-left">se inscrever em processo seletivo de universidade ou se candidatar a universidade</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">apply to college</td>
<td class="org-left">se inscrever em processo seletivo ou se candidatar a universidade</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">college degree</td>
<td class="org-left">grau universitário, ter curso superior</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">university degree</td>
<td class="org-left">grau unviersitário</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">submit application</td>
<td class="org-left">enviar inscrição</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">undergraduate student</td>
<td class="org-left">estudante com ensino superior incompleto. (cursando ensino superior)</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Foreign student</td>
<td class="org-left">estudante estrangeiro</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">international student</td>
<td class="org-left">estudante internacional</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">graduate student</td>
<td class="org-left">estudante de pós graduação - estudando mestrado, doutorado ou pós-doutorado -PHD</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">self taught student</td>
<td class="org-left">estudante autodidata</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Freshman student (First-Year College Student)</td>
<td class="org-left">Estudante universitário do primeiro ano (undergraduate)</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Sophomore student (Second-Year College Student)</td>
<td class="org-left">Estudante universitário de segundo ano (undergraduate)</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Junior student   (Third-Year College Student)</td>
<td class="org-left">Estudante universitário de terceiro ano (undergraduate)</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Senior student   (Foirth-Year College Student)</td>
<td class="org-left">Estudante universitário a partir do quarto ano.</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">dean</td>
<td class="org-left">reitor ou reitora</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">professor</td>
<td class="org-left">professor títular de universidade (que tem cátedra, não confundir com "teacher", professor de ensino médio)</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">role model</td>
<td class="org-left">exemplo (ser exemplo) - pessoa seguida por outras como exemplo ou inspiração</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">researcher</td>
<td class="org-left">pesquisador(a)</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">classmates</td>
<td class="org-left">colegas de classe</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">classroom</td>
<td class="org-left">sala de aula</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">MBA - Master of Business Administration</td>
<td class="org-left">Mestrado em administração de negócios</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">MSC - Master of Science</td>
<td class="org-left">Mestrado em área científica</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Minor (USA)</td>
<td class="org-left">Área de sub-especialização de curso de graduação, como computer science.</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Major (USA)</td>
<td class="org-left">Área de especilização do curso de graduação escolhida pelo aluno, como fisíca. No Brasil não existe Minor e Major, somente nos EUA e Filipinas.</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Double Major (USA)</td>
<td class="org-left">Se formar com duas áreas especialização, equivalente a dois cursos superiores simultâneos.</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Human Capital</td>
<td class="org-left">Capital Humano</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><span class="underline">STEM</span> - Science, Technology, Engineering, Math</td>
<td class="org-left">Ciência, Tecnologia, Engenharia, Matemática</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Bachelor of Science in Electrical Engineering</td>
<td class="org-left">Graduação em engenharia elétrica/eletrotecnica ou eletrônica</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Bachelor of Science in Mechanical Engineering</td>
<td class="org-left">Graduação em engenharia mecânica</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Bachelor of Science in Chemical Engineering</td>
<td class="org-left">Graduação em engenharia química</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Bachelor of Science in Physics</td>
<td class="org-left">Graduação em física</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Computer Science</td>
<td class="org-left">Ciência da computação</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Network engineer</td>
<td class="org-left">Técnico de/em redes =&gt; Nota: "engineer" em inglês pode significar 'técnico', não necessariamente significa ter curso superior.</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Software engineer</td>
<td class="org-left">Técnico/programador/desenvolvedor de software</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Database engineer</td>
<td class="org-left">Técnico/programador/desenvolvedor de banco de dados.</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">liberal arts (terminology comes from Medieval universities)</td>
<td class="org-left">artes liberais =&gt; Ciências humanas e humanidades, incluindo, econômia, contabilidade, direito (law school) &#x2026;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">humanities</td>
<td class="org-left">cursos de humanidades - inclui literatura, filosofia, direito e etc.</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">trivium (from seven liberal arts - medieval universities)</td>
<td class="org-left">grammar (gramática), logics (lógica) and rethorics (retórica) - 3 das 7 artes liberais - vem de universidades medievais</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Law school</td>
<td class="org-left">univerisdade de direito</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Business School</td>
<td class="org-left">universidade de negócios/administração de empresas (escola de administração)</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">lecture / classes</td>
<td class="org-left">aula/palestra</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">keynote</td>
<td class="org-left">apresentação/palestra</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">workshop</td>
<td class="org-left">oficina/curso ou palestras</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">tuition fee</td>
<td class="org-left">taxa de instrução que se paga no fim do ano em universidades da America do Norte</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">scholarship</td>
<td class="org-left">Bolsa de estudos</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">internship</td>
<td class="org-left">Estágio</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">intern at COMPANY</td>
<td class="org-left">estágio em empresa</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">mentorship</td>
<td class="org-left">mentoria, orientação</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">studente exchange program</td>
<td class="org-left">programa de intercâmbio</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">alumni</td>
<td class="org-left">associação de alunos</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">mindset</td>
<td class="org-left">mentalidade</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">skill</td>
<td class="org-left">habilidades</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">leadership skill</td>
<td class="org-left">habilidade de liderança</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">hard skills</td>
<td class="org-left">habilidades técnicas adquiridas por educação formal e estudo</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">soft skills (people skills)</td>
<td class="org-left">habilidades sociais e interpessoais</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">research skills</td>
<td class="org-left">habilidades de pesquisa</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">skillset</td>
<td class="org-left">conjunto habilidades</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">transferable skills</td>
<td class="org-left">habilidades transferíveis</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">team work</td>
<td class="org-left">trabalho em equipe</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">research</td>
<td class="org-left">pesquisa</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">research field</td>
<td class="org-left">campo de pesquisa</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">basic research, pure research</td>
<td class="org-left">pesquisa básica, desinteressada de ganhos imediatos.</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">academic freedom</td>
<td class="org-left">liberdade acadêmica</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">critical thinking</td>
<td class="org-left">pensamento crítico</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">curiosity</td>
<td class="org-left">curiosidade</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">free exchange of ideas</td>
<td class="org-left">livre troca de ideias</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">confront of ideas</td>
<td class="org-left">confronto de ideias</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">exchange of knowledge</td>
<td class="org-left">troca de conhecimento</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">think out of the box</td>
<td class="org-left">pensar fora da caixa, pensar de modo não convencional.</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">GPA - Grade Point Average</td>
<td class="org-left">Nota média</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Test score</td>
<td class="org-left">Nota em teste/prova/exame</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Real world problems</td>
<td class="org-left">Problemas do mundo real</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><span class="underline">TOEFL</span> test (English assesment test)</td>
<td class="org-left">Teste de proficiência em inglês exigido por universidades Americanas. (American English)</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><span class="underline">IELTS</span> test (English assesment test)</td>
<td class="org-left">Teste de proficiência em inglês exigido por universidades Inglesas, Canadenses e Australianas.</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><span class="underline">TestDaF</span> test - German assesment test (Goethe Institut)</td>
<td class="org-left">Teste de proficiência em Alemão para estudar em Alemanha, Austria ou Suíça.</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">DILF test - French (Diplôme Initial de Langue Française)</td>
<td class="org-left">Teste de proficiência em Francês exigido na França (similar ao TOEFL)</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">DELF test - Frech (Diplôme d’Etudes en Langue Française)</td>
<td class="org-left">(Francês) - Similar ao DELF</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">DALF test - French (Diplôme Approfondi de Langue Française)</td>
<td class="org-left">(Francês) - Similar ao DELF</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">TFI test - French ( Test de Français International)</td>
<td class="org-left">(Francês) - Similar ao DELF, usado em Quebec</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><span class="underline">SIELE</span> test - Spanish proficiency test (Cervantes Instute)</td>
<td class="org-left">Teste de proficiência em Espanhol (similar ao TOEFL)</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><span class="underline">DELE</span> test - Spanish proficiecy test (Spain)</td>
<td class="org-left">Teste de proficiência em Espanhol (similar ao SIELE)</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">Nota: Muitas universidades no mundo, Europa e Asia (excluindo Reino Unido ou Irlanda) usam inglês como língua de instrução e exigem IELTS ou TOEFL.</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><span class="underline">CEFR</span></td>
<td class="org-left"><span class="underline">Common European Framework of Reference for Language</span></td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">GMAT - Graduate Management Admission Test</td>
<td class="org-left">Teste exigido por programas de pós graduação e MBA</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">GRE - Graduate Record Examination</td>
<td class="org-left">Similar ao GMAT</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">American Spelling</td>
<td class="org-left">ortografía Americana</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">British Spelling</td>
<td class="org-left">ortografía Británica</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">knowledge</td>
<td class="org-left">conhecimento</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">wisdom</td>
<td class="org-left">sabedoria</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">domain knowledge</td>
<td class="org-left">conhecimento de domínio</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">domain expert</td>
<td class="org-left">especialista de domínio</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">learn by doing</td>
<td class="org-left">aprender fazendo</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">learn from mistakes</td>
<td class="org-left">aprender com os erros</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">learn from other people mistakes</td>
<td class="org-left">aprender com os erros de outras pessoas</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><span class="underline">school of thought</span></td>
<td class="org-left">escola de pensamento (comum em ciências humanas - liberal arts como economia)</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">ceteris paribus (latin) =&gt; [EN: with all else being equal]</td>
<td class="org-left">Termo usado em economia - signifca: com todas outras variáveis assumidas como constantes.</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Keynesian school of economics</td>
<td class="org-left">escola de pensamento de economia Keynesiana</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Chicago school of economics</td>
<td class="org-left">escola de pensamento de economia de Chicago</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><span class="underline">think tank</span></td>
<td class="org-left">instituo de pesquisa que auxilia e advoca em áreas de estudos sociais, política e economia. Exemplo: FGV - Fundação Getulio Vargas</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><span class="underline">policy institute</span></td>
<td class="org-left">institito de política, o mesmo que um think-tank como a FGV.</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">mainstream</td>
<td class="org-left">corrent principal, convencional</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">consultancy</td>
<td class="org-left">consultoria</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><span class="underline">peer review</span></td>
<td class="org-left"><span class="underline">revisão de pares</span></td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">peer reviewed cryptography</td>
<td class="org-left">criptografia <span class="underline">revista por pares</span> (expecialistas do campo)</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">peer reviewed article</td>
<td class="org-left">artigo com revisão de pares</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><span class="underline">scientific method</span></td>
<td class="org-left">método científico</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">experimental method</td>
<td class="org-left">método experimental</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">thought experiment</td>
<td class="org-left">experimento de pensamento/mental tal como o byzantine fault relacionado a sistemas distribuídos.</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">control group</td>
<td class="org-left">gropo de controle</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">clinical trial</td>
<td class="org-left">experimentos/ensaios clínicos</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><span class="underline">reproducility</span></td>
<td class="org-left">reproducibilidade</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">reproducible experiments</td>
<td class="org-left">experimentos reproduzíveis</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">reproducible calculations</td>
<td class="org-left">cálculos reproduzíveis</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">reproducible results</td>
<td class="org-left">resultados reproduzíveis</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">reproducible random numbers</td>
<td class="org-left">números aleatórios reproduzíveis</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">statistical significance</td>
<td class="org-left">significância estatística</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">hypothesis testing</td>
<td class="org-left">teste de hipótese</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">linear correlation</td>
<td class="org-left">correlação linear</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">correlation is not casuality</td>
<td class="org-left">correlação não é casualidade</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">standard deviation</td>
<td class="org-left">desvio padrão</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">average</td>
<td class="org-left">média</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">mean</td>
<td class="org-left">média</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">R&amp;D - Research and Development</td>
<td class="org-left">P&amp;D - Pesquisa e Desenvolvimento</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><span class="underline">state of art</span></td>
<td class="org-left">estado da arte, o que tem de mais avançado no campo de estudo</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><span class="underline">prior art</span></td>
<td class="org-left">arte anterior =&gt;&gt; artigos científicos e teses anteriores</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">cutting edge of technology</td>
<td class="org-left">tecnologia mais avançada</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Innovation</td>
<td class="org-left">Inovação</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">novelty</td>
<td class="org-left">novidade</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">research grant</td>
<td class="org-left">verba de pesquisa</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">op-ed (opinion piece)</td>
<td class="org-left">editorial ou artigo de opinião</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">essay</td>
<td class="org-left">redação/ensaio</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">article</td>
<td class="org-left">artigo</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><span class="underline">paper</span></td>
<td class="org-left">artigo científico</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><span class="underline">white paper</span></td>
<td class="org-left">artigo científico não publicado em journal</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">paper contributions</td>
<td class="org-left">contribuições do artigo científico.</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">report</td>
<td class="org-left">relatório</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">technical report</td>
<td class="org-left">relatório técnico</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">technical standards (embodies the past wisdom)</td>
<td class="org-left">padrões técnicos como ISO, ABNT, JIS, DIN</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">technical specification</td>
<td class="org-left">especificação técnica</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">thesis</td>
<td class="org-left">tese</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">undergraduate thesis</td>
<td class="org-left">tese de graduação</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">master thesis</td>
<td class="org-left">tese de mestrado</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">doctorate thesis</td>
<td class="org-left">tese de doutorado</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">phd thesis</td>
<td class="org-left">tese de PHD</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><span class="underline">journal</span></td>
<td class="org-left">publicação científica com revisão de pares</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><span class="underline">scientific journal</span></td>
<td class="org-left">publicação científica com revisão de pares</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">newspaper</td>
<td class="org-left">jornal de notiticias</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">magazine</td>
<td class="org-left">revista</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">novel</td>
<td class="org-left">romance - gênero literário - não confudir com "novela"</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><span class="underline">paperwork</span></td>
<td class="org-left">documentação, comprovantes e etc.</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">logic</td>
<td class="org-left">lógica</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">logical reasoning</td>
<td class="org-left">raciocínio lógico</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">rethorics</td>
<td class="org-left">retórica</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">arguments</td>
<td class="org-left">argumentos</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">aesthetics</td>
<td class="org-left">estética</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">to ask questions</td>
<td class="org-left">fazer perguntas</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">attendance</td>
<td class="org-left">presença em curso ou aula</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><span class="underline">syllabus</span></td>
<td class="org-left">programa do curso contendo, descrição, conteúdo programático, datas de provas e etc.</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><span class="underline">textbook</span></td>
<td class="org-left">livro texto de um curso</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><span class="underline">reference books</span></td>
<td class="org-left">livros de referência</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">fundamentals</td>
<td class="org-left">fundamentos</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">theory</td>
<td class="org-left">teoria</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">terminology</td>
<td class="org-left">terminologia</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">vocabulary</td>
<td class="org-left">vocabulário</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><span class="underline">jargon</span></td>
<td class="org-left">jargão - vocabulário específico de grupo profissional, geralmente não entedido por pessoas fora deste grupo.</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">theoretical</td>
<td class="org-left">teórica</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">rationale</td>
<td class="org-left">justificativa</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">contributions</td>
<td class="org-left">contribuições</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">problem statement</td>
<td class="org-left">declaração do problema</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">abstract</td>
<td class="org-left">sumário de paper</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">approach</td>
<td class="org-left">abordagem</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">assumptions</td>
<td class="org-left">hipotéses, premissas</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">methodology</td>
<td class="org-left">metodologia</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">brief</td>
<td class="org-left">sumário</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">subject</td>
<td class="org-left">assunto</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">summary</td>
<td class="org-left">sumário</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">overview</td>
<td class="org-left">visão geral</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">rebbutal</td>
<td class="org-left">refutação</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">acknowledgement</td>
<td class="org-left">reconhecimento</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">autorship</td>
<td class="org-left">autoria</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">authoring tools</td>
<td class="org-left">ferramentas de autoria como Latex, Lyx, Markdown, Emacs's org-mode &#x2026;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">outlier</td>
<td class="org-left">ponto fora da curva</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">datum</td>
<td class="org-left">dado (singular)</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">data</td>
<td class="org-left">dados (plural)</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">campus</td>
<td class="org-left">campus, área de universidade (singular)</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">campi</td>
<td class="org-left">campus no plural</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">chart</td>
<td class="org-left">gráfico</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">scatter plot</td>
<td class="org-left">gráfico de disperção</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">homework</td>
<td class="org-left">tarefa / tarefa de casa</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">assignment</td>
<td class="org-left">exercício de curso</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">deadline</td>
<td class="org-left">prazo</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">submission deadline</td>
<td class="org-left">prazo para entrega</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">submission guidelines</td>
<td class="org-left">regras de submissão ou regras para envio</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">lecture notes</td>
<td class="org-left">notas de aula impressas ou em PDF</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">handouts</td>
<td class="org-left">o mesmo que lecture notes</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">workload</td>
<td class="org-left">carga horária</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">cause-effect relationship</td>
<td class="org-left">relação de causa e efeito</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">input-output relationship</td>
<td class="org-left">relação de entrada e saida</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">spin off company</td>
<td class="org-left">Empresa de base tecnológica vinda de grupos de pesquisa de universidades. Exemplo: ARM holdings.</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">research</td>
<td class="org-left">pesquisa</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">investigation</td>
<td class="org-left">investigação</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">science</td>
<td class="org-left">ciência</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">pseudoscience</td>
<td class="org-left">pseudociência</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">scientific findings</td>
<td class="org-left">achados científicos</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">skepticism</td>
<td class="org-left">ceticismo</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">rationality</td>
<td class="org-left">racionalidade</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">rational</td>
<td class="org-left">racional</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">confirmation bias</td>
<td class="org-left">viéis de confirmação   - tendência a buscar informações e fontes que justifiquem suas crenças e valores.</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">survivor bias</td>
<td class="org-left">viéis de sobrevivente  - tendência a tirar conclusões somente nos sobreviventes, omitindo os não sobreviventes.</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">survivorship bias</td>
<td class="org-left">viéis de sobrevivente</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">logical fallacy</td>
<td class="org-left">falácia lógica</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">cherry picking</td>
<td class="org-left">metáfora: "apahar cerejas" - apresentar somente evidências que justifiquem a posição defendida, excluindo as contraditórias.</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">cognitive load</td>
<td class="org-left">carga cognitiva</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">heuristic</td>
<td class="org-left">heurística</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">mental model</td>
<td class="org-left">modelo mental</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">nondeterministic model</td>
<td class="org-left">modelo não determinístico</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">deterministic model</td>
<td class="org-left">modelo determinístico</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">mathematical notation</td>
<td class="org-left">notação matemática</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">formal definition</td>
<td class="org-left">definição formal</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><span class="underline">proof-of-cocept</span></td>
<td class="org-left">prova de conceito</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><span class="underline">reference implementation</span></td>
<td class="org-left">implementação de referência - implementação de algoritimo ou <span class="underline">technical standard</span> que serve de referência a todas outras implementações como OpenSSL.</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">implementation details</td>
<td class="org-left">detalhes da implementação</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">due dilligence</td>
<td class="org-left">devida diligência</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">notation as tool of thought</td>
<td class="org-left">notação como ferramenta de pensamento</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">draw your own conclusions</td>
<td class="org-left">tire suas proprias conclusões</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">weak evidence</td>
<td class="org-left">fraca evidência</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">strong evidence</td>
<td class="org-left">forte evidência</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">lack of evidence</td>
<td class="org-left">falta de evidência</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">principle of least suprise</td>
<td class="org-left">princípio da menor surpresa</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">principle of least astonishment</td>
<td class="org-left">princípio da menor privilégio (related to computer security)</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">principle of least privilege</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">sources</td>
<td class="org-left">fontes</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">authoritative sources</td>
<td class="org-left">fontes autoritativas</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">reputable sources</td>
<td class="org-left">fontes reputáveis</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">bibliography</td>
<td class="org-left">bibliografia</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">citation</td>
<td class="org-left">citação</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">cross references</td>
<td class="org-left">referências cruzadas</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">ISBN - International Standard Book Number</td>
<td class="org-left">Número Padrão Internacional de Livro =&gt;&gt; Número ou ID (Identifier) único para livros.</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">ISSN - International Standard Serial Number</td>
<td class="org-left">Número Serial Padrão Internacional ==&gt;&gt; Número ou ID (Identifier/identificador) único para medias como revistas ou livros.</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">DOI - Digital Object Identifer</td>
<td class="org-left">Identificador de Objeto Digital =&gt;&gt; Indentificador único que designa artigos científicos ou livros.</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">ACM</td>
<td class="org-left">Association for Computing Machinery</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">IEEE</td>
<td class="org-left">Institute of Electrical and Electronics Engineers</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">SAE</td>
<td class="org-left">Society of Automotive Engineers</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">IEC</td>
<td class="org-left">International Electrotechnical Commission</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">ISO</td>
<td class="org-left">International Organization for Standardization</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">ANSI (USA)</td>
<td class="org-left">American National Standards Institute</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">BS</td>
<td class="org-left">British Standards</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">DIN  (Deutsches Institut für Normung)</td>
<td class="org-left">German Institute for Standardization</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">JIS</td>
<td class="org-left">Japanese Standards Association</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">ABNT (Brazilian National Standards Organization)</td>
<td class="org-left">Associação Brasileira de Normas Técnicas</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left"><b>Finance, Business and Economics Related</b></td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left"><span class="underline">spreadsheet</span></td>
<td class="org-left">planilha (como Microsoft Excel ou Libreoffice Calc)</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">entrepreneur</td>
<td class="org-left">empreendedor(a)</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">entrepreneurship</td>
<td class="org-left">empreendedorismo</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">businessperson</td>
<td class="org-left">pessoa de negócios (empresário ou empresária)</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">businessman</td>
<td class="org-left">empresário ou homem de negócios</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">businesswoman</td>
<td class="org-left">empresária ou mulher de negócios</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">salesperson</td>
<td class="org-left">vendedor ou vendedora</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">salesman</td>
<td class="org-left">vendedor</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">saleswoman</td>
<td class="org-left">vendedora</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">sales pitch</td>
<td class="org-left">apresentação de venda de produto ou serviço a um potencial cliente (customer) com documentos, diagramas, slides e etc.</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">elevator pitch</td>
<td class="org-left">(fala de elevador) - curta descrição pesuasiva de serviço ou produto de modo que qualquer ouvinte (listener) possa endeter em curto periódo de tempo.</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">business model</td>
<td class="org-left">modelo de negócios</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">headquarter</td>
<td class="org-left">sede da empresa</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">subsidiary</td>
<td class="org-left">subsidiaria, sucursal</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">middle income trap  (emerging markets)</td>
<td class="org-left">armadilha da renda média (mercados emergentes)</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">accountability</td>
<td class="org-left">responsabilidade ou responsabilidade legal</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">to hold someone accountable</td>
<td class="org-left">responsabilizar alguém legalmente</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">to make a deal</td>
<td class="org-left">fazer acordo ou fechar negócio</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">to strike a deal</td>
<td class="org-left">fazer acordo ou fechar negócio</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">currency</td>
<td class="org-left">moeda</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">currency pegging</td>
<td class="org-left">vinculação ou indexação de taxa de câmbio (câmbio fixo) como por exemplo 10 unidades da moeda XYZ por Euro.</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">best performing currency</td>
<td class="org-left">moeda com melhor desempenho (performance) que mais se apreciou em relação a outras moedas.</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">worst performing currency</td>
<td class="org-left">moeda com pior desempenho (performance)</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">reserve currency</td>
<td class="org-left">moeda de reserva (lastro) usada por bancos centrais para lastrear a moeda - exemplo: Dólar.</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">legal tender</td>
<td class="org-left">moeda de curso forçado (moeda oficial) - a qual um governo obriga aceitar.</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">fiat currency</td>
<td class="org-left">dinheiro ou moeda fiduciário(a) - não lastreada em nenhum lastro como ouro.</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">fiat currency is backed by nothing</td>
<td class="org-left">dinheiro fiduciário não é lastreado por nada.</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">wire transfer</td>
<td class="org-left">pagamento por meio eletrônico</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">ATM - Automatic Teller Machine</td>
<td class="org-left">Caixa Eletrônico</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">underrated</td>
<td class="org-left">desvalorizado(a)</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">overrated</td>
<td class="org-left">super valorizado(a)</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">budget</td>
<td class="org-left">orçamento</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">budget cuts</td>
<td class="org-left">cortes de orçamento</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">budget limit</td>
<td class="org-left">limite de orçamento</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">budget surplus</td>
<td class="org-left">superavit de orçamento, receita maior que despesa</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">budget deficit</td>
<td class="org-left">deficit de orçamento, receita menor que despea</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">debt ceiling</td>
<td class="org-left">teto de gastos (debito) - para evitar hiperinflação</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">debt cap</td>
<td class="org-left">teto de gastos (debito) - o mesmo que 'debt ceiling'</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">cost overrun</td>
<td class="org-left">estouro de custos</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">trade deal</td>
<td class="org-left">acordo comercial</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">free trade</td>
<td class="org-left">livre comércio</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">free trade deal</td>
<td class="org-left">acordo de livre comércio</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">international trade</td>
<td class="org-left">comércio internacional</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">supply and demand</td>
<td class="org-left">oferta e demanda</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">bid price (buyers)</td>
<td class="org-left">preço de demanda - máximo preço que compradores (buyers) estão dispostos a pagar.</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">ask price (sellers)</td>
<td class="org-left">preço de oferta - mínimo preço que vendedores (sellers) estão dispostos a aceitar.</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">ask-bid price spread</td>
<td class="org-left">diferença entre o bid-price and ask-price</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">call option contract</td>
<td class="org-left">contrato derivativo de opção de compra</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">put option contract</td>
<td class="org-left">contrato derivativo de opção de venda</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">position</td>
<td class="org-left">posição =&gt; quantidade de ativos financeiros que um investidor tem.</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">long position  (derivatives)</td>
<td class="org-left">posição de compra ou posição comprada</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">short position (derivatives)</td>
<td class="org-left">posição de venda  ou posição vendida</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">short position</td>
<td class="org-left">posição de venda a descoberto (short selling)</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">to short a stock</td>
<td class="org-left">fazer venda a descoberto de uma ação (short selling)</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">short squeeze</td>
<td class="org-left">liquidação de posição de short sellers com compra do ativo para limitar perda devido aumentos inesperados de preço da ação ou ativo.</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">buy and hold strategy</td>
<td class="org-left">estratégia: comprar e manter um ativo financeiro  até o momento da venda com maior preço.</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">short selling</td>
<td class="org-left">venda a descoberto - venda de ação ou ativo finaceiro apostando na baixa ou queda do ativo.</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">short selling may have unlimited losses</td>
<td class="org-left">venda a descoberto pode ter perdas ilimitadas</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">emerging markets</td>
<td class="org-left">mercados emergentes</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">energy markets</td>
<td class="org-left">mercados de energia</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">foreign exchange market</td>
<td class="org-left">mercado de moeda extrangeira</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">financial market</td>
<td class="org-left">mercado financeiro</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">primary market</td>
<td class="org-left">mercado primário</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">secondary market</td>
<td class="org-left">mercado secundário</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">OTC market / over-the-counter market</td>
<td class="org-left">mercado de balcão não organizado em bolsa de valores, geralmente intermediado por corretoras ou bancos</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">future markets (future contracts)</td>
<td class="org-left">mercado de contratos derivativos futuros</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">bond market</td>
<td class="org-left">mercado de títulos de renda fixa</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">treasury bond market</td>
<td class="org-left">mercado de títulos do tesouro</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">spot market</td>
<td class="org-left">mercado a vista - em constraste com mercado de contratos derivativos futuros</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">single market</td>
<td class="org-left">mercado único - mercado homogêneo, com leis e linguas comuns. Examplos: USA, Brasil, América Latina (quase), Mercosur</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">customs union</td>
<td class="org-left">União Aduaneira - bloco comercial como Mercosur (Mercosul), União Europeia</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">expenditure</td>
<td class="org-left">despesas</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">CAPEX - Capital Expenditure</td>
<td class="org-left">Despesa de capital, investimento em máquina, software ou equipamento.</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">OPEX - Operational Expenditure</td>
<td class="org-left">Despesa operacional</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Cost Center</td>
<td class="org-left">Centro de custo</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Profit Center</td>
<td class="org-left">Centro de lucro</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Asset Management</td>
<td class="org-left">Gerenciamento de ativos</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Wealth Management</td>
<td class="org-left">Gerenciamento de riqueza/patrimônio</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Retail</td>
<td class="org-left">Varejo</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Wholesale</td>
<td class="org-left">Atacado</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Retail bank</td>
<td class="org-left">Banco de varejo</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Investment bank</td>
<td class="org-left">Banco de investimento</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">investment portfolio</td>
<td class="org-left">Portfolio, carteira de investimentos</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">fixed income assets</td>
<td class="org-left">ativos de renda fixa</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">fixed income instruments</td>
<td class="org-left">instrumentos/ativos de renda fixa</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">fixed income securities</td>
<td class="org-left">ativos finaceiros de renda fixa</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">debt securities</td>
<td class="org-left">ativos finaceitos baseados em debito</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">bonds</td>
<td class="org-left">títulos de renda fixa</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">bond yield</td>
<td class="org-left">rendimento ou taxa de retorno de título de renda fixa</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">inflation-indexed bonds or inflation-linked bonds</td>
<td class="org-left">títulos de renda fixa com rendimento atrelado a inflação, usados para hedging contra infação - exemplo: títulos NTN-B ou NTN-C do tesouro do Brasil.</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">high yield bonds</td>
<td class="org-left">títulos de renda fixa com alto rendimento (altos juros), contudo muitas vezes com mais risco</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">junk bond</td>
<td class="org-left">títulos de renda fixa de grau especulativo (alto risco), contudo muitas vezes com altos juros e alto prêmio de risco</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">treasury bonds</td>
<td class="org-left">títúlos do fixa do tesouro, emitidos por governos</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">corporate bonds</td>
<td class="org-left">títulos de renda fixa emitidos por empresas privadas ou corporações</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">credit rating</td>
<td class="org-left">nota de crédito - dada por agências como Moody</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">rating agency</td>
<td class="org-left">agência de classificação de risco que dão notas de crédito como: <span class="underline">Moody's</span>, <span class="underline">S&amp;P - Standards &amp; Poort's</span> e <span class="underline">Fitch</span></td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">M&amp;A - Merging &amp; Acquisition</td>
<td class="org-left">Fusões e Aquisições</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">R&amp;D - Research &amp; Development</td>
<td class="org-left">Pesquisa e desenvolvimento</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">QA - Quality Assurance</td>
<td class="org-left">Garantia de qualidade</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">B2B - Business-To-Business</td>
<td class="org-left">Empresa para Empresa =&gt; Empresa que presta serviço a outras empresas</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">B2C - Business-To-Consumer</td>
<td class="org-left">Empresa para consumidor</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">B2G - Business-To-Government</td>
<td class="org-left">Empresa para governo</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">P2P - Person-To-Person (Sharing Economy)</td>
<td class="org-left">Pessoa para Pessoa, intermediado por alguma plataforma como Airbnb (sharing economy - economia compartilhada)</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">bull market (bullish)</td>
<td class="org-left">mercado touro / mercado com tendência de alta</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">bear market (bearish)</td>
<td class="org-left">mercado urso / mercado com tendência de baixa</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">bullish investors</td>
<td class="org-left">investidores com expectativas positivas sobre o mercado ou sobre um ativo</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">bearish investors</td>
<td class="org-left">investidores com expectativas negativas sobre o mercado ou sobre um ativo</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">economic forecast</td>
<td class="org-left">previsão econômica</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">exchange rate forecast</td>
<td class="org-left">previsão para taxa de câmbio</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">black swan</td>
<td class="org-left">metafora: cisne negro, evento raro e inesperado para o qual não se estava preparado.</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">educated guess</td>
<td class="org-left">estimativa educada</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">foreign direct investment</td>
<td class="org-left">investimento extrangeiro direto</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">board of directors</td>
<td class="org-left">Conselho diretor de empresa</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">contractor</td>
<td class="org-left">profissional autônomo, profissional liberal ou empresa terceirizada</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">government  contractor</td>
<td class="org-left">empresa terceirizada que presta serviços ao governo</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">limited liability</td>
<td class="org-left">responsabilidade limitada (credores só podem tomar no máximo o que foi investido)</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">limited liability company</td>
<td class="org-left">empresa de responsabilidade limitada</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">publicly traded company</td>
<td class="org-left">sociedade anônima - empresa de capital aberto negociada em bolsa</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">IPO - Initial Public Offering</td>
<td class="org-left">Oferta Pública Inicial =&gt; Abertura de capital com oferta incial de acões de uma empreas no mercado primário.</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">monetary policy</td>
<td class="org-left">política monetária</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">fiscal policy</td>
<td class="org-left">política fiscal</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">industrial policy</td>
<td class="org-left">política industrial</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">interest</td>
<td class="org-left">juros</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">interest payment</td>
<td class="org-left">pagamento de juros</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">interest rate</td>
<td class="org-left">taxa de juros</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">interest rate spread</td>
<td class="org-left">diferença entre taxas de juros, as vezes medidas em basis-points (pontos base)</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">interest rate hike</td>
<td class="org-left">aumento de taxa de juros</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">negative interest rate</td>
<td class="org-left">taxa de juros negativa</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">compound interest rate</td>
<td class="org-left">taxa de juros composta</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">continous compound interest rate</td>
<td class="org-left">taxa de juros composta continuamente (usada em cálculos de derivativos)</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">exchange rate</td>
<td class="org-left">taxa de câmbio</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">floating exchange rate system</td>
<td class="org-left">regime de câmbio flutuante</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">fixed exchange rate system</td>
<td class="org-left">regime de câmbio fixo</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">CPI - Consumer Price Index</td>
<td class="org-left">Índice de Preços ao Consumidor (indicador de inflação)</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">inflation rate</td>
<td class="org-left">taxa de inflação</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">inflation target</td>
<td class="org-left">meta de inflação (regime de metas de inflação adotado no Brasil e outros paises)</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">inflation hedging</td>
<td class="org-left">estratégia de proteção de ativos contra inflação</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Shrinkflation</td>
<td class="org-left">processo de reduzir quantidade de produto em embalagem quando há inflação para manter o mesmo preço</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">growth rate</td>
<td class="org-left">taxa de crescimento</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">mark-to-market</td>
<td class="org-left">marcação a mercado - precificação de ativo ou posição continuamente</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">RoR - rate of return</td>
<td class="org-left">taxa de retorno</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><span class="underline">TVM (Time-Value-Of-Money)</span> Calculations</td>
<td class="org-left">Cálculos do valor do dinheiro no tempo (Valor presente, valor futuro, e etc.)</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><span class="underline">IRR</span> - Internal Rate Of Return</td>
<td class="org-left">taxa de interna de retorno (TIR)</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><span class="underline">NPV</span> - Net Present Value</td>
<td class="org-left">valor presente líquido</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><span class="underline">NFV</span> - Net Future Value</td>
<td class="org-left">valor futuro líquido</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">payback (time)</td>
<td class="org-left">tempo para recupera valor total do investimento.</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><span class="underline">yield curve</span></td>
<td class="org-left">curva de juros</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">quantitative easing</td>
<td class="org-left">afrouxamento monetário (ação de banco central)</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">clearing house</td>
<td class="org-left">casa de liquidação e custódia</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">stock exchange</td>
<td class="org-left">bolsa de valores, similar a Bovespa</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">financial records</td>
<td class="org-left">registros financeiros</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">transaction records</td>
<td class="org-left">registros de trasação</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">balance sheet</td>
<td class="org-left">demonstrativo financeiro: balancete ou balanço patrimonial</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">cash flow statement</td>
<td class="org-left">demonstrativo de fluxo de caixa</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">net worth</td>
<td class="org-left">patrimônio líquido</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">saving account</td>
<td class="org-left">conta poupança</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">checking account</td>
<td class="org-left">conta corrente</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">savings</td>
<td class="org-left">poupança</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">savings rate</td>
<td class="org-left">taxa de pupança</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">assets</td>
<td class="org-left">ativos em contabilidade</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">liquid assets</td>
<td class="org-left">ativos liquidos (com grande liquidez)</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">illiquid assets</td>
<td class="org-left">ativos não liquidos (com baixa liquidez)</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">real estate assets</td>
<td class="org-left">ativos imobiliários</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">physical assets</td>
<td class="org-left">ativos físicos (baixa liquidez)</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">inventory</td>
<td class="org-left">estoque de produtos (ativos físicos)</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">COG - Cost of Goods Sold</td>
<td class="org-left">Custo de mercadorias vendidas</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">financial assets</td>
<td class="org-left">ativos financeiros</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">asset pricing</td>
<td class="org-left">precificação de ativos</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">asset pricing model</td>
<td class="org-left">modelo de precificação de ativos</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">overvalued asset</td>
<td class="org-left">ativo super valorizado</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">undervaluated asset</td>
<td class="org-left">ativo desvalorizado</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">securities</td>
<td class="org-left">ativos finaceiros negociados em bolsa</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">liabilities</td>
<td class="org-left">passivos ou obrigações em contabilidade</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">equity</td>
<td class="org-left">patrimônio líquido, capital próprio ou ação de uma empresa.</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">liquidity</td>
<td class="org-left">liquidez - facilidade de conversão de ativo em dinheiro e vice versa</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">liquidity</td>
<td class="org-left">liquidez - pode ser quantificada como o volume de negociação de um ativo (asset)</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">low liquidity assets</td>
<td class="org-left">ativos de baixa liquidez</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">high liquidity assets</td>
<td class="org-left">ativos de alta liquidez</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">shareholders</td>
<td class="org-left">acionistas de uma empresa de capital aberto</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">stockholders</td>
<td class="org-left">acionistas de uma empresa de capital aberto</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">stakeholders</td>
<td class="org-left">partes interessadas de uma empresa (credores, funcionarios, sociedade e etc.)</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">customers</td>
<td class="org-left">clientes de uma empresa</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">creditors</td>
<td class="org-left">credores</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">partners</td>
<td class="org-left">parceiros</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">partnership</td>
<td class="org-left">parceria</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">strategic partnership</td>
<td class="org-left">parceria estratégica</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">leverage (also known as - gearing)</td>
<td class="org-left">alavancagem ou uso de endividamento para aumentar retorno no investmento.</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">ROI - Return On Investment</td>
<td class="org-left">Retorno no investmento (métrica)</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">ROA - Return On Assets</td>
<td class="org-left">Returno nos ativos (métrica)</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">EPS - Earning Per Share</td>
<td class="org-left">Ganhos por ação</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">earnings report</td>
<td class="org-left">Relatos/relatório de ganhos</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">market sell-off</td>
<td class="org-left">Massiva venda do ativo ou ação em um curto periodo de tempo que causa considerável queda de seu valor.</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">global annual turnover</td>
<td class="org-left">receita total anual global (aplicado a multi nacionais)</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">revenue</td>
<td class="org-left">receita ou faturamento</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">revenue stream</td>
<td class="org-left">fluxo de receitas</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">net revenue</td>
<td class="org-left">receita liquida (lucro)</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">profit</td>
<td class="org-left">lucro</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">profit margin</td>
<td class="org-left">margem de lucro</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">dividends</td>
<td class="org-left">dividendos - lucro distribuido a acionistas (shareholders)</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">stocks</td>
<td class="org-left">ações - fatia de capital social de empresa de capital aberto negociada em bolsa</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">shares</td>
<td class="org-left">ações - o mesmo que stocks</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">preferred stock</td>
<td class="org-left">ação preferencias - tem prioridade dividendos, mas sem direito a voto.</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">common stock</td>
<td class="org-left">ação ordinária - tem direito a votos</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">stocks buybacks (USA)</td>
<td class="org-left">recompra de ações para aumentr o preço da ação e distribuir lucro feita por empresas Americanas devido a dividendos nos EUA serem taxados.</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">shares buybacks (USA)</td>
<td class="org-left">recompra de ações, o mesmo que "stocks buybacks". Não existe no Brasil.</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">operating margin</td>
<td class="org-left">margem operacional</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">loss</td>
<td class="org-left">perda/prejuízo</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><span class="underline">working capital</span></td>
<td class="org-left">capital de giro</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">non realized earnings</td>
<td class="org-left">ganhos/receitas não realizados(as). Exemplo: imóvel que aumentou de valor, mas não foi vendido.</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">non reliazed gains</td>
<td class="org-left">ganhos/receitas não realizados</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">market capitalization (market cap)</td>
<td class="org-left">capitalização da empresa (total valor de mercado)</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">market share</td>
<td class="org-left">fatia de mercado ou participação de mercado de uma empresa.</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">MRR - Monthly Recurring Revenue</td>
<td class="org-left">Receita recorrente mensal (métrica usada por startups)</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">flagship product</td>
<td class="org-left">produto mais importante</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">MVP - Minimum Viable Product</td>
<td class="org-left">Produto Minimamente Viavel (startup company)</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">POC - Proof-Of-Concept</td>
<td class="org-left">Prova de conceito (startup company)</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Retention rate</td>
<td class="org-left">Taxa de retenção (startup company)</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">User Engagement</td>
<td class="org-left">Engajamento de usuário (startup)</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Marginal Cost</td>
<td class="org-left">Custo marginal (startup)</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Zero Marginal Cost</td>
<td class="org-left">Zero Custo marginal (startup)</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">CAGR - Compound Annual Growth Rate</td>
<td class="org-left">Taxa de crescimento média anual composta</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">SME - Small and mid-size enterprises</td>
<td class="org-left">pequenas e médias empresas</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">SMB - Small and mid-size business</td>
<td class="org-left">pequenas e médias empresas</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">bankruptcy</td>
<td class="org-left">falência</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">insolvency</td>
<td class="org-left">insolvência</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">bailout</td>
<td class="org-left">resgate financeiro</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">mortgage</td>
<td class="org-left">hipoteca (uso de ativos imobiliários como garantia)</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">mortgage backed securities</td>
<td class="org-left">ativos financeiros lastreados em hipotecas</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">stake</td>
<td class="org-left">Participação em negócio (ter fatia de capitla de empresa) ou interesse</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">controlling stake</td>
<td class="org-left">Participação controladora em capital de empresa (acionista controlador)</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">majority stake</td>
<td class="org-left">Participação majoritaria em capital (acionista controlador)</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">business stake</td>
<td class="org-left">Participação em negócio</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">business interest</td>
<td class="org-left">Participação em negócio</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Private Equity Fund</td>
<td class="org-left">Fundo de Participações Privadas - o qual compra participação em capital (stake) de empresas privadas.</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">ETF Fund - Exchange Traded Fund (Passive Fund)</td>
<td class="org-left">Fundo de índice (Fundo passivo) ou fundo negociado em bolsa que segue algum índice como S&amp;P-500 ou Ibovespa</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Index Fund (Passive Fund)</td>
<td class="org-left">O mesmo que ETF</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Trust fund</td>
<td class="org-left">Fundo fiduciário</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Hedge fund</td>
<td class="org-left">Fundo de hedge (fundo de cobertura)</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Mutual fund</td>
<td class="org-left">Fundo mútuo</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Pensions fund</td>
<td class="org-left">Fundo de pensão</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">REIT - Real Estate Investment Trust</td>
<td class="org-left">Fundo de investimento imobiliário (EUA)</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Sovereign Wealth Fund</td>
<td class="org-left">Fundo de riqueza soberano</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Venture Capital Fund</td>
<td class="org-left">Fundos de capital de risco, compram participação (stake) em capital de startups e empresas em early stage (estágio inicial)</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Actively Managed Fund</td>
<td class="org-left">Fundo gerenciado ativamente - em constraste com ETFs</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">economic externality</td>
<td class="org-left">externalidade economica</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">network effect           (externality)</td>
<td class="org-left">efeito de rede</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">information asymetry     (externality)</td>
<td class="org-left">asimetria da informação (externalidade - economia)</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">risk</td>
<td class="org-left">risco</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">risk aversion</td>
<td class="org-left">aversão ao risco</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">risk, return and liquidity tradeoff</td>
<td class="org-left">balanço entre risco, retorno e liquidez</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">market risks</td>
<td class="org-left">riscos de mercado</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">foreign exchange risks</td>
<td class="org-left">riscos câmbiais</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">default risk</td>
<td class="org-left">risco de inadimplência, risco de default</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">sovereign debt default risk</td>
<td class="org-left">risco de default de debito soberano (divida de pais com credores internacionais)</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">risk exposure</td>
<td class="org-left">exposição ao risco</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">emerging market risks</td>
<td class="org-left">risco de mercados emergentes</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">emerging market risk exposure</td>
<td class="org-left">exposição a risco de mercados emergentes</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">risk premium</td>
<td class="org-left">prêmio de risco - exigido por investidores para tomarem maior risco.</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">opportunity cost</td>
<td class="org-left">custo de oportunidade</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">foreign exchange reserverves</td>
<td class="org-left">reservas em moeda extrangeira</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Trade deficit</td>
<td class="org-left">Deficit na balança comercial, importa mais que exporta</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Trade surplus</td>
<td class="org-left">Superavit na balança comercial, exporta mais que importa</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">GDP - Grosss Domestic Product</td>
<td class="org-left">Produto Interno Bruto</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">GDP growth</td>
<td class="org-left">Crescimento do GDP</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">GDP per capita</td>
<td class="org-left">GDP per capita (por pessoa)</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Income per capita</td>
<td class="org-left">Renda per capita (por pessoa)</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Disposable income per capita</td>
<td class="org-left">Renda disponível (liquida) por pessoa</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Well being</td>
<td class="org-left">Bem-estar</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Standard of living</td>
<td class="org-left">Padrão de vida</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Cost of living</td>
<td class="org-left">Custo de vida</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">down payment</td>
<td class="org-left">entrada, pagamento a vista</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">upfront cost</td>
<td class="org-left">custo inicial ou custo a vista</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">upfront payment</td>
<td class="org-left">pagamento a vista</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">installment payment</td>
<td class="org-left">pagamento em parcela</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">installments</td>
<td class="org-left">parcelas</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">place an order</td>
<td class="org-left">fazer um pedido, fazer uma compra</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">fulfill an order</td>
<td class="org-left">completar um pedido</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">supply chain</td>
<td class="org-left">cadeia logistica</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">shipment</td>
<td class="org-left">carregamento</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">shipping time</td>
<td class="org-left">tempo de frete</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">shipping cost or freight cost</td>
<td class="org-left">custo de frete</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">shipping industry</td>
<td class="org-left">industria/setor de frete/transporte/transportadora</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">supply chain company</td>
<td class="org-left">empresa de cadeia logistica</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">FOB - Free On Board or Freight on Board</td>
<td class="org-left">Designa que a responsabilidade (liability) é passada do vendedor (buyer) para o vendedor (seller)</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">third parties</td>
<td class="org-left">terceiros</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">one-stop-shop</td>
<td class="org-left">loja de uma única parada, loja que tem tudo como a AWS ou GCP na cloud.</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">online marketplace</td>
<td class="org-left">mercado online como Mercado Libre</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">dealership</td>
<td class="org-left">concessionária (revendedor de carros ou veículos)</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">accounting</td>
<td class="org-left">contabilidade</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">GAPP - Generally Accepted Accouting Principles (USA)</td>
<td class="org-left">Padrão de contabilidade usado nos EUA</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">IFRS - International Finacial Reporting Standards (IFRS)</td>
<td class="org-left">Padrão de contabilidade usado na maioria das jurisdições do mundo por empresas de capital aberto.</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">income tax</td>
<td class="org-left">imposto de renda</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">income tax return</td>
<td class="org-left">declaração de imposto de renda</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">tax breaks</td>
<td class="org-left">incentivos fiscais</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">tariff</td>
<td class="org-left">imposto de importação; tarifa de importação</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">fee</td>
<td class="org-left">taxa</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">fine (fines)</td>
<td class="org-left">multa - punição financeira</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">dividend tax</td>
<td class="org-left">imposto sobre dividendos</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">property tax</td>
<td class="org-left">imposto sobre imóvel, exemplo: IPTU do Brasil</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">payroll taxes</td>
<td class="org-left">impostos e encargos sobre folha salarial</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">corporate taxes</td>
<td class="org-left">impostos corporativos</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">witheld tax</td>
<td class="org-left">imposto retido na fonte</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">VAT (Value Added Tax) tax, also known as sales tax</td>
<td class="org-left">imposto de valor adicionado como ICMS e IPI do Brasil</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">tax reform</td>
<td class="org-left">reforma tributária</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">progressive tax system</td>
<td class="org-left">sistema tributário progressivo</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">regressive tax system</td>
<td class="org-left">sistema tributário regressivo (Brasil - a maior parte das receitas de impostos incidem sobre o consumo - quanto menos tem, mais paga!)</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">depreciation</td>
<td class="org-left">depreciação</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">red tape (bureaucracy)</td>
<td class="org-left">burocracia</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">insurance</td>
<td class="org-left">seguro</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">insurane policy</td>
<td class="org-left">política/regras do seguro</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">insurance coverage</td>
<td class="org-left">cobertura de seguro / apolice</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">insurance premium</td>
<td class="org-left">prêmio de seguro / pagamento mensal ao seguro</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">insurance agent</td>
<td class="org-left">vendedor de seguros</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2022-05-26 Thu 20:17</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
